[{
  "_id": {
    "$oid": "666b3fc900105718d9a4b6f4"
  },
  "movie_id": {
    "$oid": "666b0bcbff071d36d47fa04d"
  },
  "user_id": {
    "$oid": "666b38f200105718d9a4b48d"
  },
  "content": "FULL SPOILER-FREE REVIEW @ https://talkingfilms.net/dune-part-two-review-the-new-generational-epitome-of-sci-fi-epics/\r\n\r\n\"Dune: Part Two surpasses even the highest expectations, establishing itself as an unquestionable technical masterpiece of blockbuster filmmaking.\r\n\r\nWith a narrative that deepens the complex web of political relationships, power, faith, love, and destiny, it not only provides a breathtaking audiovisual spectacle, thanks to the genius of Denis Villeneuve, Greig Fraser, and Hans Zimmer, but it also offers a profound meditation on universal human themes through thematically rich world-building and thoroughly developed characters. The superb performances of the entire cast, led by a career-best Timothée Chalamet and a mesmerizing Zendaya, further elevate this incredibly immersive cinematic experience.\r\n\r\nIt warrants comparisons with the greatest sequels in history, easily becoming the new generational epitome of sci-fi epics.\"\r\n\r\nRating: A+",
  "created_at": {
    "$date": "2024-02-22T21:00:01.602Z"
  },
  "updated_at": {
    "$date": "2024-02-22T21:00:01.712Z"
  },
  "helpful": null,
  "not_helpful": null
},
{
  "_id": {
    "$oid": "666b3fc900105718d9a4b6f5"
  },
  "movie_id": {
    "$oid": "666b0bcbff071d36d47fa04d"
  },
  "user_id": {
    "$oid": "666b38f200105718d9a4b48f"
  },
  "content": "As anticipated, a thrilling watch!\r\n\r\nI enjoyed <em>'Dune'</em>, though remember thinking it was obviously a complete set-up to a sequel and that this would only improve upon its predecessor - and that's very much the case. <em>'Dune: Part Two'</em> is excellent! My interest did wane slightly at roughly the middle part, as was similarly the case with the first film in truth, but that was a feeling that only lasted for a relativiely short time.\r\n\r\nAll in all, it's fantastic. The acting is top notch, the visuals are breathtaking <em>(those sandworms tho)</em> and the score is outstandingly hefty - you can always rely on the great Hans Zimmer! Timothée Chalamet stars yet again, as do the likes of Rebecca Ferguson, Zendaya, Dave Bautista & Co. The person I actually enjoyed most on screen was Javier Bardem, who is truly brilliant throughout. \r\n\r\nBring on <em>'Dune Messiah'</em>! On that note, happy to read that director Denis Villeneuve has noted that he won't be rushing that one out - and rightly so!",
  "created_at": {
    "$date": "2024-03-01T20:44:30.916Z"
  },
  "updated_at": {
    "$date": "2024-03-01T20:44:31.016Z"
  },
  "helpful": null,
  "not_helpful": null
},
{
  "_id": {
    "$oid": "666b3fc900105718d9a4b6f6"
  },
  "movie_id": {
    "$oid": "666b0bcbff071d36d47fa04d"
  },
  "user_id": {
    "$oid": "666b38f200105718d9a4b491"
  },
  "content": "This is certainly a great looking film to see on a big screen with some really effective, almost industrially sounding, audio - but what happened to the story? It's wafer thin and really stretched out for 2¾ hours. We pick up with \"Paul\" (Timothée Chalamet) and his mother (Rebecca Ferguson) trying to convince the \"Fremen\" that they are worth the hassle. Fortunately, leader \"Stilgar\" (Javier Bardem) is convinced of the messianic state of the young refugee, whilst their own reverend mother is on her last legs which might give \"Jessica\" a chance to prove her own worth, and provide an opportunity to peddle some embellished mythology about her son's ascendant propheteering. All of this manoeuvring and politicking is having quite an impact on \"Chani\" (the under-used Zendaya) and on the relationship between her and the increasingly worshipped new Duke. Meantime, now fully reinvigorated and emerged from his bath of recuperative Guinness, the evil \"Baron Harkonnen\" (an almost Zeppelin-like Stellan Skarsgård) has recruited his lethal nephew \"Feyd-Rautha\" (Austin Butler) to get to grips with the rebellion on \"Arrakis\" that is bringing him into the gaze of an ill-satisfied emperor (Christopher Walken). Battle lines are drawn! Now whilst I did enjoy this, the rest of the film is a gloriously photographed but slowly paced hybrid of \"Khartoum\" (1966) and \"Lawrence of Arabia\" (1962) with a bit of the \"Phantom Menace\" (1999) thrown in for good measure. The acting is adequate but the characterisations are all too routinely sacrificed at the altar of the stunning visuals and from about an hour to go, I was convinced this this was but part two of three (or maybe even more). Walken and Charlotte Rampling feature all too sparingly to make much difference, indeed even Zendaya's warrior-like tendencies seem to have been neutered rather and I though that Chalamet just tried far too hard to imbue his character with a strength that he was far more successful with first time round. That said, it does work well enough as a classy and well produced sci-fi adventure with plenty of action and mysticism but I needed more meat on it's bones. I still get distinctly squeamish when I watch what they do with the water, let alone where they get it from!!",
  "created_at": {
    "$date": "2024-03-02T07:51:57.297Z"
  },
  "updated_at": {
    "$date": "2024-03-02T07:51:57.395Z"
  },
  "helpful": null,
  "not_helpful": null
},
{
  "_id": {
    "$oid": "666b3fc900105718d9a4b6f7"
  },
  "movie_id": {
    "$oid": "666b0bcbff071d36d47fa04d"
  },
  "user_id": {
    "$oid": "666b38f200105718d9a4b493"
  },
  "content": "An absolutely mesmerizing masterpiece, breathtaking cinematography and a spellbinding soundtrack that elevate the viewing experience to unparalleled heights. It serves as a testament to the brilliance of the book series, standing as the pinnacle of sci-fi cinema history. Thanks, Villeneuve!",
  "created_at": {
    "$date": "2024-03-04T20:10:01.698Z"
  },
  "updated_at": {
    "$date": "2024-03-19T15:09:37.075Z"
  },
  "helpful": null,
  "not_helpful": null
},
{
  "_id": {
    "$oid": "666b3fc900105718d9a4b6f8"
  },
  "movie_id": {
    "$oid": "666b0bcbff071d36d47fa04d"
  },
  "user_id": {
    "$oid": "666b38f200105718d9a4b495"
  },
  "content": "Great but a little long. Sexier than LotR and no hair. Yell acting. Jabba bathes in black goo and kills women horribly. Walken is hilarious. Zendaya still an addict. Bridges is a bit self-serious. Amazing visuals. Really enjoyed...was glad and a bit bored by the end. Shorter Dunes please.",
  "created_at": {
    "$date": "2024-03-05T08:04:34.097Z"
  },
  "updated_at": {
    "$date": "2024-03-05T08:04:34.332Z"
  },
  "helpful": null,
  "not_helpful": null
},
{
  "_id": {
    "$oid": "666b3fc900105718d9a4b6f9"
  },
  "movie_id": {
    "$oid": "666b0bcbff071d36d47fa04d"
  },
  "user_id": {
    "$oid": "666b38f200105718d9a4b497"
  },
  "content": "Saw it on the bigger screen, which was worth it. The worms were quite large. The movie has a great way of passing across the grand scale of the world in a way that michael bay can never understand how to do with his robots movies.\r\n\r\nIt did stretch on quite a bit, looking back not even sure where all the three hours went. Its just all shaping up for the big battle with a bit of political intrigue here and there. Also, still have no idea how they get off the worms or how they load up large groups of people onto the worms, like, can they stop the worms whenever they want and let people climb on, and then giddy up, but if thats the case why dont they have stabled worms ready to go.",
  "created_at": {
    "$date": "2024-03-23T16:48:11.995Z"
  },
  "updated_at": {
    "$date": "2024-03-23T16:48:12.195Z"
  },
  "helpful": null,
  "not_helpful": null
},
{
  "_id": {
    "$oid": "666b3fc900105718d9a4b6fa"
  },
  "movie_id": {
    "$oid": "666b0bcbff071d36d47fa04d"
  },
  "user_id": {
    "$oid": "666b38f200105718d9a4b499"
  },
  "content": "I had to watch Dune part 1 because if I didn't, I would not have known what to expect in Dune part 2. The movie was incredible. To see it on the big screen really makes a difference. You need to see every angle possible. I understand why it needed to be that way. I loved the movie. I would watch Dune 1 and 2 over again. I didn't like the scene where Feyd-Rautha died. But it was necessry if they planned on doing a third installment for Dune. The casting for this film was picked brilliantly. It fit them like they were part of the era of Dune itself.",
  "created_at": {
    "$date": "2024-04-02T17:45:23.230Z"
  },
  "updated_at": {
    "$date": "2024-04-08T16:22:27.511Z"
  },
  "helpful": null,
  "not_helpful": null
},
{
  "_id": {
    "$oid": "666b3fc900105718d9a4b6fb"
  },
  "movie_id": {
    "$oid": "666b0bcbff071d36d47fa04d"
  },
  "user_id": {
    "$oid": "666b38f200105718d9a4b49b"
  },
  "content": "**Not bad**\r\n\r\nOverall, a nice movie.\r\n\r\nBut it was not something extraordinary. The acting and direction were pretty average. There were a lot of editing mistakes. In some scenes, you feel like it was rushed. Some scenes feel like they are missing context. Some scenes are unnecessarily slow-paced.\r\n\r\nThere were a lot of stupid and logical fallacies. First, they show how dangerous those 'worms' are and run for life. Then they show you can actually 'tame' them like a cowboy, but with immense difficulty. Then you see the whole clan with tents, food, luggage, etc., riding them for traveling. I literally couldn't hold my laughter.\r\n\r\nWell, in the end, I was entertained.\r\n\r\nRating: 7/10",
  "created_at": {
    "$date": "2024-04-05T07:35:52.565Z"
  },
  "updated_at": {
    "$date": "2024-04-09T15:45:08.650Z"
  },
  "helpful": null,
  "not_helpful": null
},
{
  "_id": {
    "$oid": "666b3fc900105718d9a4b6fc"
  },
  "movie_id": {
    "$oid": "666b0bcbff071d36d47fa04d"
  },
  "user_id": {
    "$oid": "666b38f200105718d9a4b49d"
  },
  "content": "I remember the first film, no not the first in this contemporary series but the first attempt to bring the books, to cinema. \r\n\r\nIn terms of contextual cohesiveness and pacing I feel it did a better job, than its latter day counterpart. I believe with this effort they are going for sweeping epic but somehow it comes across as inexplicably pedestrian.\r\n\r\nYes cinematography is remarkable, as are CGI effects but the pacing is slow and things happen that don't come together all that well or give the sense that they are contributing, meaningfully, to the overall story. Acting is competent but again, its not remarkable, which I think is in part down to a lack of depth, in characterisations.\r\n\r\nI know this review probably wont be popular or reflective of the mainstream but I sense they are trying to do too much and as a consequence, achieving too little.\r\n\r\nIn summary, visually compelling but lacking in a certain intensity and depth. Feels contextually spare and at times redundant, if that makes sense. Still worth a look if you liked the books.",
  "created_at": {
    "$date": "2024-04-10T00:35:34.524Z"
  },
  "updated_at": {
    "$date": "2024-04-10T00:43:59.832Z"
  },
  "helpful": null,
  "not_helpful": null
},
{
  "_id": {
    "$oid": "666b3fc900105718d9a4b6fd"
  },
  "movie_id": {
    "$oid": "666b0bcbff071d36d47fa04e"
  },
  "user_id": {
    "$oid": "666b38f200105718d9a4b48d"
  },
  "content": "FULL SPOILER-FREE REVIEW @ https://fandomwire.com/godzilla-x-kong-the-new-empire-review/\r\n\r\n\"Godzilla x Kong: The New Empire is a “more” version of the previous installment. More Hollow Earth, more Titans, more gloriously giant fights filled with fantastic visual effects… and much more nonsense too.\r\n\r\nThrough an openly absurd narrative, Adam Wingard takes the charm and chemistry of his cast to help focus the film’s main spotlight on the titanic protagonists, Godzilla and Kong, delivering two hours of pure, unadulterated entertainment.\r\n\r\nIt won’t convert the most skeptical, but it will certainly solidify the unashamed passion of MonsterVerse fans.\"\r\n\r\nRating: B",
  "created_at": {
    "$date": "2024-03-28T18:01:31.827Z"
  },
  "updated_at": {
    "$date": "2024-03-28T18:01:31.973Z"
  },
  "helpful": null,
  "not_helpful": null
},
{
  "_id": {
    "$oid": "666b3fc900105718d9a4b6fe"
  },
  "movie_id": {
    "$oid": "666b0bcbff071d36d47fa04e"
  },
  "user_id": {
    "$oid": "666b38f200105718d9a4b491"
  },
  "content": "It has to get at least three stars because it's got Dan Stevens (and his piercing eyes) in it. Otherwise, this is an entirely derivative and predictable effort that leaves nothing at all to our imagination. A truce has broken out since the last time (2021), with \"Kong\" ruling the roost deep in \"Hollow Earth\"; \"Godzilla\" curled up asleep in the Coliseum and \"Ilene\" (Rebecca Hall) and the troubled \"Jia\" (Kaylee Hottle) keeping an eye on things for \"Monarch\" and mankind. \"Kong\" has a bad tooth so he comes to the humans for help. Fortunately, \"Trapper\" (the aforementioned DS) is a dab hand at grand-scale dentistry but it's while the ape is topside that alarm bells go off. \"Godzilla\" starts marauding again and an undiscovered vortex in the nether world requires investigation by \"Kong\" and his human pals. With \"Bernie\" (Brian Tyree Henry) back in the gang, off they all go to discover that a new menace has arrived, destroyed their monitoring outpost and it is now setting up a battle royal with just about every Titan left on Earth - above or below. Adam Winyard does just about everything on this film, and that shows in a complete lack of objectivity when evaluating this third rate adventure, the banal writing and equally lacklustre acting. It's as plain as the nose on your face why \"Godzilla' - who doesn't feature so much in this - is collecting energy, and when we do eventually get to them, the combat scenes are repetitive and too tightly choreographed. The scale is all over the place too. At times \"Kong\" appears the size of an house, at others he's more like a mouse. The visual effects are put to good use, but Hall just underwhelms, Henry talks way too much and Stevens' busky humour just doesn't hit home at all. I know it's difficult to keep coming up with new ideas for this genre and it must be difficult for the actors to constantly engage with nothing but some greenscreen, but the story is thin and the film reminds you of just about everything from \"Jurassic Park\" to episodes of \"Stargate\". It does need a big screen, though. On television it will be even more forgettable - but I did like the moth.",
  "created_at": {
    "$date": "2024-04-04T11:11:37.660Z"
  },
  "updated_at": {
    "$date": "2024-04-04T11:17:24.731Z"
  },
  "helpful": null,
  "not_helpful": null
},
{
  "_id": {
    "$oid": "666b3fc900105718d9a4b6ff"
  },
  "movie_id": {
    "$oid": "666b0bcbff071d36d47fa04e"
  },
  "user_id": {
    "$oid": "666b38f200105718d9a4b48f"
  },
  "content": "A whole load of nothing!\r\n\r\n<em>'Godzilla × Kong: The New Empire'</em> is not a good movie, in my opinion anyway. It is similar to its predecessor in that sense at least, this is a minute improvement on that 2021 entry mind. It's basically a Kong film though, Godzilla goes missing for large periods. There is less human to be found onscreen which is good to see, but what's added in its place with Kong is just so dull to me.\r\n\r\nThe needless humanising of Kong continues, though this time it's actually done in and around the other monsters because... well, actually I'm not sure why monsters are acting human-like to each other but, eh, the movie, I guess. That Suko young ape character is particularly annoying too, it sounded like a clown horn and looks more belonging to that one Coldplay music video.\r\n\r\nThe whole film feels like if <em>'<a href=\"https://letterboxd.com/films/in/avatar-collection/by/release-earliest/size/large/\" rel=\"nofollow\">Avatar</a>'</em> and the <em>'<a href=\"https://letterboxd.com/films/in/planet-of-the-apes-reboot-collection/by/release-earliest/size/large/\" rel=\"nofollow\">Planet of the Apes</a>'</em> reboots had a baby and that's not a positive. It felt watching that it was also taking bits and pieces from other films too, mind perhaps that's just me reaching? The best scene of it all features the two titular characters in Giza, their bits together in Hollow Earth are decent too but their opponents are incredibly lame.\r\n\r\nCast-wise, it's OK. Rebecca Hall and Kaylee Hottle are as fine as previously, Brian Tyree Henry is marginally improved and Dan Stevens is serviceable. None of the others are all that noteworthy to me, but that actually is a true plus for this production; last time out I wanted less humans and less humans is what we get here.\r\n\r\nMy review kinda reads as if I hate this 2024 release. I do not, there are far worse pictures out there of course. It's just a heap of disappointment. I guess I just want pure, turn-off-your-brain titan carnage from these flicks, which evidently is not what the Monsterverse is necessarily trying to do... that's probably on me.\r\n\r\nCatching up on this franchise has made me want to even more check out the 'proper' Godzilla releases out of Japan, so there is that. As for these American ones, I like <em>'Kong: Skull Island'</em> at least...",
  "created_at": {
    "$date": "2024-04-11T23:11:56.480Z"
  },
  "updated_at": {
    "$date": "2024-04-11T23:11:56.570Z"
  },
  "helpful": null,
  "not_helpful": null
},
{
  "_id": {
    "$oid": "666b3fc900105718d9a4b700"
  },
  "movie_id": {
    "$oid": "666b0bcbff071d36d47fa04f"
  },
  "user_id": {
    "$oid": "666b38f200105718d9a4b4a2"
  },
  "content": "_Kung Fu Panda 4_ isn’t the best _Kung Fu Panda_ film, or even the best of the series’ three sequels. However, as a fourth film in a franchise, it’s a ton of fun.\r\n\r\nAnd though it’s action isn’t quite as entertaining as its predecessors and it’s unfortunate to see Awkwafina playing yet another thief (_Jumanji: The Next Level_ says hello), for the most part, _Kung Fu Panda 4_ happily skadooshes its way to animated greatness.\r\n\r\n**Full review:** https://bit.ly/KuFuPa4",
  "created_at": {
    "$date": "2024-03-13T13:23:41.755Z"
  },
  "updated_at": {
    "$date": "2024-03-13T13:23:41.909Z"
  },
  "helpful": null,
  "not_helpful": null
},
{
  "_id": {
    "$oid": "666b3fc900105718d9a4b701"
  },
  "movie_id": {
    "$oid": "666b0bcbff071d36d47fa04f"
  },
  "user_id": {
    "$oid": "666b38f200105718d9a4b491"
  },
  "content": "This is probably my favourite of the franchised animated action-comedies, but I think we are now clearly running out of conceptual steam. With \"Po\" being told by \"Master Shifu\" that it is now time for him to move onwards and upwards - much to his chagrin - he must recruit a new dragon warrior so he can retreat to more cerebral pastimes. Luckily, though, the \"Chameleon\" has designs on obtaining all the powers from those now consigned to the nether realm and using the powers of Kung Fu to take over the world. \"Po\" has to be put his promotion on hold and along with his new-found, and useful, foxy friend \"Zhen\" try to thwart these heinous ambitions. Though there's plenty of action and self-deprecating dialogue the storyline really is too much of a recycled affair. Even the panda has been drawn into the multi-verse and to be frank, I'm a bit bored with that theme now - especially as it's never really accompanied by much in the way of jeopardy. Yes, this is an entirely predicable story that, in this case, misses out on the characterisations of his pals from the \"Furious Five\". It's watchable and the story well paced; there's some fun to be had in the wobbly, mountain-top, tavern but I think I've already forgotten most of it.",
  "created_at": {
    "$date": "2024-03-29T08:44:08.063Z"
  },
  "updated_at": {
    "$date": "2024-03-29T08:44:08.219Z"
  },
  "helpful": null,
  "not_helpful": null
},
{
  "_id": {
    "$oid": "666b3fc900105718d9a4b702"
  },
  "movie_id": {
    "$oid": "666b0bcbff071d36d47fa04f"
  },
  "user_id": {
    "$oid": "666b38f200105718d9a4b49b"
  },
  "content": "**Written by kindergartners using AI**\r\n\r\nEven after more than 10 years, I still miss the first Kung Fu Panda movie as it was genuinely a masterpiece. The story, action, dialogues, character building, the tension between Tai Lung and Shifu, everything was fabulous. Well, I can go on and on about the first Kung Fu Panda, but this is about this unbearable trash Kung Fu Panda 4.\r\n\r\nThis movie is so bad that calling it boring would be a compliment. Out of nowhere, this Zhen character manifests. All the formula film scenes replicated, unnecessary fights, moving around without any purpose, cracking jokes (painfully unfunny) out of nowhere, and so on. I wanted to leave the movie after 20 minutes but then I thought maybe something good would happen. However, I was wrong till the end. \r\n\r\nPathetic direction, dialogue delivery and unfunny jokes started feeling irritating. No chemistry between Po and Zhen, and somehow they both are ready to die for each other. The Zhen character was uninteresting and annoying.\r\n\r\nJust like contemporary movies where people get everything without any sacrifice or struggle, they managed to \"Mary Sue\" Zhen by making her the next dragon warrior.\r\n\r\nI am glad that this movie ended this way. At least now I know I won’t be watching any more trash from this franchise.\r\n\r\nIf you loved the first Kung Fu panda, please stay away from this. Please save and cherish your good memories. You have been warned.\r\n\r\n*I wanted to give it 1.5, but the sliding scale couldn’t select it, so I gave it 2/10.",
  "created_at": {
    "$date": "2024-04-13T10:46:24.462Z"
  },
  "updated_at": {
    "$date": "2024-04-13T10:46:24.543Z"
  },
  "helpful": null,
  "not_helpful": null
},
{
  "_id": {
    "$oid": "666b3fc900105718d9a4b703"
  },
  "movie_id": {
    "$oid": "666b0bcbff071d36d47fa04f"
  },
  "user_id": {
    "$oid": "666b38f200105718d9a4b495"
  },
  "content": "I'm into movies that simulate the 'watching a video game' experience. Classic Shang Tsung end boss. Shadow of the Colossus gameplay. Maybe a diss to Dune? It's predictable and full of dumb shit but I found myself enjoying it. Jables does good. I found abrasion to be front-loaded and maybe he mellows out but... a muted, yet powerful performance. I did smoke weed during the first few minutes.\r\n\r\nI love Awkwafina.",
  "created_at": {
    "$date": "2024-04-18T04:20:21.298Z"
  },
  "updated_at": {
    "$date": "2024-04-18T04:20:21.363Z"
  },
  "helpful": null,
  "not_helpful": null
},
{
  "_id": {
    "$oid": "666b3fc900105718d9a4b704"
  },
  "movie_id": {
    "$oid": "666b0bcbff071d36d47fa052"
  },
  "user_id": {
    "$oid": "666b38f200105718d9a4b49d"
  },
  "content": "I found it difficult to relate to Alienoid. \r\n\r\nI suspect the reason is cultural. Some things work across cultures and other's don't. I found Alienoid simply too strange. It has an off beat personality too, which really didn't help matters. The slapstick humour fell flat, too. Giving characters names like \"dogturd\", is a bit juvenile.\r\n\r\nAction wise it's alright but the action often didn't make a lot of sense, either. Characters appearing out of fans and hiding behind magic veils, just didn't track well, with this viewer.\r\n\r\nIn summary, probably one for the domestic South Korean market. Lots of elements I suspect reflect Korean mythology but without a meaningful context, its lost on Western audiences.",
  "created_at": {
    "$date": "2022-09-06T03:29:02.718Z"
  },
  "updated_at": {
    "$date": "2022-09-06T03:29:02.795Z"
  },
  "helpful": null,
  "not_helpful": null
},
{
  "_id": {
    "$oid": "666b3fc900105718d9a4b705"
  },
  "movie_id": {
    "$oid": "666b0bcbff071d36d47fa053"
  },
  "user_id": {
    "$oid": "666b38f200105718d9a4b4a8"
  },
  "content": "Very poor scenario and the story just does not add up, the ending also was not very convincing.",
  "created_at": {
    "$date": "2024-03-21T21:38:45.003Z"
  },
  "updated_at": {
    "$date": "2024-04-02T16:54:20.932Z"
  },
  "helpful": null,
  "not_helpful": null
},
{
  "_id": {
    "$oid": "666b3fc900105718d9a4b706"
  },
  "movie_id": {
    "$oid": "666b0bcbff071d36d47fa053"
  },
  "user_id": {
    "$oid": "666b38f200105718d9a4b48d"
  },
  "content": "FULL SPOILER-FREE REVIEW @ https://fandomwire.com/road-house-review-a-generic-yet-superior-remake/\r\n\r\n\"Road House keeps the screenplay superficial and formulaic, but the narrative changes and more captivating new characters make the remake a more satisfying watch.\r\n\r\nThe cast led by a Jake Gyllenhaal in excellent form – in every sense of the word – possesses enviable chemistry, with the surprising highlight falling on Conor McGregor’s debut, infusing the movie with intense, truly crazy energy. The action sequences suffer slightly from some excess stylization but serve their basic purpose.\r\n\r\nA more significant focus on character development, especially in the central romance, would have been welcome, but it remains a pleasant home viewing experience.\"\r\n\r\nRating: B-",
  "created_at": {
    "$date": "2024-03-22T13:55:24.060Z"
  },
  "updated_at": {
    "$date": "2024-03-22T13:55:24.233Z"
  },
  "helpful": null,
  "not_helpful": null
},
{
  "_id": {
    "$oid": "666b3fc900105718d9a4b707"
  },
  "movie_id": {
    "$oid": "666b0bcbff071d36d47fa054"
  },
  "user_id": {
    "$oid": "666b38f200105718d9a4b491"
  },
  "content": "\"Mack\" and wife \"Pam\" live contentedly on their pond and are preparing for winter when some migrating ducks break their journey and infect their kids \"Gwen\" and \"Dax\" with the travelling bug. \"Mack\" is adamant that staying home is the best strategy, but the arrival of \"Uncle Dan\" and his daughter's persistence soon persuade him that a trip to Jamaica wouldn't be a bad idea. Off they go and en route encounter the dangers of the big city. That's where they meet the scrawniest but meanest of pigeons \"Chump\" who, after a bit of tussle over a sandwich, agrees to introduce them to the only bird that might know the way to the Caribbean. Snag? Well, he's caged up in a restaurant and the terrifying master-chef keeps the key on his jacket at all times. Can they get the key, free \"Delroy\" the macaw, and then escape the pursuing vengeance of the tattooed, pony-tailed, man with the kitchen knives? The animation is detailed and it's quite watchable this film, but it reminded me quite a lot of \"Ratatouille\" (2007) meets \"Chicken Run\" (2000). There's plenty of colourful action and the narrative does imbue some character into the two children, particularly, but otherwise it's all just a wee bit procedural. It's at the better end of the Illumination factory production line, but it's not a film anyone will likely remember and it did rather shout sequel at me too.",
  "created_at": {
    "$date": "2024-02-16T07:42:12.967Z"
  },
  "updated_at": {
    "$date": "2024-02-16T07:42:13.094Z"
  },
  "helpful": null,
  "not_helpful": null
},
{
  "_id": {
    "$oid": "666b3fc900105718d9a4b708"
  },
  "movie_id": {
    "$oid": "666b0bcbff071d36d47fa054"
  },
  "user_id": {
    "$oid": "666b38f200105718d9a4b4ac"
  },
  "content": "It was a really cute and entertaining movie. Great for date night or a night in with your family.",
  "created_at": {
    "$date": "2024-03-04T01:29:12.456Z"
  },
  "updated_at": {
    "$date": "2024-03-19T15:10:14.006Z"
  },
  "helpful": null,
  "not_helpful": null
},
{
  "_id": {
    "$oid": "666b3fc900105718d9a4b709"
  },
  "movie_id": {
    "$oid": "666b0bcbff071d36d47fa055"
  },
  "user_id": {
    "$oid": "666b38f200105718d9a4b48d"
  },
  "content": "FULL SPOILER-FREE REVIEW @ https://talkingfilms.net/civil-war-review-a-thought-provoking-dive-into-war-journalism-and-moral-complexity/\r\n\r\n\"Civil War attests to Alex Garland’s fascinating ability to create impactful narratives that provoke deep discussions, beyond his unwavering commitment to the themes and characters at hand, without falling into preachy stances.\r\n\r\nA film that transcends political boundaries, focusing on war journalism, the moral dilemmas faced by those who risk their lives to tell stories that cannot be ignored, and the personal transformation necessary to carry out such an inhuman task. The character complexity and the chilling intensity of the cinematography and sound production contribute to a powerfully engaging, repeatedly shocking audiovisual experience.\r\n\r\nIt’s a tribute to a profession often forgotten, but equally a challenge for viewers to reflect on critical issues in contemporary society.\"\r\n\r\nRating: A-",
  "created_at": {
    "$date": "2024-04-11T08:02:56.247Z"
  },
  "updated_at": {
    "$date": "2024-04-11T08:02:56.341Z"
  },
  "helpful": null,
  "not_helpful": null
},
{
  "_id": {
    "$oid": "666b3fc900105718d9a4b70a"
  },
  "movie_id": {
    "$oid": "666b0bcbff071d36d47fa055"
  },
  "user_id": {
    "$oid": "666b38f200105718d9a4b48f"
  },
  "content": "Terrific movie!\r\n\r\n<em>'Civil War'</em> is a blast from beginning to end, I enjoyed everything about it to be honest. It features an interesting story that is told with excellence. My biggest takeaway is the sound design, which is outstanding; literally from the first seconds post-BBFC black card.\r\n\r\nIt is paced absolutely spot on, the end comes around so quick; probably because I was hooked. The cast do great jobs. Obvious credit to Kirsten Dunst, Wagner Moura and Stephen McKinley Henderson, they are all ace. Cailee Spaeny is my personal standout though, what an excellent showing from her!\r\n\r\nEngrossing viewing. Highly recommended. Very much want to rewatch it already.",
  "created_at": {
    "$date": "2024-04-12T17:27:10.680Z"
  },
  "updated_at": {
    "$date": "2024-04-12T17:27:10.773Z"
  },
  "helpful": null,
  "not_helpful": null
},
{
  "_id": {
    "$oid": "666b3fc900105718d9a4b70b"
  },
  "movie_id": {
    "$oid": "666b0bcbff071d36d47fa055"
  },
  "user_id": {
    "$oid": "666b38f200105718d9a4b491"
  },
  "content": "Nope, sorry, this just didn't work for me. It appears that there is a civil war amongst these United States. California and Texas have seceded from the Union and Florida seems to be having a wobble too. The President (Nick Offerman) makes a speech assuring the rest of his country that they've nothing to worry about, but hardened photo-journalist \"Lee\" (Kirsten Dunst) and her cohort \"Joel\" (Wagner Moura) reckon that the conflict is quite likely to come to an altogether different conclusion. They bravely decide to travel the 800-odd miles to Washington DC to try and interview him. Their out-of-shape veteran associate \"Sammy\" (Stephen McKinley Henderson) thinks they are mad, but also wants in on the trip. Meantime, the enthusiastic young photographer \"Jessie\" (Cailee Spaeny) has managed to hook up with the team and so, rather implausibly, they agree to take her on this perilous journey. It's that implausibility that carries the whole thing as the completely preposterous scenario unfolds before us. No effort is made to fill us in on the cause of this warfare. Did the President seize power? Was he elected from a party these states didn't vote for? Are they just brutal and well armed revolutionaries? Then we have the ridiculous dialogue - usually from Henderson with his \"always take fuel when you can\" or \"this way only leads to death\" type profundities as the group travel through a remarkably stable, well fuelled and provisioned, nation where there's hardly the merest hint of mass migrations, fear or terror. Indeed, their blue \"Press\" helmets and a little bit of kevlar seem to render them immune to the deadly drama that they are supposed to be experiencing. Jesse Plemons makes a brief appearance - that actually leads to the only vaguely exciting part of this chronology, but otherwise it's all a bit on a non-event. Dunst starts off as a strong and characterful woman but that dwindles away and, well, I was just a bit bored as the denouement hoved into view with all the predicability of the sun coming up. It's bitty, episodic, unrealistic and populated with characters in whom I simply could not believe. Sure, maybe it's supposed to be outlandishly apocalyptic, but it reminded me for the most part of an episode of \"Falling Skies\" - only without the aliens. Perhaps it might resonate better with an American audience? I'm not one of them and this didn't.",
  "created_at": {
    "$date": "2024-04-13T08:43:24.818Z"
  },
  "updated_at": {
    "$date": "2024-04-15T16:51:27.226Z"
  },
  "helpful": null,
  "not_helpful": null
},
{
  "_id": {
    "$oid": "666b3fca00105718d9a4b70c"
  },
  "movie_id": {
    "$oid": "666b0bcbff071d36d47fa055"
  },
  "user_id": {
    "$oid": "666b38f200105718d9a4b4b1"
  },
  "content": "Cautionary tales often have some of the most significant impact when brought to life on the big screen, and that’s certainly the case with the latest offering from writer-director Alex Garland. The filmmaker’s gripping tale of a quartet of journalists (Kirsten Dunst, Wagner Moura, Stephen McKinley Henderson, Cailee Spaeny) covering a civil war in a dystopian version of America of the near future follows the reporters as they make their way from New York to Washington via a circuitous route that shows them all sides of this nightmarish scenario. Essentially a road trip film, “Civil War” provides the principals and viewers with an array of images and situations graphically depicting what’s left of the US as a distraught population attempts to make sense of the circumstances and find ways to survive. The purpose of the protagonists’ journey is to secure an interview (likely the last one) with a corrupt, egomaniacal President (Nick Offerman) as rebel forces close in on the capital. They set out on this treacherous odyssey despite the dangers involved both in making the trip and in their roles as journalists, who are looked on with suspicion and have been accused of fanning the flames of the hostilities. While some have complained that the film doesn’t provide enough social and political background about the conflict, I submit that this consideration is fundamentally unnecessary: Garland is making an unadulterated statement here that, when the bullets start flying, ideology won’t matter and no one will care, a point driven home with chilling clarity over and over. The madness that consumes the population is all that’s important at that juncture, one driven by bald-faced hostility on steroids both among the combatants and the overzealousness of the reporters in seeking to “get the story,” no matter what. In achieving this end, the filmmaker holds nothing back, making this an often-difficult watch, one definitely not for the squeamish or faint of heart. But the picture’s message is one of grave importance, especially in today’s trying, polarized climate. We’d be wise to pay attention to what’s being said in this important work, handily the best – and most troubling – release of 2024 thus far.",
  "created_at": {
    "$date": "2024-04-14T17:07:12.331Z"
  },
  "updated_at": {
    "$date": "2024-04-14T17:07:12.435Z"
  },
  "helpful": null,
  "not_helpful": null
},
{
  "_id": {
    "$oid": "666b3fca00105718d9a4b70d"
  },
  "movie_id": {
    "$oid": "666b0bcbff071d36d47fa056"
  },
  "user_id": {
    "$oid": "666b38f200105718d9a4b4b3"
  },
  "content": "Best Directing\r\nBest Acting\r\nBest Editing\r\nBest Story\r\nBest Team\r\nThanks to the filming team\r\nI hope the film shines in cinemas\r\nlove You From Iran",
  "created_at": {
    "$date": "2021-06-23T18:52:54.658Z"
  },
  "updated_at": {
    "$date": "2021-06-23T22:20:09.464Z"
  },
  "helpful": null,
  "not_helpful": null
},
{
  "_id": {
    "$oid": "666b3fca00105718d9a4b70e"
  },
  "movie_id": {
    "$oid": "666b0bcbff071d36d47fa057"
  },
  "user_id": {
    "$oid": "666b38f200105718d9a4b49d"
  },
  "content": "The Wages of Fear is very much your by the numbers, military action fare. \r\n\r\nA group of paid contractors are tasked with bringing a dangerous shipment of nitro glycerine to a oil well to put out an impending explosion  and save a group of innocent local people, including one key characters family. \r\n\r\nThe pacing is lack lustre. The same chase scenes keeping repeating with a few wrinkles that move things along but don't really add much in the way of variety. Indeed, the action in this film feels as sparce and uniform, as its desert setting. \r\n\r\nThe back story is a bit ridiculous too. Again and again, the trucks carrying highly explosive nitro come under fire from desert raiders and yet the canisters, never get hit.\r\n\r\nHaving said all this, the interactions between the main characters offers a measure of interest and actions scenes, are competently done.\r\n\r\nIn summary, an OK watch but by no means anything special. Yes there are sub titles unless you speak French, that is.",
  "created_at": {
    "$date": "2024-04-08T21:10:19.273Z"
  },
  "updated_at": {
    "$date": "2024-04-11T21:51:26.347Z"
  },
  "helpful": null,
  "not_helpful": null
},
{
  "_id": {
    "$oid": "666b3fca00105718d9a4b70f"
  },
  "movie_id": {
    "$oid": "666b0bcbff071d36d47fa058"
  },
  "user_id": {
    "$oid": "666b38f200105718d9a4b491"
  },
  "content": "We start off with an heavily pregnant woman deep in the Peruvian jungle looking for a very rare spider with her pal \"Ezekiel\" (Tahar Rahim). Guess what? Yep - she finds it, and almost immediately too! Anyway, it turns out that her pal isn't so friendly after all and pretty sharpish she is shot and face up in a pool of healing waters where her baby is being delivered by a jungle people with spidey-skills. Advance twenty-odd years and we meet paramedic \"Cassie\" (Dakota Johnson) who drives around with her partner \"Ben\" (Adam Scott), indifferently saving folks from disaster. It's one such disaster, though, that sees her tumbled deep into the river and having to be rescued by her buddy. This trauma appears to trigger something weird. She is getting flash-fronts. She can see the tiniest snippets of the future - and that doesn't usually bode well for anyone, including her! A trip on a train to a funeral proves decisive as three of the other passengers also feature in her dreams - all being the targets of a mysterious lycra-clad tunnel-climber bent on slaughter. Can she rescue them and find out just what's going on? Well possibly, but the story is just thin and the characters so undercooked that I didn't really care. The whole arachnid story line is under-developed to the point that I couldn't see what her skills really had to do with a spider at all. Tahar Rahim seemed uncertain if he was supposed to be \"Deadpool\" and/or Antonio Banderas and hats have to come off to Celeste O'Connor for playing the entirely obnoxious and attitudinal \"Mattie\" with quite such aplomb. The denouement is straight out of \"Highlander\" (1986) and I'm afraid that rather summed this up. Not an original bone in it's small and squidgy body, over-scripted and made for the sake of it. Sure, it's all about team bonding, trust and finding yourself (quite literally), but the readiness with which all concerned buy into this increasingly repetitive and whacky scenario is just daft. Like the whole multi-verse concept, the studios have decided to take super-hero films and flog them to death without worrying about concept, character or a decent story, and though Johnson does try to lift this where she can, it's ends up being something akin to one of those \"Superman\" television episodes we used to watch with Dean Cain - only with monotonous time-shifting!",
  "created_at": {
    "$date": "2024-02-15T10:07:26.665Z"
  },
  "updated_at": {
    "$date": "2024-02-15T10:07:26.855Z"
  },
  "helpful": null,
  "not_helpful": null
},
{
  "_id": {
    "$oid": "666b3fca00105718d9a4b710"
  },
  "movie_id": {
    "$oid": "666b0bcbff071d36d47fa058"
  },
  "user_id": {
    "$oid": "666b38f200105718d9a4b48f"
  },
  "content": "Ouch, that average rating! I'm not going to lie though, I genuinely had a fun time watching <em>'Madame Web'</em>... perhaps I should be keeping that fact quiet?\r\n\r\nI don't know what to say, I found it to be suitably entertaining. I'm sure there are plot holes aplenty (I noticed a few) and it probably makes zero sense/isn't a good adaptation compared to its source material or whatever but honesty... I don't care, it gave me enough enjoyment that I wasn't questioning anything about what I was watching.\r\n\r\nThe cast are probably the key factors as to why I did enjoy this. I previously knew of Dakota Johnson but hadn't actually seen her in anything properly, I found her performance to be more than noteworthy and she spearheads the film strongly. The trio of Sydney Sweeney, Isabela Merced and Celeste O'Connor are positives too.\r\n\r\nTahar Rahim's antagonist, meanwhile, is poorly written and portrayed, though I personally thought the actor did a good job. I have no complaints with anyone who appears onscreen to be honest. Away from them, the pacing and score are also standouts.\r\n\r\nIn my recollection of viewing this, I truthfully haven't got any issues with it. If it wasn't for the slight bad murmurs that I did hear about pre-watch (though not much of it as I avoid as much as I can with movies) and the reaction on sites like this post-watch, I'd not be questioning my thoughts about this whatsoever.\r\n\r\nAs I always say, to each their own. For me, gimme a sequel (as long as the cast remain, mind). Not even sorry.",
  "created_at": {
    "$date": "2024-02-16T20:31:52.159Z"
  },
  "updated_at": {
    "$date": "2024-02-16T20:31:52.305Z"
  },
  "helpful": null,
  "not_helpful": null
},
{
  "_id": {
    "$oid": "666b3fca00105718d9a4b711"
  },
  "movie_id": {
    "$oid": "666b0bcbff071d36d47fa058"
  },
  "user_id": {
    "$oid": "666b38f200105718d9a4b495"
  },
  "content": "Wooooow. Worse than the Marvels. Why did they dance on the table for like 20 guys? Who chose those glasses? But I sure do want a crisp, refreshing Pepsi Cola. Deadly good taste.",
  "created_at": {
    "$date": "2024-03-16T02:49:47.921Z"
  },
  "updated_at": {
    "$date": "2024-03-16T02:49:47.995Z"
  },
  "helpful": null,
  "not_helpful": null
},
{
  "_id": {
    "$oid": "666b3fca00105718d9a4b712"
  },
  "movie_id": {
    "$oid": "666b0bcbff071d36d47fa058"
  },
  "user_id": {
    "$oid": "666b38f200105718d9a4b4b9"
  },
  "content": "Perhaps it was the perceived and preconceived notion that I had of this film being really bad as shown by its ratings scores from various sites, but I found this film actually really funny in a campy sort of way and better than decent in terms of not-big-budget superhero-film sort of way. In short, I came away enjoying it and unhappy with how this movie was portrayed in the movie-review media. I think it was just a piling on of the mob-mentality reviewers who tried to kick somebody who was already down, but anyway, I do hope this gets a sequel and I do hope the filmmakers continue with the campy, unintentionally funny, very quiet scenes with no theme music whatsoever style, low-budget-but-still-decent CGI, and over-all enjoyable moviemaking which can be watched and enjoyed for an hour and a half. A huge departure from those 3-hour self-important cinematic \"spectacles\" of today.",
  "created_at": {
    "$date": "2024-03-16T19:34:22.363Z"
  },
  "updated_at": {
    "$date": "2024-03-19T16:44:04.299Z"
  },
  "helpful": null,
  "not_helpful": null
},
{
  "_id": {
    "$oid": "666b3fca00105718d9a4b713"
  },
  "movie_id": {
    "$oid": "666b0bcbff071d36d47fa059"
  },
  "user_id": {
    "$oid": "666b38f200105718d9a4b4bb"
  },
  "content": "Terrible Script, dialogue, directing, hammy editing. Music is meh. Poor acting (but they clearly got no support). This crap show's the contempt producers like this have for the audience that gives them money. The writer, director, producers and editor must have been so full of ego that I bet continues today, despite the poor reviews. During the boring minutes (90) I drifted off imagining them all working on these scenes thinking they were amazing, and trying to understand the level of narcissism required. Just delusional film makers that like the smell of each others farts. During the credits I imagined the director is still down there and that's what got it 0.5 rather than 0.",
  "created_at": {
    "$date": "2024-02-01T08:02:33.721Z"
  },
  "updated_at": {
    "$date": "2024-02-09T23:03:12.390Z"
  },
  "helpful": null,
  "not_helpful": null
},
{
  "_id": {
    "$oid": "666b3fca00105718d9a4b714"
  },
  "movie_id": {
    "$oid": "666b0bcbff071d36d47fa059"
  },
  "user_id": {
    "$oid": "666b38f200105718d9a4b495"
  },
  "content": "This movie is less realistic than Slotherhouse. No one on the crew had their Open Water certification. Absolute crap. 3 because they killed that one really annoying guy who sucked and I imagine he's the wretched people who wrote/directed this crap. But it's only 1.5 hours so...I kinda like it. Would have been 20 minutes had they just opened the door so...I really hate it.",
  "created_at": {
    "$date": "2024-02-20T17:31:06.306Z"
  },
  "updated_at": {
    "$date": "2024-02-20T17:32:21.739Z"
  },
  "helpful": null,
  "not_helpful": null
},
{
  "_id": {
    "$oid": "666b3fca00105718d9a4b715"
  },
  "movie_id": {
    "$oid": "666b0bcbff071d36d47fa05a"
  },
  "user_id": {
    "$oid": "666b38f200105718d9a4b491"
  },
  "content": "Now it's probably my fault, but I should have remembered after watching \"Swordsmith Village\" last March that this isn't a film at all, but the tail episode of a series (I hadn't seen) used to introduce the first episode of a new season (which I won't watch either) and so it didn't really make much sense. The ongoing training of \"Tanjiro\" as he seeks to become Hashira is mixed in with the continuing search for \"Nezuko\" and \"Ubuyashiki\" by the increasingly frustrated \"Muzan\". As with any serialisation, each episode is just a conduit to the next, so this film delivers very little by way of plot development. A tiny bit of closure is soon subsumed into an whole new set of challenges that will beset them as the next slew of episodes follow. Sadly, that means there's precious little story for us to get our teeth into and so we are really just left with some stylish and accomplished animation that we have all seen many, many, times before. As with last time, they didn't even bother to sew the episodes together properly, we get a credit roller amidst the thing. There are loads of interesting characters here but this film relies way too heavily on your having followed the strand elsewhere. As a stand alone piece of cinema, it's watchable, but pretty meaningless.",
  "created_at": {
    "$date": "2024-03-02T06:48:06.829Z"
  },
  "updated_at": {
    "$date": "2024-03-02T06:49:55.416Z"
  },
  "helpful": null,
  "not_helpful": null
},
{
  "_id": {
    "$oid": "666b3fca00105718d9a4b716"
  },
  "movie_id": {
    "$oid": "666b0bcbff071d36d47fa05e"
  },
  "user_id": {
    "$oid": "666b38f200105718d9a4b4bf"
  },
  "content": "\r\n**FABULOUS 🥇🥇🥇🥇 . . . . And , Oh , Yes . . . . Hans Zimmer's Score's Already Got \"OSCAR\" Written On It 😉 ; & EXPECT A WHOLE \" HOST OF OTHER _MAJOR_ NOMINATIONS - AS WELL \"**\r\n\r\nThis Is A **- _B I G_ -** Screen - MINI - Review. Picture Viewed Oct. 07, 2021 ; At Vox Cinemas , U . A . E\r\n\r\n______________________________________________________\r\n\r\nPaul Atreides : \" Fear is the mind-killer. Fear is the little death that brings total obliteration. I will face my fear, and I will permit it to pass over me. When the fear has gone, there will be nothing. Only I will remain \".\r\n\r\n_______________________________________\r\n_______________\r\n\r\n**1.** If you're  one of the -Millions- of people around the world who loved Denis Villeneuve's hauntingly riveting 2015 thriller 'Sicario', ( yours truly included ) ; then strap in for 'one hell of an Interstellar ride, with an -{ EQUALLY }- **\" INTERSTELLAR 🌠 \"** CAST . . . . that -literally- presents itself like a Who's-who of Hollywood's \"Best, And Brightest\". This time around, the unequivocally -{ Prolific }- Academy Award nominated French Canadian director has taken acclaimed American author Frank Herbert's 1965 sci-fi thriller, ( once touted as the world's -Best- selling science fiction novel ), & turned it into a veritable masterpiece of a movie. -Make Sure- to 'keep a special eye out' for Rebecca Ferguson's completely \"Stunning\" portrayal of 'Lady Jessica Atreides' . . . . I can promise that you most certainly -Will Not- regret it. \r\n\r\n**2.** Almost needless to say, the Music, Acting , Cinematography 🔥 , Art-direction, C.g.i, Dramatic pacing & the sprawling, lavish Set-pieces are all, well . . . -{ \" Past Compare \" }- .\r\nWhen it comes to 2021's cinematic 'big budget\" smorgasbord : if you want to see the -Very- best Popcorn Flick \"Sensation\" of the year, it's most unequivocally going to be Bond 25 : 'No Time To Die'. But, on the -other- hand, if you're more in the mood for some -equally- magnificent **\"Artfilm Meets Blockbuster\" ( no seriously )** fare . . . that may -Well- hold you in a state of 'Absolute Rapture' from start to finish, then 'Dune' should most -Definitely- be your first choice. Just make sure to come to said movie with a { Genuinely } open and unbiased --- Heart , And Mind 🙃 . \r\n\r\n**3. \" Final Analysis \" :** The only -{ Pronounced }- lack you will feel, if any at all, is that of -{ Humour }‐ . . . . especially if you're someone who enjoys their big screen delights served with, well, a \"generous\" side of unrestrained -Mirth- . I counted -Literally- only about \"3.5\" barely plausible funny moments in the -Entire- flick. But the obvious reason for that is : it simply -Wouldn't- have worked within this sort of a 'Deadly Serious' dark, dramatic, & super futuristic setting ( 10,191 \"a.g\", to be precise ). So, having taken -that- aspect of the production into consideration ; it really ended up -_NOT_ - bothering me very much, AT ALL. Thus, in sum . . . . I was utterly **-{ MESMERIZED }-** by \" Dune : Part 1 \" and hence ; I chose to give it a **\" Wholehearted, Adoring, MEGA-APPRECIATIVE 13 Marks Out Of 10❗\" .**",
  "created_at": {
    "$date": "2021-10-10T03:50:09.811Z"
  },
  "updated_at": {
    "$date": "2021-10-11T01:54:49.251Z"
  },
  "helpful": null,
  "not_helpful": null
},
{
  "_id": {
    "$oid": "666b3fca00105718d9a4b717"
  },
  "movie_id": {
    "$oid": "666b0bcbff071d36d47fa05e"
  },
  "user_id": {
    "$oid": "666b38f200105718d9a4b4c1"
  },
  "content": "The worst movie I've ever seen. Don't waste your time.",
  "created_at": {
    "$date": "2021-10-18T16:05:14.243Z"
  },
  "updated_at": {
    "$date": "2021-10-25T21:28:16.757Z"
  },
  "helpful": null,
  "not_helpful": null
},
{
  "_id": {
    "$oid": "666b3fca00105718d9a4b718"
  },
  "movie_id": {
    "$oid": "666b0bcbff071d36d47fa05e"
  },
  "user_id": {
    "$oid": "666b38f200105718d9a4b4c3"
  },
  "content": "    As a child, I remember catching David Lynch’s “Dune” on TV. I was too young to really understand the plot at the time, but I didn’t care, all I knew was that the worms were awesome. When I got a little older, I read the book for my first time. It was the first “adult” book I read on my own, and I was in love with it ever since. I read it many more times growing up, and when the miniseries came out, I watched and recorded it every night, then re-watched it time and time again. When “Children of Dune” aired, I again devoured it happily. In the case of the Lynch film, as I grew, I of course began to see more and more of the flaws, though I personally hold the “Spicediver Edit” in quite high esteem. That particular cut of the film manages to make the Lynch version into what is a genuinely good film, but still imperfect. The miniseries has, up until now, remained my preferred adaptation. Now we have a new adaptation: Denis Villeneuve’s “Dune”, and it certainly is quite different from the previous two versions in many ways, but is it good? Well, at least from my perspective, that answer is complicated. The short version is yes, it is a good film, but it’s not a great one.\r\n\r\n    The gist of the story is straightforward. Many, many millennia in the future, Paul, the son of the Duke Leto Atreides, finds himself and his family caught in plots of intrigue, and betrayal, after taking custody of a new and valuable planet. In order to survive, he finds that he will have to depend on the training of his mother, the Lady Jessica, the help of the planets local population, the fremen, and his growing awareness of a great, yet possibly terrible destiny that waits for him. \r\n\r\n    In reality though, the story is anything but. The novel is infamous for being “unadaptable” with its complex “plots within plots” storyline, along with its sheer size. There is simply too much going on in the story to make it easy to turn into a film, or even a series. The previous efforts have all brought different aspects of the novel to the forefront, and this new version is no different. In broad strokes, it is perhaps the most faithful to the novel in terms of themes, and it certainly emphasizes some aspects of the political commentary behind the novel, such as the missionaria protectiva, which was nowhere to be found in the Lynch film, and only really hinted at in the miniseries. They also spend a little more time focusing on the fremen and their sentiments toward off-worlders after living under the Harkonnen regime, but unfortunately, while it is nice to see these themes in the film, they are undercut by little development. In fact, the entire film suffers on that front. So much of the political context and scheming has been left out that the film as presented feels somehow empty. \r\n\r\n    Early in the film, it is established that the emperor considers the Duke Leto a threat due to his popularity, but never really explores too much beyond it. Even more strangely, the film establishes this, but then later makes it seem like they were never really certain about the fact that the emperor was involved in a key scene, unlike the book, where the Duke was fully aware that they were heading into a trap, and was attempting to outmaneuver his political opponents. The Baron Harkonnen is limited to a few admittedly atmospheric scenes where he more or less confirms the emperor is aiding him in their goal to destroy the Atreides line, but it is reduced to a few scant lines, the bare minimum necessary to understand the plot. This, unfortunately results in very shallow characterization, and the same problem runs throughout the film. Gurney Halleck, Thufir Hawat, and Doctor Yueh are all present, but each of them is only given a small handful of scenes, in which they only speak a few lines each, before they are forgotten to focus on Paul, or beautiful scenic shots. They never feel like fully realized characters in the film, more as brief supporting roles, whom are only present in order to fulfill their roles in the larger storyline. Thufir Hawat receives perhaps the worst treatment in this regard. Even the primary cast are not given a lot of development. We are given enough to know who they are, and a little of their personality, but nothing more. It seems strange, that the longest adaptation of the first half of the novel ever made should have less detail and character than either previous version. It does however, and it certainly hurts the film as a result. Long, moody shots are great, but only when they exist in addition with actual depth. The plot of the film has been streamlined to the point that it feels watered-down, and genuinely wastes the talents of its cast all stuck in roles that have been similarly effected. \r\n\r\n    There are also a few key scenes that actively go against things covered in the book. One scene features the Lady Jessica speaking of secretive matters regarding the bene gesserit sisterhood while sitting in the cockpit of an ornithopter right behind Thufir Hawat, whom would be easily able to hear everything she had just said. Another moment, involves the Reverend Mother Mohiam referring to Jessica as Leto’s “wife”, even though she would know full well that they aren’t married. Yet another moment involves that Shadout Mapes pulling out a crysknife to offer it to Jessica while out in the open, and Jessica is in the presence of guards. The Shadout later sheathes the knife unblooded, and those who have read the book will know why that choice does not work for the film, especially in the context of fremen later being shown cutting themselves before sheathing their knives. Of course, in any adaptation there will be liberties taken, and there are indeed more, but these three moments in particular certainly seem to stand out the most in regards to actively going against aspects of the original novel, and in doing so, hurt this film as an adaptation.\r\n\r\n    With that said, there were things I liked as well. As I have stated a number of times, the film is gorgeous. There are a couple of scenes that certainly seemed to be more “style over substances”, such as a shot of ships rising from the ocean for… no apparent reason, but man do they look beautiful. There is also a very real sense of scale in the film that I can freely admit neither previous version ever accomplished. As a result, there are a few scenes that do far better match their description in the book, and are glorious to watch.\r\n\r\n    I do really appreciate the way they portray the emperor, discussed, but never seen. A powerful force that can be felt looming in the background, his hand guiding everything happening. He is built up excellently, and I will be curious to see how well he is portrayed if we get a sequel. In the previous adaptations, he was prominently displayed and used to provide greater context for the politics of the story, but in the book, he is only ever seen in the end, and keeping book accurate in this case certainly works very well.\r\n\r\n    The film also features the most book accurate version of Paul’s growing prescience, hinting at possible outcomes rather than complete premonitions. The way it is executed is not necessarily without its flaws, or heavy-handedness in a couple of moments, but it works well. Similarly, we also get the story of the bull and Leto’s father for the first time, though the film attempts to make the bull symbolic in a manner I am not sure really works, or is earned.　Also notable is the death of a significant character finally matching their death in the novel. \r\n\r\n    I have also stated that the cast does a great job, and I stand by that. In the entire film, there is not a bad performance in the film. My only complaint would be with the portrayal of the Lady Jessica, who comes across as too emotional, presumably in an attempt to show her ability to shift from being upset to being entirely refined and composed in moments, but that is a matter of writing rather than performance. When it comes to the casting, I personally felt that many of the actors matched their roles well, in particular enjoying the casting of Duke Leto and the Baron. I did not however care much for the gender-swapping of Liet, which served no real purpose, especially when one considers how small the characters role was in this version of the film, though Sharon Duncan-Brewster did a good job with what she had. I also did not care for the casting of Rebecca Ferguson as Jessica. While she is a very good actress, she seemed to me a bit too “girl next door”, rather than the character from the novel that the Duke Leto notes “reintroduced regality into the Atreides line”. \r\n\r\n    When it comes to the score, I will admit that I was not certain how I would feel in regards to Hans Zimmer’s work on the film. The samples I had heard up until this point had been interesting, but I was not sure how it would work in terms of the film itself. I can say that it works well, though there are moments when it feels almost as watered-down as the plot itself. It never really allowed me to feel excited at any point, but it did match the tone of the film very well, and I can easily see myself turning it on whenever I clean my house in order to set a “mood” (Ha! See what I did there?). \r\n\r\n    In conclusion, despite my criticisms, I did enjoy the film. I think it works well enough to be understood, though there may be some moments where the average viewer could find themselves feeling confused. It certainly is a visual spectacle, but one undercut by excessive trimming of detail and world-building. I hope it is successful enough to warrant a sequel in order to finish the story, but I also find that I will not be upset if it does not. As adaptations go, this is no “The Lord of the Rings”. In the end, I have to rate this version of “Dune” closer to the original Lynch film, and maintain the miniseries as my favorite adaptation of an amazing novel.",
  "created_at": {
    "$date": "2021-10-21T00:05:33.631Z"
  },
  "updated_at": {
    "$date": "2021-10-25T21:27:53.123Z"
  },
  "helpful": null,
  "not_helpful": null
},
{
  "_id": {
    "$oid": "666b3fca00105718d9a4b719"
  },
  "movie_id": {
    "$oid": "666b0bcbff071d36d47fa05e"
  },
  "user_id": {
    "$oid": "666b38f200105718d9a4b4c5"
  },
  "content": "Great movie with excellent BG music and visual effects. Waiting for part two.",
  "created_at": {
    "$date": "2021-10-21T14:04:59.187Z"
  },
  "updated_at": {
    "$date": "2021-10-25T21:27:31.625Z"
  },
  "helpful": null,
  "not_helpful": null
},
{
  "_id": {
    "$oid": "666b3fca00105718d9a4b71a"
  },
  "movie_id": {
    "$oid": "666b0bcbff071d36d47fa05e"
  },
  "user_id": {
    "$oid": "666b38f200105718d9a4b48d"
  },
  "content": "FULL SPOILER-FREE REVIEW @ https://www.msbreviews.com/movie-reviews/dune-spoiler-free-review\r\n\r\n\"Dune sets the new standard for epic cinema with eyegamic visuals, powerful sound design and score, and a compelling story told surrounded by an absolutely massive scale.\r\n\r\nDenis Villeneuve adds yet another audiovisual masterpiece to his filmography, despite some narrative-pacing issues due to the heavy exposition and repetitive yet crucial dream sequences. Timothée Chalamet and Rebecca Ferguson stand out in a stellar cast, where everyone delivers performances no short of impressive.\r\n\r\nFrom the remarkable character work to the constantly captivating interactions, without forgetting the spectacle of the riveting action/war scenes, the extremely layered screenplay is beautifully translated to the big screen, where every viewer should definitely go to watch this movie.\r\n\r\nFinally, don't forget that epic sci-fi/fantasy films are quite rare, so enjoy them as much as you can when they come out, instead of worrying about the comparisons with other sagas.\r\n\r\nThere's enough space to love them all.\"\r\n\r\nRating: A-",
  "created_at": {
    "$date": "2021-10-22T21:13:27.576Z"
  },
  "updated_at": {
    "$date": "2021-10-22T21:13:27.576Z"
  },
  "helpful": null,
  "not_helpful": null
},
{
  "_id": {
    "$oid": "666b3fca00105718d9a4b71b"
  },
  "movie_id": {
    "$oid": "666b0bcbff071d36d47fa05e"
  },
  "user_id": {
    "$oid": "666b38f200105718d9a4b4c8"
  },
  "content": "I'll open by saying I am not a fan of Villeneuve. In fact, I think he's a hack whose only genuine talent is making stupid people falsely think they are actually quite smart. I am also a HUGE Dune fan. They have been my favourite series of books since I first discovered them as a teenager. So although I hoped for the best with this, I was expecting the worst. What I got was somewhere in the middle. It's an OK movie, not great, thankfully not terrible, but OK\r\n\r\nIt got some things right the 1984 Lynch version got wrong, but still somehow managed to get other stuff wrong (including stuff Lynch got right). It was also a surprise how much Villeneuve just lifted directly from the Lynch film, both visually and auditorily.\r\n\r\nThe wardrobe choices were a huge disappointment. If you didn't know the time setting, going just on the clothes in the new Dune you'd be forgiven for thinking it was set a mere forty or fifty years (if that) in the future rather than the twenty thousand years in the future when it's really set. The Lynch stillsuits look futuristic, unworldly, and something that really would keep you alive in the deep desert. The new desert wear looks like they are just going to go dirt biking for an hour or two in our present-day world.\r\n\r\nThe casting (completely ignoring the pointless gender swap) was good, However, with the exception of Paul, Chani, and Rabban the original casting was all better. But the original (apart from the odd decision to use the totally unsuited Kyle MacLachlan) was a masterclass in how to cast the perfect people for the role.\r\n\r\nAnyway, enough of the comparisons, This film is about the first two-thirds of the first novel. I always thought the story would be better told via a big-budget TV series (or even mini-series) rather than a standalone movie. I still think what they tried to cover here was too much for a single movie, but it was a step in the right direction.\r\n\r\nThe film mainly sticks to the book story but does make some needless changes, the most obvious of which being the changes made to both the gender and story of Liet Kynes, which in turn impacts the story of Chani. Most other changes are small and mainly insignificant though.\r\n\r\nThe film being filmed in Norway, Jordan, and Abu Dhabi looks fantastic and very well suited to the large screen. And it's clear a great deal of time, effort, and money was put into the sets that looked equally good as the places they were meant to be.\r\n\r\nThe acting was of a suitably high standard, but unfortunately, many of the Dune names and terms were horribly mispronounced. That and the Hans Zimmer fart that is played constantly throughout the soundtrack is likely to pull people out of their emersion in the movie.\r\n\r\nI was also somewhat surprised by what was left out, OK the source material is VERY dense and obviously some needed to be cut, but I don't really think it's made clear just how crucial melange is to the functioning of the empire and society as a whole. Also what (and why) mentats are is largely ignored, you may think that isn't overly important, but it is at the core of how many things are done in the Dune universe.\r\n\r\nOver all, it's not a bad movie. Despite its flaws, I still think the 1984 Lynch version is better though.",
  "created_at": {
    "$date": "2021-10-27T21:31:05.180Z"
  },
  "updated_at": {
    "$date": "2021-10-27T21:31:05.180Z"
  },
  "helpful": null,
  "not_helpful": null
},
{
  "_id": {
    "$oid": "666b3fca00105718d9a4b71c"
  },
  "movie_id": {
    "$oid": "666b0bcbff071d36d47fa05e"
  },
  "user_id": {
    "$oid": "666b38f200105718d9a4b4ca"
  },
  "content": "I enjoyed parts of this movie. But I seem to recall that I enjoyed reading the book this is based on (it was decades ago after all). And since I don’t remember the details of the source novel, I don’t know if it is the screenplay that dragged down my overall opinion or the original book.\r\n\r\nI can sum up pretty quickly the pieces that disappointed me, and be advised they are probably spoilers.\r\n\r\nI didn’t like how long it took to get our first glimpse of the spice worms, and even then they were represented as holes in the sand. Not exactly awesome. I didn’t like how they quickly killed off all the good guys except for Paul and his mom (okay, yeah that is definitely a spoiler). Plus I thought it weird that during the big battle scene we have awesome bombs and complex tracer missiles flying about, but on the ground we have merely well-choreographed hand-to-hand fighting with knives and swords. Couldn’t the folks who invented the missile come up with a pistol? Or am I being picky?",
  "created_at": {
    "$date": "2021-11-07T01:59:33.313Z"
  },
  "updated_at": {
    "$date": "2021-11-07T01:59:33.313Z"
  },
  "helpful": null,
  "not_helpful": null
},
{
  "_id": {
    "$oid": "666b3fca00105718d9a4b71d"
  },
  "movie_id": {
    "$oid": "666b0bcbff071d36d47fa05e"
  },
  "user_id": {
    "$oid": "666b38f200105718d9a4b4cc"
  },
  "content": "I read Frank Herbert's book, Dune, when I was in high school and really don't remember it much except that it was great and a little scary. At that age, I probably didn't get the subtext message.\r\n\r\nI never saw any movies of it so I decided to watch both the 1984 Dune by David Lynch and the 2021 Denis Villeneuve version sequentially. I'm going to talk about both of them here.\r\n\r\nThis may not be a popular opinion: Lynch's version is **brilliant** and the Villeneuve Dune is absolute **shit**. Here's why:\r\n\r\nFirst, is the Villeneuve Dune slick? Yes, absolutely. I should hope so considering it's nearly 40 years after Lynch did his, for crissake.\r\n\r\nAre the character's in David Lynch's version kitschy and over the top? Yes! That's one reason it's so much better! It's Sci Fi, duh! You watch Marvel movies and suspend disbelief for incredible, imaginary super powers? All of Lynch's characters are downright gritty and believable within this particular surreal fantasy.\r\n\r\nBy the end of the Lynch Dune, I had sympathy for nearly every character in the film. Even the villains caught my emotions. Paul Atreides character development was realistic and attractive.\r\n\r\nVilleneuve's characters? I felt like my neighbor came over and asked, \"Hey, can you come to watch my kid's junior high school play?\" \"Sure, Denis, just let me fill my 1-liter flask with tequila first.\"\r\n\r\nVilleneuve's characters were so damned flat and lifeless that they evoked NO emotional response whatsoever. Although I occasionally sit through a bad flick, I can't remember recently watching a movie as awful character-wise, as the 2021 Dune. If I were an actor on that set, I would be silently screaming. How does a director even do this?\r\n\r\nOh, and where's the creativity? It's 46 years since George Lucas founded Industrial Light & Magic, and Denis can't create one single, new, goddamn space machine 46 years later? (One could argue the hummingbird copter is new, but it's not so creative when you realize that we didn't even know how hummingbird wings actually worked until this millennia.)\r\n\r\nBut here's the real clincher: the screenplay. David Lynch gave us a complete story. Sadly, he didn't have the final cut and disowned his film when the critics panned it. Despite the fact that Lynch is a true artist and genius, the studio took 45 minutes out of the film. 45 minutes! Even ruined by the studio, even 40 years later, Lynch's film has a clear vision and carries the timeless message that Frank Herbert intended. I would LOVE to see the original cut!\r\n\r\nVilleneuve, on the other hand, stopped abruptly in the middle of the book. I now realize that Denis is not about the story. Denis is all about the franchise money, and that sucks. As a result of the bad screenplay, this 2021 version doesn't even carry the socio-political statement it was supposed to have. I want my 155 minutes back.\r\n\r\nI don't watch Part 2s, especially when it comes to void-of-creativity and void-of-character-development Hollywood movies. You can take your bad franchise and shove it up your sci fi black hole.\r\n\r\nAdmittedly, I loved Blade Runner 2049, but this is so disappointing, I may never watch another Villeneuve film again. Do yourself a favor and see David Lynch's version of Dune.",
  "created_at": {
    "$date": "2021-11-15T23:30:52.817Z"
  },
  "updated_at": {
    "$date": "2021-12-03T21:48:00.474Z"
  },
  "helpful": null,
  "not_helpful": null
},
{
  "_id": {
    "$oid": "666b3fca00105718d9a4b71e"
  },
  "movie_id": {
    "$oid": "666b0bcbff071d36d47fa05e"
  },
  "user_id": {
    "$oid": "666b38f200105718d9a4b4ce"
  },
  "content": "This newest adaptation of the classic Frank Herbert novel (which I've never read) has the usual amazing visuals director Denis Villeneuve is known for alongside great cinematography from Greig Fraser (Rogue One, upcoming The Batman) plus the incredible and bombastic score by Hans Zimmer has the technical aspects but void of any real emotion behind the story and, especially, characters.\r\n\r\nI couldn't find much wrong with the performances but nobody really wowed me despite having talents like Oscar Isaac, Josh Brolin, Javier Bardem, Jason Momoa and Rebecca Ferguson, I didn't think anybody stood out, and that includes Timothée Chalamet in the lead role. I can't say this was at all bad and have some mild interest in part two, but, and this says a lot about Villeneuve's great career, this is one of his lesser films. I'll probably at some point give this another watch, especially when/if part two comes out (who knows when that will be). **3.75/5** (rounding it, I was debating 3.5 or 4, went with the latter)\r\n\r\nOn the plus side, it is much better than the 1984 adaptation.",
  "created_at": {
    "$date": "2022-01-07T22:53:41.500Z"
  },
  "updated_at": {
    "$date": "2022-01-07T22:53:41.500Z"
  },
  "helpful": null,
  "not_helpful": null
},
{
  "_id": {
    "$oid": "666b3fca00105718d9a4b71f"
  },
  "movie_id": {
    "$oid": "666b0bcbff071d36d47fa05e"
  },
  "user_id": {
    "$oid": "666b38f200105718d9a4b4d0"
  },
  "content": "I was really eager to watch this movie and at the same time a wee bit concerned because I knew that I would be hugely disappointed if it turned out to be another movie massacring a classic source material.\r\n\r\nI have to admit that it was a very long time since I read the Dune books but I have to say that the movie was mostly true to the books, as I remember them, and also reasonably free of agenda driven rubbish apart from the odd replacement of some characters with “gender correct” ones for no real good reason.\r\n\r\nThere is really not much point in me saying much about the story. It should be well known for any science fiction fan and it is a great story and really good material for a big screen movie despite some “critics” at Rotten Tomatoes moaning about it and calling it unwieldly etc. Probably too big a book with too many words for the small, agenda driven, brains of Rotten Tomatoes “critics”. No surprise there.\r\n\r\nThe movie as a whole is wonderful to watch, the scenery is oftentimes very beautiful and the décor, the buildings, the machinery is very well done. I was surprised that the world of Caladan was portrayed as a rather austere Scottish looking landscape but after getting over the initial surprise it worked very well actually.\r\n\r\nI also like that the Harkonnen, especially the Baron, are not turned into some exaggerated comical figures but, although disgusting and despicable, they are actual humans.\r\n\r\nOverall the casting was quite good and everyone played their roles well. At the beginning I felt that Paul was a bit too wimpy, from what I remember of the book he was quite well trained and skilled already from the start, but he picked up as the movie went along.\r\n\r\nIt is a science fiction, borderline fantasy, movie so there should be some special effects, right? This is a difficult movie to make special effects for since this universe is a weird mix between futuristic science fiction, fantasy elements and old-fashioned traditions.\r\n\r\nI have to say that they succeeded quite well though. The atmosphere felt just right, ships, spice harvesters, buildings looked cool and fitting the story. The way they implemented the personal shields was very nice. They didn’t go overboard on special effects and weird designs. The ornithopter was of course totally ridiculous from a scientific point of view but at least it looked pretty cool.\r\n\r\nIf I should complain about something, although that is not the fault of the movie but of the source material, I have never understood how, in a universe which is obviously driven by hidden agendas, machinations and assassinations, the Atreides could just pick up everything, leave their home and put all their important eggs in one basket at Arrakis.\r\n\r\nOne more small thing that I could complain about would of course be that we now have to wait two years, from what I have read, until we get to watch the next movie to get to the part were the really cool stuff happens.\r\n\r\nBottom line, this was movie is definitely in there vying for the title “best movie that I have watched this year”.",
  "created_at": {
    "$date": "2022-01-30T09:50:05.425Z"
  },
  "updated_at": {
    "$date": "2022-01-30T09:50:05.425Z"
  },
  "helpful": null,
  "not_helpful": null
},
{
  "_id": {
    "$oid": "666b3fca00105718d9a4b720"
  },
  "movie_id": {
    "$oid": "666b0bcbff071d36d47fa05e"
  },
  "user_id": {
    "$oid": "666b38f200105718d9a4b4d2"
  },
  "content": "‘Dune’s massive scope tends to overshadow its storyline and characters, but in return we get a great cast and stunning visuals, leaving us hoping the second chapter will be able to live up to the expectations.\r\n\r\n8/10",
  "created_at": {
    "$date": "2022-02-26T20:31:13.130Z"
  },
  "updated_at": {
    "$date": "2022-02-26T20:31:13.130Z"
  },
  "helpful": null,
  "not_helpful": null
},
{
  "_id": {
    "$oid": "666b3fca00105718d9a4b721"
  },
  "movie_id": {
    "$oid": "666b0bcbff071d36d47fa05e"
  },
  "user_id": {
    "$oid": "666b38f200105718d9a4b4d4"
  },
  "content": "_Dune_ was a massive undertaking due to the sheer amount of lore and political backstory director Villeneuve had to fit in a two-and-a-half-hour run-time, but I am happy to say it was executed brilliantly.\r\n\r\nThe story of _Dune_ is incredibly deep, there are so many layers of political factions and relationships that it can get quite confusing at times. I had to constantly be looking up specific individuals and their ties to each other to understand the minor nuances of the story. Despite that fact, Villeneuve is still able to deliver a coherent narrative that will allow the majority of the audience to understand the overarching plot. After the buildup of the first act, the story gets cooking, and I was utterly invested.\r\n\r\nThere is an incredible atmosphere present in this film. It begins as a Sci-Fi epic, following a house starting anew on a fresh planet and a new industry to conquer. You can feel the optimism and the sense of discovery in the shots due to the interesting angles, lighting, and a brilliant soundtrack composed by Hans Zimmer. But as the narrative evolves so does the tone, as a thick fog of helplessness bleeds on to the screen and you can feel the dread form. This tone was quite refreshing in today’s blockbuster cinema, as each movie needs to incorporate a vast amount of unnecessary comedy to appeal to the broader audience. Dune is unapologetic about what the story is trying to deliver and gives you exactly what it wants without any concessions.\r\n\r\nThe visuals are stunning throughout the entire runtime. One of my favorite scenes was during the spice extraction visit. I loved the blend of realism that was used in this Science Fiction setting. The ships and equipment look like they could exist in our own world with a few technological advancements. The fight choreography is really well done, especially the hand-to-hand combat. The final scene was epic, each fist and punch were so sharp and calculated, it was really impressive to watch in the age of jump cut action.\r\n\r\nThe acting is perfect throughout the film, I really cannot point to any one character that felt off or out of place. Timothee Chalamet did an incredible job as the lead man. He delivered a heartfelt performance and evolved throughout the entire film into the confident leader the story crashendos on. Rebecca Ferguson, Oscar Isaac, and Josh Brolin all did great jobs as well. I really brought the somewhat complex nature of Lady Jessic and Duke Leto, they had really great chemistry with themselves and with their son. Stellan Skarsgard had my favorite performance of the entire film. I felt entirely disgusted everytime he was on the screen, and he made the hairs on the back of my neck stand tall. He is truly a man poisoned by greed and will not stop at anything on his path to fortune. Jason Momoa does a fantastic job here too. I felt he really fit his role and his lines were delivered effortlessly, much better than his performance in the DCEU.\r\n\r\n_Dune_ delivers a fantastic Sci-Fi epic that gave me everything I was looking for and I will be eagerly awaiting the sequel's release.\r\n\r\n**Score:** _88%_\r\n\r\n**Verdict:** _Excellent_",
  "created_at": {
    "$date": "2022-07-15T17:57:01.104Z"
  },
  "updated_at": {
    "$date": "2022-07-15T17:57:01.104Z"
  },
  "helpful": null,
  "not_helpful": null
},
{
  "_id": {
    "$oid": "666b3fca00105718d9a4b722"
  },
  "movie_id": {
    "$oid": "666b0bcbff071d36d47fa05e"
  },
  "user_id": {
    "$oid": "666b38f200105718d9a4b4d6"
  },
  "content": "**Overall : Dune creates a universe and characters at an epic scale similar to Star Wars. For sci-fi fans, cinema fans, and fans of incredible special effects, Dune is a must-see.**\r\n\r\nProbably the most visually stunning movie of the year. I watched it first at home on HBO Max but had to see and hear it again in theaters when I realized this movie required a complete theatrical experience! The cast was top-notch, and the scale that Denis Villeneuve evoked in every scene was breathtaking. From the moment, Dune starts, it demands a sequel through its world-building, acting, and storylines leaving the audience wanting answers (the fact that it literally begins with the words \"Part One\" helps too). I can't wait to see what comes next!",
  "created_at": {
    "$date": "2022-08-19T23:16:05.343Z"
  },
  "updated_at": {
    "$date": "2022-09-03T15:17:21.428Z"
  },
  "helpful": null,
  "not_helpful": null
},
{
  "_id": {
    "$oid": "666b3fca00105718d9a4b723"
  },
  "movie_id": {
    "$oid": "666b0bcbff071d36d47fa05e"
  },
  "user_id": {
    "$oid": "666b38f200105718d9a4b4d8"
  },
  "content": "Good",
  "created_at": {
    "$date": "2024-02-28T13:03:57.211Z"
  },
  "updated_at": {
    "$date": "2024-02-29T16:53:23.035Z"
  },
  "helpful": null,
  "not_helpful": null
},
{
  "_id": {
    "$oid": "666b3fca00105718d9a4b724"
  },
  "movie_id": {
    "$oid": "666b0bcbff071d36d47fa05f"
  },
  "user_id": {
    "$oid": "666b38f200105718d9a4b491"
  },
  "content": "Though it does sort of get going in the last twenty minutes or so, the rest of this is a really slow family discord drama that features hardly any ghosts but is more of a finding herself exercise for \"Phoebe\" (McKenna Grace) that involves her coming to terms with psuedo-father \"Gary\" (Paul Rudd) and relating to her very own chess-playing version of \"Moaning Myrtle\" - only this one's called \"Melody\" (Emily Alyn Lind). When we do actually focus on things mystic, the story revolves around a brass sphere that is covered with ancient hieroglyphics. This comes into the possession of 'Stantz\" (Dan Aykroyd) who takes it to the team for further investigation. Needless to say, that causes quite a bit of mayhem whilst, meantime, the mayor (William Atherton) is after the \"Ghostbusters\" for causing expensive havoc every time they trap a ghost. That contretemps will question the very existence of their firehouse operation and of their ongoing mission to boldy go... Anyway, as the plot lurches along we get the odd opportunity to see some proton packs in action; the old car gets put through it's paces and the original \"Bibendum\" ghosts get an outing or two, too, as a sort of bellwether for impending doom. That impending doom is all delivered, frostily, too little and too late to rescue this entirely derivative two hours from the cinema doldrums. The original cast - Bill Murray, Ernie Hudson, Annie Potts and Aykroyd really need to stop appearing to legitimise these sequels - they are not patch on the original and really do smell, strongly, of flogging the dead horse. I would recommend a cinema viewing, though - at least that makes the most of the visuals. This will look distinctly mediocre on the television.",
  "created_at": {
    "$date": "2024-03-28T09:11:09.600Z"
  },
  "updated_at": {
    "$date": "2024-03-28T09:11:09.797Z"
  },
  "helpful": null,
  "not_helpful": null
},
{
  "_id": {
    "$oid": "666b3fca00105718d9a4b725"
  },
  "movie_id": {
    "$oid": "666b0bcbff071d36d47fa05f"
  },
  "user_id": {
    "$oid": "666b38f200105718d9a4b48d"
  },
  "content": "FULL SPOILER-FREE REVIEW @ https://talkingfilms.net/ghostbusters-frozen-empire-review-a-step-back-that-still-holds-enough-entertainment/\r\n\r\n\"GHOSTBUSTERS: FROZEN EMPIRE falls short of its predecessor, but the members of the classic and new cast inject enough energy, charm, and emotion to compensate for the narrative inconsistencies and pacing issues.\r\n\r\nMckenna Grace's remarkable performance carries the film, but putting all the narrative, thematic, and emotional weight on a single character generates inevitable problems.\r\n\r\nIt's unlikely to become the favorite installment for fans of the franchise, but it's still an adventure with enough entertainment to satisfy families around the world.\"\r\n\r\nRating: B-",
  "created_at": {
    "$date": "2024-03-29T20:17:01.168Z"
  },
  "updated_at": {
    "$date": "2024-03-29T20:17:01.253Z"
  },
  "helpful": null,
  "not_helpful": null
},
{
  "_id": {
    "$oid": "666b3fca00105718d9a4b726"
  },
  "movie_id": {
    "$oid": "666b0bcbff071d36d47fa05f"
  },
  "user_id": {
    "$oid": "666b38f200105718d9a4b49d"
  },
  "content": "Whilst not as awful as its 2016 counterpart, the latest instalment in the Ghost Busters franchise, is hardly noteworthy either.\r\n\r\nFrozen Empire tries, in vain, to recapture the vibe of the first film from 1984. There's an earnest effort to re-establish the off the wall,  goofiness of the original. Even bringing in old cast members to help things along. Sadly the wry wit and humour that defined the old flick, not to mention the remarkably deep characterisations, is largely absent. \r\n\r\nWhat you are left with is empty mimicry that's none too inspiring, backed by a story and action that's not awful but really feels like its going through the motions. On the subject of the story, I will give kudos to the fact it is, at least, a little original and imaginative. \r\n\r\nRegrettably whilst this film is superficially watchable its also instantly forgettable, having none of the blockbuster potential found in the first film, way back when. That said and again, in fairness, society has moved on from Ghostbusters. Its unsophisticated by modern standards and is never going to be the kind of hit it was in simpler, cinematic times.\r\n\r\nI think the final question then, is why keep trying? Is Hollywood really so bereft of new ideas, that reinventing the past is all it can aspire to?\r\n\r\nIn summary, tries to wring the last drop out of a well worn and frankly, worn out franchise, that's long since, had its day. Superficially watchable but also instantly forgettable.",
  "created_at": {
    "$date": "2024-04-02T03:12:49.037Z"
  },
  "updated_at": {
    "$date": "2024-04-02T03:16:37.695Z"
  },
  "helpful": null,
  "not_helpful": null
},
{
  "_id": {
    "$oid": "666b3fca00105718d9a4b727"
  },
  "movie_id": {
    "$oid": "666b0bcbff071d36d47fa060"
  },
  "user_id": {
    "$oid": "666b38f200105718d9a4b491"
  },
  "content": "As with any film that's the first in a trilogy, this spends just a little too long setting out who's who but once it does, this develops into an enjoyable fantasy adventure film that brings a wonderfully vibrant myriad of Chinese mythological and human characters to life. Ancient rivalries and battles between humanity, the deities and some marvellously created mystical beasts - especially the dragons - form the basis of the story set some three millennia ago. Personally, I tended to the side of the immortals - and there's even the slightest hint of a bromance for one of them - as the \"Demon Fox\", and the manipulative \"King Zhou\" use mankind's greed, avarice, loyalty and decency to ensure they retain their place at the top of the mountain. The visual effects are usually top drawer and the action scenes avoid the often lazily constructed, repetitive, style of combat scenes. Now the acting isn't the best - indeed there is plenty of woodenness for us to inspect here, and I also found it a bit over-scored, but the richness of the mythology could, a bit like \"Lord of the Rings\", perhaps, provide for more characterful adventures and personality development in the next film. For a part one, though, it's a long, but increasingly quite compelling watch if you like the genre and appreciate the wealth of stories before us. Get comfy though - we're in for a long ride!",
  "created_at": {
    "$date": "2023-10-21T09:16:58.504Z"
  },
  "updated_at": {
    "$date": "2023-10-21T09:16:58.641Z"
  },
  "helpful": null,
  "not_helpful": null
},
{
  "_id": {
    "$oid": "666b3fca00105718d9a4b728"
  },
  "movie_id": {
    "$oid": "666b0bcbff071d36d47fa065"
  },
  "user_id": {
    "$oid": "666b38f200105718d9a4b48d"
  },
  "content": "FULL SPOILER-FREE REVIEW @ https://fandomwire.com/land-of-bad-review-an-engaging-yet-flawed/\r\n\r\n\"Land of Bad offers an engaging yet flawed rescue operation that should please most viewers seeking adrenaline-driven entertainment. With excellent performances across the board, William Eubank employs fast pacing, high-intensity shootout sequences with a few interesting stylistic choices, and basic yet riveting storytelling.\r\n\r\nCharacter development and thematic depth remain surface-level, and the third act’s plot conveniences contrast with the realism of previous segments, but the film ultimately accomplishes what it promised, providing enough moments of tension empowered by a potent score to still reach the shore.\"\r\n\r\nRating: B-",
  "created_at": {
    "$date": "2024-02-16T20:17:20.013Z"
  },
  "updated_at": {
    "$date": "2024-02-16T20:17:20.113Z"
  },
  "helpful": null,
  "not_helpful": null
},
{
  "_id": {
    "$oid": "666b3fca00105718d9a4b729"
  },
  "movie_id": {
    "$oid": "666b0bcbff071d36d47fa065"
  },
  "user_id": {
    "$oid": "666b38f200105718d9a4b495"
  },
  "content": "I appreciate a lazy man. Sitting around angry in a car. Sitting around angry in a drone chair. Crowe is really doing it well. Cool explosions. Lots of guns. You can figure out if you like this movie by the box art. Didn't really believe the main plot shift or the disposition of the lead. Would have scored 2 higher if it was 30 minutes shorter. Basketball/pregnancy side plot would have been an easy way to cut all that. Get out the chair skinny boy. Fatties know how to drone.",
  "created_at": {
    "$date": "2024-02-17T13:59:05.105Z"
  },
  "updated_at": {
    "$date": "2024-02-17T13:59:05.186Z"
  },
  "helpful": null,
  "not_helpful": null
},
{
  "_id": {
    "$oid": "666b3fca00105718d9a4b72a"
  },
  "movie_id": {
    "$oid": "666b0bcbff071d36d47fa065"
  },
  "user_id": {
    "$oid": "666b38f200105718d9a4b49d"
  },
  "content": "Land of Bad is yet another bland production line, pro US military, action flick.\r\n\r\nComing kitted out with the usual pro US exceptionalism and bad guys who have a valid point about imperialism but are still \"bad\" anyway, this film offers nothing even remotely original or in this reviewers opinion, terribly likeable.\r\n\r\nThe characters are your usual array of entitled, obnoxious, US military types, who go on a flawed escapade in someone else's country to retrieve a CIA asset. Things turn sour and well the rest is your by the book, bravado, darning do, bravery, codswallop.\r\n\r\nFight scenes are frenetic, well paced and impressive. Lots of pyrotechnics and slow motion bullet and shell casing shots.Certainly from an exposition point of view, this film is not dull. \r\n\r\nActing is unremarkable but its the story that really leaves a lot to be desired. Putting aside its predictable bias, this tale is cliched, pedestrian and utterly predictable. Its essentially, every stale, second rate, US military action flick, you have ever seen with Australians and New Zealanders, in the lead.  \r\n\r\nIn summary, a film loaded down with tired pro US sentiment that's thoroughly unoriginal. Really only watchable in terms of its admittedly fast paced and elaborate, exposition.",
  "created_at": {
    "$date": "2024-02-17T22:42:58.313Z"
  },
  "updated_at": {
    "$date": "2024-02-17T22:45:37.849Z"
  },
  "helpful": null,
  "not_helpful": null
},
{
  "_id": {
    "$oid": "666b3fca00105718d9a4b72b"
  },
  "movie_id": {
    "$oid": "666b0bcbff071d36d47fa065"
  },
  "user_id": {
    "$oid": "666b38f200105718d9a4b4e1"
  },
  "content": "Russel Crowe did a pretty good job. There were a bunch of explosions n stuff. It was alright I guess.",
  "created_at": {
    "$date": "2024-03-14T01:50:30.050Z"
  },
  "updated_at": {
    "$date": "2024-03-14T01:50:30.154Z"
  },
  "helpful": null,
  "not_helpful": null
},
{
  "_id": {
    "$oid": "666b3fca00105718d9a4b72c"
  },
  "movie_id": {
    "$oid": "666b0bcbff071d36d47fa065"
  },
  "user_id": {
    "$oid": "666b38f200105718d9a4b499"
  },
  "content": "The beginning of this morning was a bit slow. But it did get better throughout the movie. The story line was decent. Definitely a decent movie. It kept you alert not knowing what was going to happen out on the field. Had some humor in it from Russell Crowe to guide the Hemsworth brothers through rough territory. Great story. Happy ending.",
  "created_at": {
    "$date": "2024-04-02T19:11:10.434Z"
  },
  "updated_at": {
    "$date": "2024-04-08T16:33:21.145Z"
  },
  "helpful": null,
  "not_helpful": null
},
{
  "_id": {
    "$oid": "666b3fca00105718d9a4b72d"
  },
  "movie_id": {
    "$oid": "666b0bcbff071d36d47fa067"
  },
  "user_id": {
    "$oid": "666b38f200105718d9a4b491"
  },
  "content": "\"Iris\" (Freya Allan) unexpectedly inherits a dilapidated pub from her estranged father (Peter Mullen) and is actively encouraged to just sell it by the solicitor (the always good at the creepy characters Ned Dennehy). She decides to spend a night - along with some VHS instructions - in the place to think on things and encounters the enigmatic young \"Neil\" (Jeremy Irvine) who offers her £4,000 so he can talk to his wife in the cellar! She tells him to come back next day, asks her lawyer pal \"Katie\" (Ruby Barker) to come and stay and before too long reckons she could be on to a cunning money-making wheeze. He comes back and to the cellar the three head. Two chairs and a great big hole in the wall greet them, followed by some filthy and scrawny fingers as the eponymous woman emerges from the darkness and... Yikes! Rather than being scared witless, \"Iris\" does a wee bit of research and concludes that she can control this scenario and make loads of cash too. \"Katie\" isn't so easily convinced and the lovelorn \"Neil\" is clearly working on a solution that will work more permanently for him! There are some startlingly stupid decisions made by the characters in this film, and some of the (sparing) visual effects are the stuff of the \"Exorcist\" from fifty years ago, but as a low-budget enterprise it is no worse than your standard Blumhouse fayre that trot in and out of our cinemas every few weeks. The acting is all adequate, as is the writing and the story has it's moment of intrigue as it develops. Though I'll never remember watching it in a fortnight, I quite enjoyed it for the ninety minutes leading to a denouement that I did rather like.",
  "created_at": {
    "$date": "2024-01-31T11:29:03.474Z"
  },
  "updated_at": {
    "$date": "2024-01-31T11:29:03.588Z"
  },
  "helpful": null,
  "not_helpful": null
},
{
  "_id": {
    "$oid": "666b3fca00105718d9a4b72e"
  },
  "movie_id": {
    "$oid": "666b0bcbff071d36d47fa068"
  },
  "user_id": {
    "$oid": "666b38f200105718d9a4b48d"
  },
  "content": "FULL SPOILER-FREE REVIEW @ https://www.firstshowing.net/2023/review-nolans-oppenheimer-is-a-harrowing-tale-of-one-mans-life/\r\n\r\n\"Oppenheimer is a true masterclass in how to build extreme tension and suspense through fast, detailed dialogue, an insanely powerful sound production, and an equally explosive score from Ludwig Göransson. Words cannot fully describe Hoyte van Hoytema's gorgeous cinematography.\r\n\r\nIt's a harrowing, disturbing, genuinely frightening story about how one man's compulsion and political power changed the world. Cillian Murphy, Robert Downey Jr., and Emily Blunt shouldn't miss any awards ceremonies… they're absolutely superb, as are the rest of the exceptional actors involved in the movie.\r\n\r\nPacing, structure, and runtime, in addition to its quasi-documentary style and its narrative complexity, make this a difficult, heavy watch that will, for sure, leave some viewers disappointed, bored, or simply tired. Ultimately, Christopher Nolan justifies the use of the expression \"not for everyone\".\r\n\r\nRating: A-",
  "created_at": {
    "$date": "2023-07-20T22:49:57.141Z"
  },
  "updated_at": {
    "$date": "2023-07-20T22:49:57.237Z"
  },
  "helpful": null,
  "not_helpful": null
},
{
  "_id": {
    "$oid": "666b3fca00105718d9a4b72f"
  },
  "movie_id": {
    "$oid": "666b0bcbff071d36d47fa068"
  },
  "user_id": {
    "$oid": "666b38f200105718d9a4b4e6"
  },
  "content": "**OPPENHEIMER IS \"NOT FOR EVERYONE\" AS STATED BY CHRISTROPHER NOLAN BEFORE THE RELEASE OF THE FILM HIMSELF. ** But those who have ample knowledge of physics and chemistry, this film is a masterpiece. The film takes the viewer into the mind of the \"Father of the atomic bomb\" how he thinks, how he feels with much accuracy. Nolan beautifully explains his life both on a private and professional front. The music, the sounds with each scene are top notch. The visuals of QUANTUM PHYSICS, FISSION, NUCLEAR EXPLOSION are mind-boggling. \r\n\r\nIf possible, watch it in IMAX. \r\n\r\nTHE MOVIE IS FULL OF DIALOGUES, CONVERSATIONS MOVING BACK AND FORTH IN TIMELINE. It's a historical biography with fantabulous acting by C.M., E.B., R.D.J. and more. The scenes with ALBERT EINSTEIN are just wow. A plethora of scientists(BOHR, FERMI, TELLER, HEISENBERG) of the age can be seen throughout.  There are no action scenes if you are in search of that. \r\n\r\nIT IS A CINEMATOGRAPHIC BRILLIANCE. IF U CAN'T WATCH SIENTIFIC HISTORY JUST DON'T GO.",
  "created_at": {
    "$date": "2023-07-23T19:38:28.707Z"
  },
  "updated_at": {
    "$date": "2023-07-24T15:29:54.424Z"
  },
  "helpful": null,
  "not_helpful": null
},
{
  "_id": {
    "$oid": "666b3fca00105718d9a4b730"
  },
  "movie_id": {
    "$oid": "666b0bcbff071d36d47fa068"
  },
  "user_id": {
    "$oid": "666b38f200105718d9a4b4b1"
  },
  "content": "Telling the story of a larger-than-life individual truly calls for a larger-than-life film, and that’s precisely what writer-director Christopher Nolan has come up with in his latest feature outing, handily the best work of his career. Nolan’s three-hour opus about the life of Dr. J. Robert Oppenheimer (Cillian Murphy), director of the Manhattan Project (and more commonly known as the Father of the Atomic Bomb), provides viewers with a comprehensive biography of this brilliant and thoughtful yet often-inscrutable and naïve physicist who took on a patently dangerous venture that left him morally conflicted about the nature of his creation. The story, which spans several decades of the scientist’s life, chronicles his development of “the gadget” and the fallout he suffered as a consequence of his left-wing political leanings and his efforts to keep the released nuclear genie from getting out of control. The film is admittedly a little overlong and probably could have used some editing in the opening and final hour, but, in the interest of telling the whole story of Oppenheimer’s odyssey, its length is understandable (and, consequently, justifiable). The picture’s production values are all top shelf, especially its brilliant cinematography, stirring original score and superb sound quality, an element that truly leaves audiences with a bona fide visceral experience. Moreover, the narrative is skillfully and eloquently brought to life by this offering’s outstanding ensemble cast, including Murphy, Matt Damon, Tom Conti, Benny Safdie, Emily Blunt, Florence Pugh, Gary Oldman, Rami Malek, and, especially, Robert Downey Jr., who delivers a stellar, award-worthy supporting performance showing acting chops that I never knew he possessed. “Oppenheimer” is easily the best film of the summer movie season, if not all of 2023 thus far. It packs a potent punch and delivers a message that we can all never hear too often, poignantly reminding us all of the importance of not falling prey to the same Promethean burden that Oppenheimer was forced to shoulder.",
  "created_at": {
    "$date": "2023-07-24T12:59:23.547Z"
  },
  "updated_at": {
    "$date": "2023-07-24T12:59:23.624Z"
  },
  "helpful": null,
  "not_helpful": null
},
{
  "_id": {
    "$oid": "666b3fca00105718d9a4b731"
  },
  "movie_id": {
    "$oid": "666b0bcbff071d36d47fa068"
  },
  "user_id": {
    "$oid": "666b38f200105718d9a4b491"
  },
  "content": "Cillian Murphy offers an assured and considered performance here as the man who is credited with developing the bomb that hastened the end of WWII in the far east. He is the increasingly acclaimed, eponymous, physicist who is made aware by Admiral Lewis Strauss (another strong performance from Robert Downey Jr.) that it just possible that the Russians have the A-bomb. Now Oppenheimer already suspects that the Nazis are also well on their way to weaponising the atom - his earlier education and career had introduced him to some of the prominent minds in the UK and in Germany who were quite capable of taking the theory forward; so he begins to pressurise the American government to begin it's own programme - and the \"Manhattan Project\" is born. Motivated/goaded/galvanised by the ambitious \"Col. Groves\" (Matt Damon) he assembles a formidable collection of scientific minds at a purpose built, desert, location which he christens Los Alamos, and over the next three years - and with $2bn to spend - they work on the science whilst plutonium and uranium are being simultaneously processed at an irkingly glacial pace! Given that much of this is reasonably well documented history, the actual plot here has little by way of jeopardy. Instead, Christopher Nolan attempts via his writing and direction to put some meat on the bones of the characters here. It's clear that Oppenheimer is a bit of a Lothario, but it's also clear that he can engender the loyalty of a variety of people with diverging views - not just surrounding the science of their project, but around the morals and ethics of creating something that - well, you can't get the toothpaste back into the tube. The latter portion of this drama focusses on the subsequent, communist-obsessed, witch-hunting that went on attempting to persecute and smear this remarkable and flawed individual, and it makes some interesting postulations about just who was pulling whose strings. It also has quite a penetrating resonation about it - not just, specifically, about Oppeneheimer - but about all of those post-event \"enquiries\" that rarely deliver an honest appraisal of what was done in the name of expediency at the time, but ends up more of a character assassination exercise by those who didn't do anything against those who did and had to. Though at times the pace of this thing helps to keep it enthralling, it is too long - at times it really does plod along. Perhaps an other, objective, eye on the writing/direction may have tightened it up without having to sacrifice any of the potency of the story. Maybe someone needs to tell Mr. Nolan that a three hour film isn't always required! That said, it's a gorgeous film to look at. The aesthetics are first rate and the entire sentiment of the film reeks of authenticity. I do think this thrives better on a big screen so try to see it as it was intended. It's though provoking, complex, characterful - and well worth a watch.",
  "created_at": {
    "$date": "2023-07-26T10:19:45.348Z"
  },
  "updated_at": {
    "$date": "2023-07-26T10:19:45.485Z"
  },
  "helpful": null,
  "not_helpful": null
},
{
  "_id": {
    "$oid": "666b3fca00105718d9a4b732"
  },
  "movie_id": {
    "$oid": "666b0bcbff071d36d47fa068"
  },
  "user_id": {
    "$oid": "666b38f200105718d9a4b4ea"
  },
  "content": "This film takes you on an exhilarating journey through history, skillfully weaving together captivating storytelling and breathtaking visuals. The performances were top-notch, leaving me completely immersed in the characters' emotions. A definite must-see!",
  "created_at": {
    "$date": "2023-07-26T17:45:55.401Z"
  },
  "updated_at": {
    "$date": "2023-07-27T15:34:50.997Z"
  },
  "helpful": null,
  "not_helpful": null
},
{
  "_id": {
    "$oid": "666b3fca00105718d9a4b733"
  },
  "movie_id": {
    "$oid": "666b0bcbff071d36d47fa068"
  },
  "user_id": {
    "$oid": "666b38f200105718d9a4b4ec"
  },
  "content": "Cillian Murphy, so hot right now. Film is a little long though.",
  "created_at": {
    "$date": "2023-08-02T17:40:24.373Z"
  },
  "updated_at": {
    "$date": "2023-08-02T17:40:24.449Z"
  },
  "helpful": null,
  "not_helpful": null
},
{
  "_id": {
    "$oid": "666b3fca00105718d9a4b734"
  },
  "movie_id": {
    "$oid": "666b0bcbff071d36d47fa068"
  },
  "user_id": {
    "$oid": "666b38f200105718d9a4b4ee"
  },
  "content": "The intersection of innovation, science, political bureaucracy, and ethics meet in writer-director Christopher Nolan‘s “Oppenheimer,” a dark, challenging biopic about the father of the atomic bomb, Dr. J. Robert Oppenheimer. This profound epic clocks in at three hours yet never feels too long, even if it’s painfully clear that Nolan is indulging himself in a passion project.\r\n\r\nDuring World War II, Lt. General Leslie Groves Jr. (Matt Damon) appoints physicist Oppenheimer (Cillian Murphy) to work on the top-secret Manhattan Project in Los Alamos, New Mexico. Assembling a team of the brightest scientists the country has to offer, the experts spend years developing and designing the atomic bomb. When their final product is used against Japan on July 16, 1945, the world witnesses its first nuclear explosion in an event that not only ends the war, but forever changes the course of history.\r\n\r\nThere has been much hype about the fact that Nolan chose to film in IMAX, but the large format feels wasted here. The visuals are far from stunning, and the film is mostly a dramatic, dialogue-heavy history lesson that’s a far cry from what I’d call “entertaining.” It’s a great movie that’s engaging, sophisticated, and intelligent, but those expecting traditional thrills are going to be greatly disappointed. Save your money, because seeing this in IMAX isn’t really worth it.\r\n\r\nNolan’s film is poignant in a way that’s chillingly relevant. His story not only explores one of the most important figures in U.S. history, but also makes you think about the current lack of empathy that’s plaguing society. There’s a very real moral question about humanity’s ability to make something that will help save the lives of many but also result in the death of innocents, and Nolan makes a strong political statement in a surprisingly restrained manner. His commentary on the far-reaching effects of such a powerful weapon born from the intersection of innovation, science, and government, while being an invention that has changed but also endangered the world, will give you chills. Nolan’s script is terrific, and is one of my favorite screenplays of the year.\r\n\r\nNolan tells much more of the obscure back story of Oppenheimer’s professional and personal life that few know, and it makes for a lengthy (but interesting) narrative. The film includes his ties to the Communist Party, Hoover’s FBI investigation, his tangles with Lewis Strauss (Robert Downey Jr.), and an eventual closed-door hearing that was designed to strip him of his security clearance years after the war ended.\r\n\r\n“Oppenheimer” is a complex film that requires your full attention, with myriad characters and time jumps that will keep you on your toes. A basic knowledge of history is beneficial, but those who have only heard the name Robert Oppenheimer and are aware of the very basics (like the fact that he was involved in the creation of the atomic bomb) won’t be completely lost.\r\n\r\nIn addition to complicated discussions of quantum physics, there are weighty themes about the dangers of government bureaucracy and the moral and ethical implications of creating a weapon of mass destruction. Nolan isn’t the type of storyteller who is keen on hand holding, and it’s refreshing to see a riveting movie that’s made for thinking audiences.",
  "created_at": {
    "$date": "2023-08-04T07:04:22.910Z"
  },
  "updated_at": {
    "$date": "2023-08-04T07:04:22.956Z"
  },
  "helpful": null,
  "not_helpful": null
},
{
  "_id": {
    "$oid": "666b3fca00105718d9a4b735"
  },
  "movie_id": {
    "$oid": "666b0bcbff071d36d47fa068"
  },
  "user_id": {
    "$oid": "666b38f200105718d9a4b4f0"
  },
  "content": "The cinematic masterpiece that is Oppenheimer leaves an indelible impression on anyone who watches it. Christopher Nolan has truly outdone himself with this film, delivering a poignant message about the horrors of nuclear war. The superb direction and exceptional performances by Cillian Murphy, Robert Downey Jr. and others draw you into the story, making you feel as though you are right there in the midst of it all. Even though there aren't any action scenes, the movie still manages to keep you on the edge of your seat for its entire 3-hour runtime. Oppenheimer is a biopic that everyone knows the ending to, but thanks to the expert direction and awe-inspiring performances, it is an experience that will leave a lasting impression on you.",
  "created_at": {
    "$date": "2023-10-02T15:14:08.230Z"
  },
  "updated_at": {
    "$date": "2023-10-03T14:30:07.245Z"
  },
  "helpful": null,
  "not_helpful": null
},
{
  "_id": {
    "$oid": "666b3fca00105718d9a4b736"
  },
  "movie_id": {
    "$oid": "666b0bcbff071d36d47fa068"
  },
  "user_id": {
    "$oid": "666b38f200105718d9a4b4f2"
  },
  "content": "> **Oppenheimer:** I feel like I have blood on my hands, sir.\r\n> \r\n> **Truman:** [takes a handkerchief from his pocket and gives it to him] You think anyone in Hiroshima or Nagasaki gives a shit about who built the bomb?\r\n\r\nan incredibly well-written and extremely well-acted piece of dramatic cinema about the very eventful and complicated life of J. Robert Oppenheimer and it is beautiful. I'm actually surprised this is a huge summer blockbuster.\r\n\r\nanytime Christopher Nolan releases a film, it's obviously an event all around the world because he's made tons of great films and he's one of the very few film-makers working today who really cares about cinema and values that cinematic experience. he's also one of the very few people who's actually given a budget to support his love for cinema. he shoots on film, does everything practically, he wants as little CGI as possible and he has apparently claimed that there isn't a single CGI shot in this film. if that's actually the case, like if he hasn't even included cleanup shots in the film, then my spirit just left my body. it's astounding.\r\n\r\nwent into this film with very limited knowledge about the life of Oppenheimer. like most people, I only knew him as The Father of the Atomic Bomb and the famous lines he quoted from the Bhagavad Gita which are Now I Am Become Death, The Destroyer of Worlds where he's talking about the atomic bomb realising the gravity of his creation and having to live with the sin of his achievement. I had no other knowledge about him as a person, his life outside of the invention, and the events that followed before or after it. so, if you're going into this film expecting an explosion porn, you're most likely to get disappointed having to sit through 3 hours' worth of heavy dramatic dialogue involving moments of genuinely terrifying character development. the film is about the person whose most pivotal moment in life was the success of The Manhattan Project. getting to experience being inside that person's mind as he's trying to visualize all these things combined with an incredible score by Ludwig Göransson and watching all of these rated-R, 3-hour, dialogue-heavy, beautifully shot on film by the master himself Hoyte van Hoytema with black and white sequences in a fucking theatre made me feel like I wasn't in 2023.\r\n\r\nthe performances are excellent. there really is no other word for it. from the top all the way down to the bottom of the incredibly huge cast list, there isn't a single weak link. Robert Downey Jr. is simply terrific. I haven't seen him like this since Kiss Kiss Bang Bang which came all the way back in 2005. I love him as Iron Man but that's more about the character rather than him as an actor. I wouldn't be shocked if he's nominated for a best supporting actor performance. Emily Blunt is also just really really great. there is a sequence early on in the film where Oppenheimer is being questioned and she's just sitting back there in the scene, out of focus. we're not even shown a close-up of her during this entire sequence until it becomes relevant later on in the film and we go back to that sequence when we finally realise the significance of her being there. Nolan has done quite a lot of that in this film actually. major A-list actors are in the film for like 2 scenes and then they never appear again. that's not just a testament to the actors who'd give anything to be in a Nolan-directed film but a testament to Nolan himself, as a film-maker. if we go back to the same sequence I mentioned earlier with Blunt, that's not just anyone sitting there, it's Emily Blunt. a phenomenal actress. but that's what gives the film a sense of groundedness. that the people on-screen are actual people, they behave like people. and for a certain amount of time, allows those celebrities to feel like normal people. Florence Pugh, Matt Damon, Rami Malek, Jason Clarke, Dane DeHaan, I can go on and on but literally everyone is fucking phenomenal. the real star of the show though, is Cillian Murphy. in his first lead role for a Nolan film after having worked with him for almost 20 years, Murphy shines brighter than the atomic bomb itself and walks with suave leaving not just two, but a multitude of shockwaves. his work is beyond phenomenal here. he not only looks like Oppenheimer but every scene he's in, he's just instantly captivating. it's not just his incredible eyes (which go so deep that I just wanna sink myself in them) but, he's just always in character. never did I once see the guy from Red Eye or from Peaky Blinders. it was always Oppie.\r\n\r\nI'm actually putting this review as I listen to the absolutely bonkers score that has been provided for the film. Göransson's work is truly, awesome-tacularly, riveting. my heart was beating so fast in some sequences that have this heavy, beating sounds that I could almost have a seizure. the work here is truly remarkable.\r\n\r\nanother aspect of this film that shines brighter than ever is its editing. this is a 3-hour film that feels like 2 and a half. a half-an-hour of time just evaporated for me. every scene ends perfectly. there is no room for baggage. several big moments of history fly away in an instant. this gives the film a really focused feel. it gives the audience a cue that this is not the story of the world but it is the story of Oppenheimer. Nolan really knows how to edit his films such that they have just the right runtime and I really appreciate when a film-maker does that. it very much also gives this film that documentary-esque aspect and gets you convinced that these events actually did happen and this is not just some made-up story about a man's life.\r\n\r\nthis film is truly a marvelous achievement not just for Christopher Nolan himself as a filmmaker but for cinema as a whole. peak dramatic cinema. watch this on the biggest screen possible and the loudest speakers you can find.",
  "created_at": {
    "$date": "2023-10-16T09:16:57.596Z"
  },
  "updated_at": {
    "$date": "2023-10-19T02:25:33.177Z"
  },
  "helpful": null,
  "not_helpful": null
},
{
  "_id": {
    "$oid": "666b3fca00105718d9a4b737"
  },
  "movie_id": {
    "$oid": "666b0bcbff071d36d47fa068"
  },
  "user_id": {
    "$oid": "666b38f200105718d9a4b4f4"
  },
  "content": "excellent, a perfect example of true defined cinema\r\nAt a whopping three hours long it, very much like LOTR, feels considerably less.\r\nA must watch",
  "created_at": {
    "$date": "2023-11-11T11:35:08.213Z"
  },
  "updated_at": {
    "$date": "2023-11-14T16:34:38.634Z"
  },
  "helpful": null,
  "not_helpful": null
},
{
  "_id": {
    "$oid": "666b3fca00105718d9a4b738"
  },
  "movie_id": {
    "$oid": "666b0bcbff071d36d47fa068"
  },
  "user_id": {
    "$oid": "666b38f200105718d9a4b4ca"
  },
  "content": "Well, with ten other reviews on this site, I am not going to give a blow-by-blow assessment of what I like or don’t like. I am sure other reviews have touched upon hinge I might point out.\r\n\r\nI will only say that I thought it a really good movie: smartly written and nicely acted. I had some trouble following details in places — not because of the complex time structure (though I admit prefer the straight ahead story style of, say, The Godfather) but rather because I couldn’t get volume up loud enough to hear when the characters spoke softly and/or quickly, and without captions I had to wait for the context of conversations to help fill in what I was missing. It was a shame to have such a little thing in the way of a good movie being great.",
  "created_at": {
    "$date": "2023-11-14T20:44:12.255Z"
  },
  "updated_at": {
    "$date": "2023-11-14T20:44:12.367Z"
  },
  "helpful": null,
  "not_helpful": null
},
{
  "_id": {
    "$oid": "666b3fca00105718d9a4b739"
  },
  "movie_id": {
    "$oid": "666b0bcbff071d36d47fa068"
  },
  "user_id": {
    "$oid": "666b38f200105718d9a4b4f7"
  },
  "content": "The movie is incredibly overrated and filled with unnecessary dramatized scenes, making it excessively long. It presents Oppenheimer as a cliche, portraying him as the world's smartest man who can learn a language in six weeks, accompanied by aggressively written advanced equations on a blackboard with a loud soundtrack.\r\n\r\nIn my opinion, this film stands as Nolan's second worst movie, following Tenet. It embodies all his negative qualities, and its duration should not have exceeded 1 hour and 40 minutes, stretching unnecessarily to 3 hours.",
  "created_at": {
    "$date": "2023-11-19T23:17:25.927Z"
  },
  "updated_at": {
    "$date": "2023-11-19T23:17:26.006Z"
  },
  "helpful": null,
  "not_helpful": null
},
{
  "_id": {
    "$oid": "666b3fca00105718d9a4b73a"
  },
  "movie_id": {
    "$oid": "666b0bcbff071d36d47fa068"
  },
  "user_id": {
    "$oid": "666b38f200105718d9a4b4f9"
  },
  "content": "The most inefficient telling of a story that I have ever experienced. Hugely unnecessary character development and unnecessary dramatisation.\r\n\r\nI only made it to halfway before dyeing of boredom... jumped forward a chunk... saw the president say that the Russians would never succeed in obtaining the atomic bomb (unsure as to what he based this on). The movie was a strong testament to how much the US feared penetration by communism... and the fact that the US fear themselves losing their grip on being 'the leaders of the free world' [a title that they have never deserved or earned]... and the fact that no one has learned anything from history and being in perpetual war.\r\n\r\nTruly a missed opportunity to tell this story in a way that would have any memorable meaning.\r\n\r\nNo wonder the planet is doomed to self annihilation at the hands of the 1% (The love of money is the root of all evil).",
  "created_at": {
    "$date": "2023-11-28T19:54:27.167Z"
  },
  "updated_at": {
    "$date": "2023-11-28T19:59:12.819Z"
  },
  "helpful": null,
  "not_helpful": null
},
{
  "_id": {
    "$oid": "666b3fca00105718d9a4b73b"
  },
  "movie_id": {
    "$oid": "666b0bcbff071d36d47fa068"
  },
  "user_id": {
    "$oid": "666b38f200105718d9a4b4d0"
  },
  "content": "I was actually looking forward to watch this movie. Unfortunately I have to say I was rather disappointed when the movie came to an end.\r\n\r\nOne of the most impressive projects ever undertaken filled with scientifical challenges and performed under immense pressure.\r\n\r\nThat is what the movie should have been all about. Unfortunately it is not. Instead all the science, challenges and achievements are just glossed over and we are feed three long, boring, hours about political machinations and his sex life.\r\n\r\nThat is not what I was expecting and it is definitely not what I wanted to watch.\r\n\r\nTrust Hollywood to turn science into a bloody soap-like drama.\r\n\r\nChristopher Nolan is definitely not a person that should be tasked with making a science or history movie. His Dunkirk was underwhelming to say the least and Interstellar was both a poor movie and a joke when it came to science.\r\n\r\nI guess I should have lowered my expectations when I saw they gave the movie to him.",
  "created_at": {
    "$date": "2023-11-29T19:52:37.477Z"
  },
  "updated_at": {
    "$date": "2023-11-29T19:52:37.575Z"
  },
  "helpful": null,
  "not_helpful": null
},
{
  "_id": {
    "$oid": "666b3fca00105718d9a4b73c"
  },
  "movie_id": {
    "$oid": "666b0bcbff071d36d47fa068"
  },
  "user_id": {
    "$oid": "666b38f200105718d9a4b4cc"
  },
  "content": "Honestly too long. This is really two, long films. The first half deals mostly with the science and the scientists. The second half/film deals with the political and moral repercussions of the science.\r\n\r\nOutside the story, Nolan has given us a top notch cast performing at their peak, beautiful cinematography, and a delicious score.",
  "created_at": {
    "$date": "2023-12-29T02:00:30.037Z"
  },
  "updated_at": {
    "$date": "2023-12-29T02:00:30.106Z"
  },
  "helpful": null,
  "not_helpful": null
},
{
  "_id": {
    "$oid": "666b3fca00105718d9a4b73d"
  },
  "movie_id": {
    "$oid": "666b0bcbff071d36d47fa068"
  },
  "user_id": {
    "$oid": "666b38f200105718d9a4b4fd"
  },
  "content": "**Oppenheimer may not be for many people, but it was wonderful for me.** This movie does require some knowledge and interest in science, but it doesn't mean that you have to be an expert. I surely recommend doing some research before and after watching the film to better understand it. I also recommend researching about the simple facts of the Manhattan Project, who the people involved in the Manhattan Project are, and who Oppenheimer is before and after watching the movie.\r\n\r\n**WATCH IT ON THE BIGGEST IMAX SCREEN YOU CAN FIND, especially if you are interested in science, the true story of the Manhattan Project, and course, other Chris Nolan films. This movie was filmed specially for IMAX screening, Nolan and his crew used IMAX 70mm film and cameras, and they also invented the B&W 65mm film specially for this movie.**\r\n\r\nI have watched every single Chris Nolan’s films ever since I was a kid. His movies have been a big part of my life and his movies are the things that helped me go through tough times and give me a new dream. Oppenheimer was just staggering. It was amazing, I do not have the words to describe my feelings watching that movie, especially seeing how much improvements Cillian, Nolan and other actors have gotten through over the years, and I was so glad that Cillian is finally getting the attention he deserves too. The cinematography, the storyline, the dialogues, the characters, the music, the camera angles, position, lighting, editing, the script, and everything else were just amazing. I have read every single line of the transcript and I have already rewatched the movie 5 times to better understand it. I also am reading the American Prometheus which is amazing. After my first time watching Oppenheimer, the thoughts and questions I had after watching it stayed with me for weeks, which led me to watch it again and again. I was amazed, it was breathtaking. The cinematography was beautiful and it couldn’t have been better. The fact that Nolan didn’t use CGI for the Trinity test scene and Oppenheimer's visions of the quantum world just made me more inspired. Five stars are not enough for this movie, neither are any stars and ratings in this world. This movie is out of this world and it is a masterpiece.\r\n\r\n\r\nThe costumes in this movie were simply amazing. The costumes were very well designed, and the colours were also amazing. It also played a huge part in the movie and helped Nolan out a lot by just contributing to making his visuals and imagination come to life. \r\n\r\nThe sound effect was unbelievable. The sound effects + Cinematography and Visual Effects made me feel like I was in the room with all the characters when all the events occurred. The Trinity test scene was also amazing, I loved how Nolan expressed the nervousness of the scientists before and after pressing the button. \r\nI also absolutely loved the soundtrack of this film. Ludwig Goransson used a variety of instruments and tempos to convey the mood of the scene and the emotions of a character. The soundtrack enhances the film scenes and makes the whole film much more interesting to watch. Nothing in this world, no headphones, earphones, and speakers can be used to replicate my feelings listening to these soundtracks in an IMAX theatre.\r\nThe casting was amazing too. The actors were excellent in portraying the difficult emotions of their characters. Cillian Murphy was amazing at representing the emotion Oppenheimer felt during his hardships over the years. The supporting actors and actresses were also amazing at playing the supporting parts in this movie and acting out how their characters had an impact on Oppenheimer's life. \r\n\r\nIf you have already watched the film and found it very fun and interesting, and if you want to learn more about how the film was made, I highly recommend you watch videos online regarding Christopher Nolan's method of making this film. I also recommend you watch interviews and the bts of this film as you may learn more amazing things about the movie and Nolan's way of filmmaking. If you want to learn more about the Manhattan Project and especially Oppenheimer's life, I highly recommend you read The American Prometheus as it is the book that Chris Nolan took the inspiration and information for this film. Although it is quite long, it is worth it. I also recommend you read the transcript of this film if you have time, as you can understand the dialogues and words better and check the parts and details you may have missed in the movie. The script is written in first person POV: Oppenheimer's viewpoint, which makes it more interesting to read, and it makes you feel like you are in the same room as the characters, even without visual effects.\r\n\r\nI was amazed at the fact that Christopher Nolan did not use CGI for this movie. Almost everything was practical and CGI was only used to enhance the look. Nolan has already amazed the cinema society with his simply staggering practical effects that were huge and well-planned. Nolan used all sorts of creative ways to recreate the iconic Trinity Test scene and the unique visions of Oppenheimer. By watching the bts of Oppenheimer, you can see how determined Nolan is to bring a masterpiece to the table.\r\n \r\nSome people may find this movie boring. If you hate movies based on history, have zero interest in science, or hate movies that require a bit of thinking and researching before and after, then probably this movie may not be for you and you might find the movie extremely _boring._ Of course, you should understand that everyone has different opinions and views about almost anything in this world so there is always a possibility that you may disagree with the things I have said here.\r\n**Overall, this movie is a masterpiece**. As a fan of Noaln's films and Cillian Murphy's acting ever since childhood, this film couldn't have been better. I definitely recommend you see this, as soon as possible, and on the biggest IMAX screen possible because it would be worth it. Of course, if you dislike the kinds of films I mentioned in the previous paragraphs, I don't recommend you see this film. I want to thank the crew who have worked very hard on this project, I want to thank the actors who just showed a staggering performance, I want to thank Ludwig Goransson for his amazing soundtracks in this film, and of course, I want to thank Christopher Nolan for his dedication and his amazing film, I would like to call **his masterpiece**.",
  "created_at": {
    "$date": "2023-12-29T14:13:26.952Z"
  },
  "updated_at": {
    "$date": "2024-01-01T17:10:26.308Z"
  },
  "helpful": null,
  "not_helpful": null
},
{
  "_id": {
    "$oid": "666b3fca00105718d9a4b73e"
  },
  "movie_id": {
    "$oid": "666b0bcbff071d36d47fa068"
  },
  "user_id": {
    "$oid": "666b38f200105718d9a4b4ff"
  },
  "content": "Well, was a interesting movie. But, the scene of the nuclear bomb i felt a little disappointed. Even when the credits start to show up i said: \"Wait, really the so trend nuclear bomb scene was what i saw in Los Alamos?\r\n\r\nI imagined another bigger bomb and destructive!",
  "created_at": {
    "$date": "2024-01-04T13:09:01.541Z"
  },
  "updated_at": {
    "$date": "2024-01-06T21:18:01.555Z"
  },
  "helpful": null,
  "not_helpful": null
},
{
  "_id": {
    "$oid": "666b3fca00105718d9a4b73f"
  },
  "movie_id": {
    "$oid": "666b0bcbff071d36d47fa068"
  },
  "user_id": {
    "$oid": "666b38f200105718d9a4b501"
  },
  "content": "The movie is dramatic, thrilling and gives an insight of a true event that had happened in the past",
  "created_at": {
    "$date": "2024-01-26T16:12:41.686Z"
  },
  "updated_at": {
    "$date": "2024-02-09T22:55:37.473Z"
  },
  "helpful": null,
  "not_helpful": null
},
{
  "_id": {
    "$oid": "666b3fca00105718d9a4b740"
  },
  "movie_id": {
    "$oid": "666b0bcbff071d36d47fa068"
  },
  "user_id": {
    "$oid": "666b38f200105718d9a4b48f"
  },
  "content": "Yep, a quality film.\r\n\r\n<em>'Oppenheimer'</em> lived up to the billing to me. Not that that was ever really in any doubt, with Christopher Nolan at the helm and Cillian Murphy in lead alongside all the acclaim that I have seen this receive since its 2023 release. The near 3hr run time is no problem whatsoever, despite more talk than anything else the film simply doesn't hold any slow/uninteresting moments - 'tis all fascinating.\r\n\r\nEver since I found out about his casting I knew Murphy would deliver a sensational performance and that's exactly what he produces here, which is not even a tiny bit surprising - anyone who has seen television's <em>'<a href=\"https://en.wikipedia.org/wiki/Peaky_Blinders_(TV_series)\" rel=\"nofollow\">Peaky Blinders</a>'</em>, for one, would know that. Loved every single second of him onscreen.\r\n\r\nAs for the rest of the cast, where do you start?! Emily Blunt is impressive, again not a shock as I'm a fan of her from other things - shoutout <em>'<a href=\"https://letterboxd.com/film/the-adjustment-bureau/\" rel=\"nofollow\">The Adjustment Bureau</a>'</em>. Matt Damon stars alongside Blunt in that aforementioned great flick, he himself is very good in this. Robert Downey Jr. shows quality too. All others have much less screentime but do a fair bit with it, for example Jason Clarke and Florence Pugh.\r\n\r\nIt was impossible not to be fully engrossed in this, at least for me. It is not my favourite Nolan movie, <em>'<a href=\"https://letterboxd.com/film/inception/\" rel=\"nofollow\">Inception</a>'</em> and <em>'<a href=\"https://letterboxd.com/film/interstellar/\" rel=\"nofollow\">Interstellar</a>'</em> surpass but to be honest it's the definition of splitting hairs as his films are of such a high standard. For example, <em>'<a href=\"https://letterboxd.com/film/dunkirk-2017/\" rel=\"nofollow\">Dunkirk</a>'</em> and <em>'<a href=\"https://letterboxd.com/film/tenet/\" rel=\"nofollow\">Tenet</a>'</em> move me less but are still ones I rate highly.\r\n\r\nFinal words on this: Watch it if you get the opportunity. One of the big 'uns!",
  "created_at": {
    "$date": "2024-01-30T02:07:35.408Z"
  },
  "updated_at": {
    "$date": "2024-01-30T02:07:35.532Z"
  },
  "helpful": null,
  "not_helpful": null
},
{
  "_id": {
    "$oid": "666b3fca00105718d9a4b741"
  },
  "movie_id": {
    "$oid": "666b0bcbff071d36d47fa068"
  },
  "user_id": {
    "$oid": "666b38f200105718d9a4b504"
  },
  "content": "The problem with biographies is that you have to make sure not to put your own beliefs & present them as facts to white-wash a person/organization.\r\n\r\nOppenheimer was a brilliant scientist indeed but he was also a COMMUNIST (there is a ton of evidence/articles about it and he even admitted liking communist ideas and social values, was a member of communist fronts, subscriber to communist magazines, sent them money monthly, his brother, wife, mistress and believe it or not many of his students were also known communists).\r\n\r\nHe was indeed a security risk and some may go further to say that he committed an act of treason but the film presented a false image of Oppenheimer as the \"mistreated scientist\" who had to endure great injustice for the higher cause of stopping a nuclear arms race.",
  "created_at": {
    "$date": "2024-03-12T22:27:20.334Z"
  },
  "updated_at": {
    "$date": "2024-03-19T16:42:14.098Z"
  },
  "helpful": null,
  "not_helpful": null
},
{
  "_id": {
    "$oid": "666b3fca00105718d9a4b742"
  },
  "movie_id": {
    "$oid": "666b0bcbff071d36d47fa069"
  },
  "user_id": {
    "$oid": "666b38f200105718d9a4b491"
  },
  "content": "I don't know that I've heard Tchaikovsky ever used so menacingly before, but here his \"Swan Lake\" and some deadly pas seul are used to good effect! A group of kidnappers has been assembled by \"Lambert\" (Giancarlo Esposito) to kidnap the daughter of a wealthy man. They are to whisk her away to a remote, quite spooky, manor house where she is to be held hostage til dad stumps up $50m. Thing is, this butter-wouldn't-melt little girl has a secret even bigger than most of the rather disparate gang of folks who used their complementary skills to snatch her. These folks are led by \"Frank\" (Dan Stevens) and it's \"Joey\" (Melissa Barrera) who is left to keep an eye on the young \"Abigail\" (Alisha Weir). Quite quickly we realise that it's not her who is trapped in their web, but vice-versa and what now ensues sees quite a fun series of daft and gruesome encounters as their gang gradually dwindles and they have to fight for their lives! It runs out of steam a bit towards the ending - which seems to happen quite a few times, but a solid cast including the entertaining Kevin Durand and Kathryn Newton, some quickly paced direction and some pithy writing keeps most of this moving along with the diverse range of characters (and intellects) making for quite an enjoyable romp in a sort of \"Cluedo\" with loads of ketchup style. Who knew red onions were so versatile?",
  "created_at": {
    "$date": "2024-04-25T07:07:36.064Z"
  },
  "updated_at": {
    "$date": "2024-04-25T07:11:26.898Z"
  },
  "helpful": null,
  "not_helpful": null
},
{
  "_id": {
    "$oid": "666b3fca00105718d9a4b743"
  },
  "movie_id": {
    "$oid": "666b0bcbff071d36d47fa06a"
  },
  "user_id": {
    "$oid": "666b38f200105718d9a4b507"
  },
  "content": "Today I enjoyed: Damsel.\r\n\r\nDamsel is a Netflix Original, that was released just a few days ago. Starring a strong cast with Millie Bobby Brown, Robin Wright, Angela Bassett and the voice of Shohreh Aghdashloo it follows the odyssey of Elodie. I am not going to spoil the plot for you, but I bet you can foresee most developments, dear reader.\r\n\r\nOverall I have mixed feelings. The story is nothing new, most elements are well known for this kind of movie. Some decisions of characters (including the dragon) feel dumb, and sometimes our main character gets very lucky, so the rest of the plot can happen. The CGI ranges from poor to pretty good, poor more in the begging, with huge landscapes and castles, but later, when the dragon makes an appearance, it looks pretty decent. But I was watching on a rather small screen and Netflix is punishing me with mediocre quality for some time now. So take my visual rating with a grain of salt. Now one thing I will say about the dragon: It has an interesting spin to it. For one thing, half of the time, we do not really see it and only hear Shohreh Aghdashloo's deep, rasping voice, bringing it to life. And when we actually see the dragon, it has a slight horror touch if you will. It looks like a hybrid between your average majestic and broadly loved dragon and something more dark and slimy. A muskrat comes to mind. I liked that (sort of).\r\n\r\nOne remark towards the title: While it is obviously a play the well known 'Damsel in distress' and obviously Elodie fights instead of needing to be rescued, she screams a lot and actually seems in distress half of the film. Until she suddenly becomes the hero and single-handedly fights the dragon. It is a bit much and hard to believe.\r\n\r\nThis is in all honesty an average movie. It is neither terrible nor great. If you are in the mood for some imagery, gold and jewels, dragons, princesses, and a few swords, then go for it. There are worse ways to spend roughly 109 minutes. But there are also better ways.\r\n\r\n_Originally posted on my blog: https://robingierse.de/blog/tie-damsel._",
  "created_at": {
    "$date": "2024-03-09T03:03:52.465Z"
  },
  "updated_at": {
    "$date": "2024-03-09T03:07:54.100Z"
  },
  "helpful": null,
  "not_helpful": null
},
{
  "_id": {
    "$oid": "666b3fca00105718d9a4b744"
  },
  "movie_id": {
    "$oid": "666b0bcbff071d36d47fa06a"
  },
  "user_id": {
    "$oid": "666b38f200105718d9a4b509"
  },
  "content": "Damsel suffers from the same issues that plague movies of this kind, and no, I'm not talking about the \"woke agenda\" or \"muh diversity\". I'm talking about bad writing. Too much reverse \"show, don't tell\" and too many contrived scenes and one-liners.\r\n\r\nThe CGI is good, the costumes and set designs are good, the overall plot is good, but the writing falters often.\r\n\r\nI get that this is a PG-13 movie but teenage viewers aren't this dumb. Give them better writing. Maybe if we treat the younger generation like they have some intelligence, they'll start acting like it.\r\n\r\nThe end result is a movie that wastes its star power and the effort of all involved.\r\n\r\nVAGUE SPOILERS AHEAD:\r\n\r\n1. I get they were trying to do foreshadowing with the opening scene, but it ruined the \"reveal\". The birds were a nice thrilling scene that fell flat by us already being shown the antagonist.\r\n2. The \"V\" hallucination was just too silly. Elodie should have found the _evidance_ and had her own organic \"Tis a lie!\" reaction.\r\n3. It would have been nice to see Elodie wield a sword at some point before they left their kingdom, even if it was just her toting one in her introduction scene \"for wolves\" or some excuse. Take some hints from Brave (2012)'s Merida in the future for crying out loud.\r\n4. Sister's reaction to stepmother's concern felt forced.\r\n5. Stepmother's cut should have been a stab and she should have been in worse shape when she found Elodie. That scene also needed some work to make it less unbelievable. Like perhaps have Elodie make it back to the ship and find stepmother badly injured. Time skips are a thing that happens, y'know?\r\n6. Father's reasons could have been better written. Easily they could've had palace guards shadow him to imply he'd been threatened and then redone his rescue attempt. Why? Because he is never shown to be callous to the needs or feelings of his daughters. Their family being threatened would've made more sense than \"well I thought the sacrifice was worth it for the good of 'OUR' people\". Why they had him say \"my\" is anyone's guess.\r\n7. Less stoic one-liners and less stoic \"No! <*thrusts sword into ground*>\" moments. We've seen it numerous times and it's just utterly boring and contrived at this point.",
  "created_at": {
    "$date": "2024-03-10T05:49:18.350Z"
  },
  "updated_at": {
    "$date": "2024-03-19T16:40:46.574Z"
  },
  "helpful": null,
  "not_helpful": null
},
{
  "_id": {
    "$oid": "666b3fca00105718d9a4b745"
  },
  "movie_id": {
    "$oid": "666b0bcbff071d36d47fa06a"
  },
  "user_id": {
    "$oid": "666b38f200105718d9a4b48d"
  },
  "content": "FULL SPOILER-FREE REVIEW @ https://talkingfilms.net/damsel-review-a-generic-yet-immersive-fantasy-flick/\r\n\r\n\"Damsel attempts to deliver a tale of empowerment and adventure within the rich fantasy genre but finds itself entangled in the ropes of predictability and missed opportunities for deeper narrative innovation.\r\n\r\nDespite its shortcomings, the film shines through its technical prowess, from visually stunning effects to immersive world-building, and is anchored by Millie Bobby Brown’s compelling lead performance.\r\n\r\nWhile it may not redefine its genre or leave an indelible mark on the history of cinema, it’s a pleasant home viewing with moments of genuine charm and resilience.\"\r\n\r\nRating: B-",
  "created_at": {
    "$date": "2024-03-12T15:08:37.951Z"
  },
  "updated_at": {
    "$date": "2024-03-12T15:08:38.073Z"
  },
  "helpful": null,
  "not_helpful": null
},
{
  "_id": {
    "$oid": "666b3fca00105718d9a4b746"
  },
  "movie_id": {
    "$oid": "666b0bcbff071d36d47fa06a"
  },
  "user_id": {
    "$oid": "666b38f200105718d9a4b50c"
  },
  "content": "I totally DISAGREE with the first review by thorian93. Yes, it is a simple storyline. Typical if you must say but it is a story that is NOT complicated and hard to understand. The story is not tangled that you need to connect the dots from past, future and the now kind of movie. It's simple but super. CGI is amazing especially the dragon. Eat your heart out thorian93! This is by far the best movie that I've watched this month of March.",
  "created_at": {
    "$date": "2024-03-12T20:59:22.354Z"
  },
  "updated_at": {
    "$date": "2024-03-19T16:42:17.164Z"
  },
  "helpful": null,
  "not_helpful": null
},
{
  "_id": {
    "$oid": "666b3fca00105718d9a4b747"
  },
  "movie_id": {
    "$oid": "666b0bcbff071d36d47fa06a"
  },
  "user_id": {
    "$oid": "666b38f200105718d9a4b50e"
  },
  "content": "**Movie Review: Damsel (2024)**\r\n\r\n**Plot Overview:**\r\n\"Damsel\" is a fantasy film that subverts the classic 'damsel in distress' trope. Set in a medieval world, it follows Elodie, played by Millie Bobby Brown, who is tricked into a marriage with a prince only to find out she's to be sacrificed to a dragon as part of a centuries-old pact. The film takes a turn from fairy tale to survival as Elodie uses her wit and resources to escape her fate.\r\n\r\n**Themes:**\r\nThe film explores themes of self-reliance, empowerment, and the subversion of traditional gender roles. It challenges the narrative of the passive female character, presenting a heroine who is capable and resourceful.\r\n\r\n**Character Development:**\r\nElodie's character arc is central to the film's impact. She evolves from a young woman resigned to her fate to a fierce survivor, fighting not just for herself but for the future of her people. The supporting characters, including the prince and the queen, add depth to the story, each revealing their own motives and complexities.\r\n\r\n**Director's Style:**\r\nJuan Carlos Fresnadillo directs with a clear vision, blending action with fantasy elements. His use of contrasting settings – from the snowy village to the opulent royal court – adds to the film's visual appeal.\r\n\r\n**Performances:**\r\nMillie Bobby Brown delivers a strong performance, capturing Elodie's transformation convincingly. The supporting cast, including Ray Winstone and Robin Wright, provide solid performances, though Angela Bassett's talent is noted as underused.\r\n\r\n**Technical Aspects:**\r\nThe film boasts impressive production design and costumes, creating a visually stunning medieval world. However, some reviews criticize the CGI as cheap-looking and the action sequences as repetitive.\r\n\r\n**Strengths and Weaknesses:**\r\nStrengths include the film's strong lead performance, innovative plot, and beautiful set pieces. Weaknesses lie in the script and some performances that fail to engage, along with technical aspects that could have been executed better.\r\n\r\n**Recommendation:**\r\n\"Damsel\" is a film that offers a fresh take on the fantasy genre. While it has its flaws, the film's strengths make it worth watching for those interested in a modern twist on classic fairy tales.\r\n\r\nIn conclusion, \"Damsel\" is a bold attempt to redefine a genre steeped in tradition. It's a film that will resonate with audiences looking for strong female leads and a story that champions individual agency over destiny. Despite its shortcomings, \"Damsel\" is a commendable addition to the fantasy genre and is recommended for its unique perspective and engaging storyline.",
  "created_at": {
    "$date": "2024-03-15T16:30:07.192Z"
  },
  "updated_at": {
    "$date": "2024-03-19T16:43:25.623Z"
  },
  "helpful": null,
  "not_helpful": null
},
{
  "_id": {
    "$oid": "666b3fca00105718d9a4b748"
  },
  "movie_id": {
    "$oid": "666b0bcbff071d36d47fa06a"
  },
  "user_id": {
    "$oid": "666b38f200105718d9a4b48f"
  },
  "content": "A disappointment.\r\n\r\n<em>'Damsel'</em> has the right ingredients but unfortunately fails to deliver. Millie Bobby Brown leads the cast in alright fashion, her performance in the lead role is serviceable. She is probably the only positive that I hold for this 2024 film sadly.\r\n\r\nMy main negative is the special effects, which are quite distracting throughout - barely any of it comes across as convincing. The dragon looks OK, but the way it moved sometimes didn't seem right. Speaking of that creature, Shohreh Aghdashloo is a neat piece of casting on paper, though her voice was not the most fitting in actuality. The lighting also felt odd.\r\n\r\nOn the cast, away from Brown, Robin Wright is very meh in her role, while Angela Bassett feels extremely wasted. There is, at least, a nice end credits song from the ace Lykke Li, \"Ring of Fire\" is admittedly incomparable to \"No Rest for the Wicked\" but it is pretty good all the same!",
  "created_at": {
    "$date": "2024-04-06T23:29:45.004Z"
  },
  "updated_at": {
    "$date": "2024-04-06T23:29:45.098Z"
  },
  "helpful": null,
  "not_helpful": null
},
{
  "_id": {
    "$oid": "666b3fca00105718d9a4b749"
  },
  "movie_id": {
    "$oid": "666b0bcbff071d36d47fa06b"
  },
  "user_id": {
    "$oid": "666b38f200105718d9a4b491"
  },
  "content": "The opening bars of \"Pure Imagination\" give us a clue as to what's coming next, and for the most part it's a strong testament to the engaging and charismatic man playing the eponymous chocolatier. He arrives is a town controlled by a chocolate cartel that is determined to use any means possible to ensure he can't fulfil his dream. That dream? Well ever since he was a child, he has wanted to make chocolate as well as his mother (Sally Hawkins). To do that, though, he needs a shop - and without a silver sovereign to his name that's not going to happen. It's winter, so his first order of business is somewhere to sleep. Luckily (?!?) \"Bleacher\" (Tom Davis) finds him on a cold bench and takes him to the welcoming arms of \"Mrs. Scrubbit\" (Olivia Colman) who offers him a bed for the night, though pretty soon he realises it's more of a bed in return for a life of indentured laundry servitude. Still, he's ingenious and he doesn't lose sight of his goal, so together with his fellow inmate \"Noodle\" (Calah Lane) and book-keeper \"Abacus Crunch\" (Jim Carter) they concoct a plan to addict the population to the young man's sweets whilst bringing down the evil trio of truffle terrorisers and ensuring \"Scrubbit\" and \"Bleacher' get their comeuppance too!. Meantime \"Wonka\" has other problem. Someone is pinching his product! An elaborate trap and a large jar introduce us to a tiny \"Oompa-Loompa\" (Hugh Grant) who looks like he's spent way too long on the sun-bed. With his own debt to pay, the two agree an alliance that - well we all know what happens to that. It's a little over-choreographed, I think, and the original songs are not especially memorable, but it doesn't hang about and there's no doubting that Chalamet is enjoying himself, and that's a little bit contagious and we head to a denouement that takes fondue to a ridiculous level... It features a strong and well matched ensemble cast and though maybe a little too long, I did enjoy it.",
  "created_at": {
    "$date": "2023-12-11T11:10:25.698Z"
  },
  "updated_at": {
    "$date": "2023-12-11T11:10:25.818Z"
  },
  "helpful": null,
  "not_helpful": null
},
{
  "_id": {
    "$oid": "666b3fca00105718d9a4b74a"
  },
  "movie_id": {
    "$oid": "666b0bcbff071d36d47fa06b"
  },
  "user_id": {
    "$oid": "666b38f200105718d9a4b48f"
  },
  "content": "Enjoyed this!\r\n\r\n2023's <em>'Wonka'</em> is very good! It's an original story based upon the Roald Dahl novel, so it isn't an adaptation as such like the 1971 and 2005 flicks. With that I didn't find it quite as interesting as what's portrayed in the aforementioned films, but I do appreciate (and prefer, tbh) that they went a different way with it here. And it comes out nicely.\r\n\r\nTimothée Chalamet gives a strong performance in the lead role. Those behind Chalamet are entertaining, from Calah Lane to Keegan-Michael Key to the trio of Paterson Joseph, Matt Lucas and Mathew Baynton - the latter three's dance number for the Chief of Police near the beginning is amusing. The musical elements in general are solid.\r\n\r\nTom Davis and Olivia Colman are fun too. All characters played by those mentioned above after Lane could've easily have been extremely cringey, but thankfully I didn't find that to be the case for any of them at all - very well written, shown and cast in that regard.\r\n\r\nSomeone I have yet to mention is a certain someone as Lofty, an Oompa-Loompa. Hugh Grant is excellent as the orange-skinned, green-haired fellow, even if they did use Grant's best bits in the trailers; which I usually avoid due to those sort of (albeit minor) spoilers, but evidently failed to do so here.\r\n\r\nAll in all, I'd say this is a success. Credit to them for delivering, especially as I was kinda nonplussed by the already noted trailers (Grant aside).",
  "created_at": {
    "$date": "2023-12-13T17:49:55.027Z"
  },
  "updated_at": {
    "$date": "2023-12-13T17:49:55.163Z"
  },
  "helpful": null,
  "not_helpful": null
},
{
  "_id": {
    "$oid": "666b3fca00105718d9a4b74b"
  },
  "movie_id": {
    "$oid": "666b0bcbff071d36d47fa06b"
  },
  "user_id": {
    "$oid": "666b38f200105718d9a4b48d"
  },
  "content": "FULL SPOILER-FREE REVIEW @ https://www.firstshowing.net/2023/review-paul-kings-wonka-musical-is-a-truly-delightful-origin-story/\r\n\r\n\"Wonka offers a fresh perspective on the iconic character while paying homage to Roald Dahl's timeless tale of morality.\r\n\r\nPaul King succeeds in delivering a jolly, entertaining, visually dazzling take on the origins of Willy Wonka, featuring a fearlessly committed cast, tons of humor, and colorful, immersive technical achievements.\r\n\r\nDespite the predictable, formulaic narrative lacking the same creativity of other filmmaking departments, it remains a sweet, harmonious, satisfying viewing experience that should be seen on the big screen.\"\r\n\r\nRating: B+",
  "created_at": {
    "$date": "2023-12-15T16:50:33.850Z"
  },
  "updated_at": {
    "$date": "2023-12-15T16:50:33.956Z"
  },
  "helpful": null,
  "not_helpful": null
},
{
  "_id": {
    "$oid": "666b3fca00105718d9a4b74c"
  },
  "movie_id": {
    "$oid": "666b0bcbff071d36d47fa06b"
  },
  "user_id": {
    "$oid": "666b38f200105718d9a4b514"
  },
  "content": "**A Sweet Delight for All Ages - Wonka Movie Review**\r\nI recently had the pleasure of watching the latest cinematic treat, Wonka, and I must say it's a delightful experience that caters to audiences of all ages. As a busy software engineer with a penchant for quality family time, I couldn't have asked for a better choice for our movie night.\r\n\r\nFrom the moment the film began, it whisked us away on a whimsical journey into the magical world of Wonka's chocolate factory. The visual spectacle and attention to detail were captivating, and I found myself marveling at the creativity on screen. The vibrant colors and imaginative set designs truly brought the beloved story to life.\r\n\r\nWhat sets Wonka apart is its ability to strike a perfect balance between nostalgia for those familiar with the classic tale and a fresh, modern twist that keeps the storyline engaging. The characters are charming, and the casting choices are spot-on. Timothee Chalamet as Wonka brings a new energy to the character, and his performance is both endearing and entertaining.\r\n\r\nI came across this movie at :\r\nhttps://mustwatchmovies.xyz/movie/114901/wonka\r\n\r\nOne aspect that stood out to me, as someone deeply involved in technology, was the seamless integration of CGI and practical effects. The visual effects team did a commendable job, creating a world that felt both magical and believable. The attention to detail, from the intricate machinery in the factory to the playful Oompa Loompas, was truly commendable.\r\n\r\nWonka is not just a feast for the eyes; it also delivers a heartwarming message about the importance of imagination, creativity, and the joy of shared experiences. As someone who manages an affiliate network and values family time, I can confidently recommend this movie for a fun-filled outing with loved ones.\r\n\r\nIn conclusion, Wonka is a cinematic delight that appeals to the child in all of us. Whether you're a parent looking for a wholesome family film or just someone who appreciates a well-crafted story, this movie is a must-see. Grab your tickets, some popcorn, and treat yourself to a heartwarming adventure that will leave you with a sweet taste of nostalgia.",
  "created_at": {
    "$date": "2023-12-21T11:09:34.407Z"
  },
  "updated_at": {
    "$date": "2023-12-22T22:10:13.067Z"
  },
  "helpful": null,
  "not_helpful": null
},
{
  "_id": {
    "$oid": "666b3fca00105718d9a4b74d"
  },
  "movie_id": {
    "$oid": "666b0bcbff071d36d47fa06b"
  },
  "user_id": {
    "$oid": "666b38f200105718d9a4b516"
  },
  "content": "Unfortunately, this movie fails marvelously. It has such incredible potential. The imagined prequel is consistent with Ronald Dahl's charm and wit. Timothee Chalamet’s performance was sensational. The supporting cast including Keegan Michael Keye, Patterson Joseph, Hugh Grant, Olivia Coleman and Jim Carter were all at their best.\r\n\r\nThe film falls short with the casting director's (Nina Gold's) attempt to find new talent in a novice actress named Calah Lane who stars in the movie opposite Timothee Chalamet as the character known as Noodle. The character itself is drawn well but the performance is so dreadful by Lane that it single-handedly destroys what could and should have been a classic prequel to Dahls original masterpiece. Lane throws out all her lines without any emotion and spends no time listening to her supporting cast. The writing becomes meaningless and almost immediately you do not find yourself caring about the Noodle character at all. This becomes quickly distracting to any audience member who has an inclination to invest in the story or other characters in the movie. The film completely dies and falls short on this one performance because the character of Noodle is drawn in such a way that her present and future well-being is central to the strength of the story's momentum.\r\n\r\nOne has to blame the casting director Nina Gold first. Nina Gold's work on projects like Bad Sisters, Game of Thrones and The Crown has been quite exceptional but in terms of finding new talent for this prospective cinema masterpiece just is not consistent with her previous achievements. I would also say that the failure of this film should also fall on Director Paul King's shoulders who also needs to bare the burden of this complete and utter disaster of a decision to put poor Calah Lane in this role and have all of us suffer this miserable performance and ultimately crushing blow to Roald Dahl's reputation as a storyteller and great wit.",
  "created_at": {
    "$date": "2024-01-02T19:31:45.754Z"
  },
  "updated_at": {
    "$date": "2024-01-05T18:55:27.423Z"
  },
  "helpful": null,
  "not_helpful": null
},
{
  "_id": {
    "$oid": "666b3fca00105718d9a4b74e"
  },
  "movie_id": {
    "$oid": "666b0bcbff071d36d47fa06b"
  },
  "user_id": {
    "$oid": "666b38f200105718d9a4b518"
  },
  "content": "After so many years I wonder if the majority of people have seen the original (comedy / musical) movie of 71, that is a classic. I myself was a bit worried when I saw the announce for this one (haven't watchet a single trailer).\r\n\r\nOh how I was wrong - Timothée Chalamet's Willy Wonka is just perfect on how he emulates the original Wonka by Richard Gere plus the musical and dance scenes aren't bad at all. \r\n\r\nTo those who knew the original movie, this gets the start of life of Wonka as a chocolatier, and fill many gaps on the original story - but not all, one being the personality he achieved later and the later relation with the OOmpa Loompa.\r\n\r\nThe movie is just a delight - every little character have its little part and backstory and the story is a family friendly one with all the magic of the original. Even the secondary characters are good choices and all relates in perfect tune. \r\n\r\nTo those who don't know, the character was original from a book \"Charlie and the Chocolate Factory' a 1964 children's novel by Roald Dahl, that had a sequence (a crazy one btw, in 1972). Many politically incorrect terms were already omitted in the 1971 book. \r\n\r\nThe movie gets outside of those, being more a spiritual prequel film for the 71 one, exploring Willy Wonka's origins in 2023. And remembering the 2005 remake of the original by Tim Burton and starring Johnny Depp as Willy Wonka.\r\n\r\nAs a complimentary note, the Dahl's family agreed with Netflix to expand the Wonka universe on a series of animations for the streaming channel.\r\n\r\nThe movie gets a 7.7 out of 10.o for be a B+.",
  "created_at": {
    "$date": "2024-01-23T14:37:12.184Z"
  },
  "updated_at": {
    "$date": "2024-01-23T14:37:12.289Z"
  },
  "helpful": null,
  "not_helpful": null
},
{
  "_id": {
    "$oid": "666b3fca00105718d9a4b74f"
  },
  "movie_id": {
    "$oid": "666b0bcbff071d36d47fa06b"
  },
  "user_id": {
    "$oid": "666b38f200105718d9a4b518"
  },
  "content": "After so many years I wonder if the majority of people have seen the original (comedy / musical) movie of 71, that is a classic. I myself was a bit worried when I saw the announce for this one (haven't watchet a single trailer).\r\n\r\nOh how I was wrong - Timothée Chalamet's Willy Wonka is just perfect on how he emulates the original Wonka by Richard Gere plus the musical and dance scenes aren't bad at all. \r\n\r\nTo those who knew the original movie, this gets the start of life of Wonka as a chocolatier, and fill many gaps on the original story - but not all, one being the personality he achieved later and the later relation with the OOmpa Loompa.\r\n\r\nThe movie is just a delight - every little character have its little part and backstory and the story is a family friendly one with all the magic of the original. Even the secondary characters are good choices and all relates in perfect tune. \r\n\r\nTo those who don't know, the character was original from a book \"Charlie and the Chocolate Factory' a 1964 children's novel by Roald Dahl, that had a sequence (a crazy one btw, in 1972). Many politically incorrect terms were already omitted in the 1971 book. \r\n\r\nThe movie gets outside of those, being more a spiritual prequel film for the 71 one, exploring Willy Wonka's origins in 2023. And remembering the 2005 remake of the original by Tim Burton and starring Johnny Depp as Willy Wonka.\r\n\r\nAs a complimentary note, the Dahl's family agreed with Netflix to expand the Wonka universe on a series of animations for the streaming channel.\r\n\r\nThe movie gets a 7.7 out of 10.o for be a B+.",
  "created_at": {
    "$date": "2024-01-23T14:37:21.761Z"
  },
  "updated_at": {
    "$date": "2024-01-23T14:37:21.862Z"
  },
  "helpful": null,
  "not_helpful": null
},
{
  "_id": {
    "$oid": "666b3fca00105718d9a4b750"
  },
  "movie_id": {
    "$oid": "666b0bcbff071d36d47fa06b"
  },
  "user_id": {
    "$oid": "666b38f200105718d9a4b51b"
  },
  "content": "Timothée Chalamet's subtle but heartfelt performance of a young Wonka helped to offset the depressingly intriguing world of this prequel. Willy is a mysterious and flamboyant character, disconnected from the harshness of reality by the magic of a childhood dream, which matches the subtle facial expressions he uses, per the (stellar) acting direction. The notes of nostalgia and whimsy make this a 10/10!\r\n\r\nThe musical score is something else as well, with sound effects and subtle humor mixed into nearly every song, background or not. The music alone gives this movie re-watch value.",
  "created_at": {
    "$date": "2024-01-27T14:05:31.086Z"
  },
  "updated_at": {
    "$date": "2024-02-09T22:55:31.248Z"
  },
  "helpful": null,
  "not_helpful": null
},
{
  "_id": {
    "$oid": "666b3fca00105718d9a4b751"
  },
  "movie_id": {
    "$oid": "666b0bcbff071d36d47fa06c"
  },
  "user_id": {
    "$oid": "666b38f200105718d9a4b48d"
  },
  "content": "FULL SPOILER-FREE REVIEW @ https://fandomwire.com/the-first-omen-review-a-must-watch/\r\n\r\n\"The First Omen holds many narrative issues and a too-safe ending, but it deserves to be seen on the big screen due to its grotesque practical effects, hauntingly well-built atmosphere, and one of the most impressive, transformative performances of the year by Nell Tiger Free.\r\n\r\nDebutant filmmaker Arkasha Stevenson clearly leaves her mark on a technically sublime film that easily becomes the best installment of the franchise after the original movie.\r\n\r\nLead yourself into temptation and embrace the incarnated evil. You won't regret it.\"\r\n\r\nRating: B-",
  "created_at": {
    "$date": "2024-04-05T14:02:04.999Z"
  },
  "updated_at": {
    "$date": "2024-04-05T14:02:05.095Z"
  },
  "helpful": null,
  "not_helpful": null
},
{
  "_id": {
    "$oid": "666b3fca00105718d9a4b752"
  },
  "movie_id": {
    "$oid": "666b0bcbff071d36d47fa06c"
  },
  "user_id": {
    "$oid": "666b38f200105718d9a4b491"
  },
  "content": "Novice \"Margaret\" (Nell Tiger Free) arrives in Rome to a welcome from her cardinal sponsor \"Lawrence\" (Bill Nighy) where she hopes to complete taking her vows. She is greeted with open arms and taken on a tour of what she hopes will become her new home. This is when she encounters the shy \"Carlita\" (Nicole Sorace) who spends much of her time in solitude drawing. This intrigues \"Margaret\" but not as much as some of the other goings on in the maternity ward of the hospital. Her concerns are only exacerbated by a meeting with \"Fr. Brennan\" (Ralph Ineson) who spins her an horrific yarn that makes her head spin and sets her on a detection task that reveals a conspiracy to end all conspiracies - one that is conceived by the church for it's own perpetuation, but that could bring down both it and mankind. At times it's quite a decently paced watch, this, with a little gruesomeness (isn't it odd that the tools of medicine so often look like those of torture?) but given we have known the denouement since 1976 the lack of any real jeopardy does rather rob the film of much of a sense of menace and what \"jump moments\" there are are all a bit predictable. Free does try to imbue her character with a bit of passion, and she manages along well enough but Nighy is weak and the single appearance from Charles Dance adds nothing at all to these lacklustre proceedings. Prequels are always hard to deliver. This tries, but sadly we've seen it all before and I fear the nun theme is beginning to self-flagellate itself to death. A short story over-stretched.",
  "created_at": {
    "$date": "2024-04-10T13:41:10.201Z"
  },
  "updated_at": {
    "$date": "2024-04-10T13:41:10.326Z"
  },
  "helpful": null,
  "not_helpful": null
},
{
  "_id": {
    "$oid": "666b3fca00105718d9a4b753"
  },
  "movie_id": {
    "$oid": "666b0bcbff071d36d47fa06d"
  },
  "user_id": {
    "$oid": "666b38f200105718d9a4b491"
  },
  "content": "Anyone remember an half-naked Tom Payne getting pulled into a barrel of hookers by Stellan Skarsgård in \"the Physician\" (2013)? That vision might just have forgiven this film had he featured a bit more, but clearly he had read the derivative script and decided it only merited one filming day - hence he hardly features at all. What does feature is the usual dysfunctional family malarkey with him newly married to the well-meaning animator \"Jessica\" (DeWanda Wise) who is trying to stay on friendly terms with his two daughters - the teenage \"Taylor\" (Taegen Burns) and the younger \"Alice\" (Pyper Braun). The family decide to move into her father's house - he is now in a care home - and quickly the youngest discovers a bear. Yep - a teddy bear. What can go wrong? Well it isn't a very nice bear, indeed it's distinctly malevolent and is soon trying to lure all of them (except Tom who has fled the proceedings by now) into a parallel reality with lots of rooms containing lots of scenarios. Some benign, so less so. Poor old \"Jess\" is soon at her wits end but fortunately neighbour \"Gloria\" (Betty Buckley) is on hand with some pearls of wisdom that might help them through this rapidly menacing quagmire! Or will they? This film plays out exactly as you would expect. There isn't an original bone in it's body, the acting is mediocre at best - but wait, it's nowhere near as banal as the extracts from the Janet & John book of horror film writing. Some of the dialogue here really does have you staring at the cinema ceiling in disbelief. It's another standard Blumhouse offering that passes the time without you having to engage your brain in the slightest - in fact, you could just watch the last ten minutes and miss very little from the rest of it.",
  "created_at": {
    "$date": "2024-03-13T14:16:44.512Z"
  },
  "updated_at": {
    "$date": "2024-03-13T14:19:07.373Z"
  },
  "helpful": null,
  "not_helpful": null
},
{
  "_id": {
    "$oid": "666b3fca00105718d9a4b754"
  },
  "movie_id": {
    "$oid": "666b0bcbff071d36d47fa06d"
  },
  "user_id": {
    "$oid": "666b38f200105718d9a4b48f"
  },
  "content": "Pyper Braun merits praise, <em>'Imaginary'</em> otherwise falls flat.\r\n\r\nI was never locked into the story and I didn't really care for the characters at any point, even Braun's Alice isn't all that interesting despite a rather great performance from the young actress. DeWanda Wise is a bit dull, while Tom Payne disappoints somewhat - I mean he only has a small role, sure, but his acting is unconvincing... and I know he can actor far better, as seen during his time on TV's <em>'<a href=\"https://en.wikipedia.org/wiki/The_Walking_Dead_(TV_series)\" rel=\"nofollow\">The Walking Dead</a>'</em>.\r\n\r\nThe antagonists in this are poorly utilized, the poster bear is prevalent but very boring. It needed a Chucky-esque portrayal, rather than the blank stare we get every few minutes. The ending also drags, I thought it was going to end sooner a few times but it kept finding new ways to stick around; nothing majorly grating, granted. The score is at least OK.\r\n\r\nIt also, amusingly, took me ages to work out what the bear's name was. I'm not familiar with the name \"Chauncey\", so genuinely for the longest time thought the name was either \"John C\" or \"Shaun C\". It was only when I finally noticed it written down visually that I realised! 😂\r\n\r\nIn conclusion, credit to Braun but everyone else onscreen and off it could've done better in my opinion.",
  "created_at": {
    "$date": "2024-03-14T23:45:33.156Z"
  },
  "updated_at": {
    "$date": "2024-03-14T23:45:33.256Z"
  },
  "helpful": null,
  "not_helpful": null
},
{
  "_id": {
    "$oid": "666b3fca00105718d9a4b755"
  },
  "movie_id": {
    "$oid": "666b0bcbff071d36d47fa070"
  },
  "user_id": {
    "$oid": "666b38f200105718d9a4b48d"
  },
  "content": "FULL SPOILER-FREE REVIEW @ https://talkingfilms.net/argylle-review-a-delightful-surprise-of-campy-entertainment/\r\n\r\n\"Argylle emerges as a (very) pleasant surprise this new year, blending absurdity with sophistication to create a truly memorable cinematic experience.\r\n\r\nMatthew Vaughn's vision, combined with Jason Fuchs' sharp, clever screenplay, provides an entertainment rollercoaster ride that obliterates initial expectations. From unexpected twists and turns to the incredibly charismatic cast, not to mention a third act filled with hilariously unforgettable action set pieces, the complex-made-simple spy story captivates the audience with its campy charm and relentless energy.\r\n\r\nIt's my first big recommendation of 2024, one you can't afford to miss in theaters!\"\r\n\r\nRating: A-",
  "created_at": {
    "$date": "2024-01-31T17:01:02.175Z"
  },
  "updated_at": {
    "$date": "2024-01-31T17:01:02.281Z"
  },
  "helpful": null,
  "not_helpful": null
},
{
  "_id": {
    "$oid": "666b3fca00105718d9a4b756"
  },
  "movie_id": {
    "$oid": "666b0bcbff071d36d47fa070"
  },
  "user_id": {
    "$oid": "666b38f200105718d9a4b491"
  },
  "content": "\"Elly Conway\" (Bryce Dallas Howard) lives in her remote lakeside home writing spy novels that are going down a storm. Her conclusion to the fifth in the series about the eponymous, \"007\"-style agent perplexes her mother, though. What happens next? Well wait til book six would seem to be the obvious answer, but mom (Catherine O'Hara) insists so \"Elly\" decides to take train to visit her parents - and that's mistake number one. Onboard she encounters a rather scruffy looking chap \"Wilde\" (Sam Rockwell) who is reading one of her books. She tries to hide her identity, but when he gets to the fly-leaf then her secret is out. That's soon the least of her worries as she and travelling cat \"Alfie\" are soon caught up in something straight out of one of her books! She can't fathom why she'd conceivably be the target for any nasty people, but her new found friend soon convinces her that there is someone she has to meet - and pretty quickly she's embroiled in an whole new world of mystery, intrigue and danger! It's a bit of a slow start this film, with a slightly annoying flicking between her real life and those of her characterisations (that's where the \"Action Man\" style of the sparingly used Henry Cavill appears) but once we establish who is who and what's going on, we are straight into \"Man from U.N.C.L.E.\" territory with loads of rapid-fire escapades that though hardly original, do have some fun twists and turns as we progress to a denouement that is derivative, but still quite enjoyable to watch. The initial concept is quite original and though the execution largely an amalgam of other Matthew Vaughn features, it still works quite well even if it is far too long, with Rockwell clearly having some fun here and the cat remaining largely contained in it's capsule throughout!",
  "created_at": {
    "$date": "2024-02-02T11:22:32.146Z"
  },
  "updated_at": {
    "$date": "2024-02-02T11:22:32.241Z"
  },
  "helpful": null,
  "not_helpful": null
},
{
  "_id": {
    "$oid": "666b3fca00105718d9a4b757"
  },
  "movie_id": {
    "$oid": "666b0bcbff071d36d47fa070"
  },
  "user_id": {
    "$oid": "666b38f200105718d9a4b4b1"
  },
  "content": "It’s disappointing when a film has an intriguing premise but fails to deliver the goods in the end. Such is the case with director Matthew Vaughn’s latest, an action-adventure/comedy about an author of spy novels (Bryce Dallas Howard) who stumbles into a real-life espionage scenario that matches the plot of her latest novel, embroiling her in a web of ever-shifting intrigue with various nefarious parties. The problem here is that the film never quite latches onto a dedicated focus to make the picture work. Some of the comic bits are indeed quite funny, but they frequently get bogged down by a meandering story line that’s trying to follow a more conventional, twist-laden thriller format. It leaves viewers asking, “So what’s it going to be?” There’s also more than a little derivative material thrown in, such as story threads we’ve already seen before in movies like “Romancing the Stone” (1984), “The Long Kiss Goodnight” (1996) and any number of James Bond flicks. While it’s true that this release is intended to be a spoof of these titles (especially in scenes featuring Henry Cavill as a hilariously hammy 007 knock-off), there’s a big difference between paying tribute and playing unrepentant copycat. Then there’s the picture’s excessive length, coming in at a bloated 2:19:00 runtime, far longer than it needs to be, a failing attributable to an often-needlessly complicated plot, one that begins to try audience patience at times, especially in the back half. “Argylle” also features a cute, cuddly cat, Alfie, as a central character (at least in its trailer), but, like the narrative overall, the film doesn’t quite seem to know what to do with the supposedly frisky, fickle feline, an impression far different from what’s conveyed in the picture’s video marketing. All of this is a shame, because this title has both potential and some apparent strengths going for it, such as a fine soundtrack, superbly choreographed action sequences, and an excellent ensemble cast with the likes of Sam Rockwell, Bryan Cranston, Catherine O’Hara, Ariana DeBose, and a seriously underused Richard E. Grant, not to mention fine turns from Howard and Cavill as alter-egos of one another. This one isn’t nearly as bad as many critics have made it out to be, but it could have been substantially better with some significant retooling and judicious editing. “Argylle” apparently has ambitions to become a new franchise, too, but we’ll have to see if that materializes based on what kind of box office draw it ultimately produces. At this point, though, I think it has its work cut out for it.",
  "created_at": {
    "$date": "2024-02-04T02:30:50.637Z"
  },
  "updated_at": {
    "$date": "2024-02-04T02:30:50.754Z"
  },
  "helpful": null,
  "not_helpful": null
},
{
  "_id": {
    "$oid": "666b3fca00105718d9a4b758"
  },
  "movie_id": {
    "$oid": "666b0bcbff071d36d47fa070"
  },
  "user_id": {
    "$oid": "666b38f200105718d9a4b4a2"
  },
  "content": "_Argylle_ is an action thriller that willingly wallows in goofy, cringey nonsense. Its writing is immature, and its action is overloaded with sloppy CGI and outrageous concepts that are preposterously frustrating.\r\n\r\n**Full review:** https://bit.ly/arghspy",
  "created_at": {
    "$date": "2024-02-06T01:50:32.925Z"
  },
  "updated_at": {
    "$date": "2024-02-06T01:50:33.015Z"
  },
  "helpful": null,
  "not_helpful": null
},
{
  "_id": {
    "$oid": "666b3fca00105718d9a4b759"
  },
  "movie_id": {
    "$oid": "666b0bcbff071d36d47fa070"
  },
  "user_id": {
    "$oid": "666b38f200105718d9a4b48f"
  },
  "content": "Such a peculiar film. Everything about it feels off.\r\n\r\nI was initially a little unsure as to what I thought about <em>'Argylle'</em>, but in the end: it's a no from me. I couldn't actually tell you one thing that I properly liked about this, like at a push Sam Rockwell and Bryan Cranston are decent but even they get a bit hit-and-miss. There's just a constant tinge of lousiness that follows around throughout.\r\n\r\nBryce Dallas Howard feels miscast, even if she is fairly likeable. Henry Cavill is wooden (intentionally? doubtful), as is Dua Lipa but the musician has enough charm to make it work slightly. Speaking of music, all that is used here is alright but again feels off - mostly seems like the correct type of song, just the wrong exact choice of song... \"Electric Energy\" might grow on me, though.\r\n\r\nWhat also doesn't help is the unavoidable feeling that it is a bad redo of <em>'<a href=\"https://letterboxd.com/films/in/kingsman-collection/by/release-earliest/size/large/\" rel=\"nofollow\">Kingsman</a>'</em>, which is expected given who directed this and all that they are planning with the two flicks behind the scenes. I'm all for a shared universe, though this is perhaps too on the nose. There are also <em>'<a href=\"https://letterboxd.com/film/the-lost-city-2022/\" rel=\"nofollow\">The Lost City</a>'</em> (itself echoing <em>'<a href=\"https://letterboxd.com/film/nims-island/\" rel=\"nofollow\">Nim's Island</a>'</em>) vibes sprinkled in too. Another negative is the special effects, especially at the start... less said, the better.\r\n\r\nOverall, I think it all boils down to being a poor film - unfortunately, as I kinda wanted to like it but simply couldn't. Actually, it's just come to me, I just remembered a scene I actually did truly enjoy: the one with Leona Lewis' \"Run\" track. That was actually entertaining.",
  "created_at": {
    "$date": "2024-02-22T23:43:31.275Z"
  },
  "updated_at": {
    "$date": "2024-02-22T23:43:31.419Z"
  },
  "helpful": null,
  "not_helpful": null
},
{
  "_id": {
    "$oid": "666b3fca00105718d9a4b75a"
  },
  "movie_id": {
    "$oid": "666b0bcbff071d36d47fa070"
  },
  "user_id": {
    "$oid": "666b38f200105718d9a4b526"
  },
  "content": "What a disappointment. It tried to be a little Long Kiss Goodnight, Bullet Train, Bugs Bunny and James Bond. The CGI is horribly bad. Love Dallas in most things but in this she was fine as the author character but so unbelievable as the action spectacular spy. Sam Rockwell was great, as usual and the rest did a serviceable job but the story was horribly executed. The colorful, smoke bomb, ballet gunfire gauntlet scene was absurd. And what's with the repetitive use of the new Beatles tune? Didn't fit and slowed the action down. And the use of Henry Cavill and John Cena was confusing, silly and not needed. Promising beginning that crashed and burned. ",
  "created_at": {
    "$date": "2024-03-11T18:32:44.235Z"
  },
  "updated_at": {
    "$date": "2024-03-19T16:42:48.589Z"
  },
  "helpful": null,
  "not_helpful": null
},
{
  "_id": {
    "$oid": "666b3fca00105718d9a4b75b"
  },
  "movie_id": {
    "$oid": "666b0bcbff071d36d47fa070"
  },
  "user_id": {
    "$oid": "666b38f200105718d9a4b49d"
  },
  "content": "Cringe worthy nonsense, loaded down with puerile premise after puerile premise, predictable, done to death action and irritating characterisations. \r\n\r\nI managed about half of this before walking away. The US entertainment industry really is a bit of a bad joke these days.",
  "created_at": {
    "$date": "2024-03-14T02:46:41.042Z"
  },
  "updated_at": {
    "$date": "2024-03-15T02:06:47.446Z"
  },
  "helpful": null,
  "not_helpful": null
},
{
  "_id": {
    "$oid": "666b3fca00105718d9a4b75c"
  },
  "movie_id": {
    "$oid": "666b0bcbff071d36d47fa070"
  },
  "user_id": {
    "$oid": "666b38f200105718d9a4b529"
  },
  "content": "Woof. I think they were going for fun quirky spy thriller, but it's just bad. And not bad in a way that is entertaining. All the characters and all the premises are just so stupid, and it looks so bad it's distracting, and it's boring on top of it all.",
  "created_at": {
    "$date": "2024-03-24T20:50:13.711Z"
  },
  "updated_at": {
    "$date": "2024-04-08T16:15:09.467Z"
  },
  "helpful": null,
  "not_helpful": null
},
{
  "_id": {
    "$oid": "666b3fca00105718d9a4b75d"
  },
  "movie_id": {
    "$oid": "666b0bcbff071d36d47fa072"
  },
  "user_id": {
    "$oid": "666b38f200105718d9a4b491"
  },
  "content": "Despite myself, I actually quite enjoyed this. After (what looked like) a platonic one night stand, \"Bea\" (Sydney Sweeney) and \"Ben\" (Glen Powell) manage to part company loathing one another. Serendipity has no intention of allowing this to be the end of things though, and so arranges for her sister to marry one of his best friends. After a few uncomfortable meetings in a bar, they all head off to Australia for the nuptials. Her parents are very keen to get her back with ex \"Jonathan\" (Darren Barnet) whilst his ex \"Margaret\" (Charlee Fraser) is also there. Against their better judgment our two decide to pretend to be a couple to provoke envy from one and protect the other from the intent of the meddling parents. What now ensues does really depend on a plausible degree of chemistry between Sweeney and Powell and I thought they did quite well. A little bit more meddling from Bryan Brown, some Di Caprio-esque action at the front of a yacht and some kindly support from the Sydney harbour rescue helicopter helps keep this amiably jogging along for an admittedly twenty minutes too long 1¾ hours. It's quite pithily written and manages to avoid the worst in both American and Australian stereotypes. It also isn't shy of sex, comic nudity and a bit of practical adult humour that makes a change from the usual puerile smut we are so frequently offered nowadays. It's entirely forgettable, but is an enjoyable enough dollop of sun, sea, sex and silliness.",
  "created_at": {
    "$date": "2023-12-30T11:07:00.167Z"
  },
  "updated_at": {
    "$date": "2023-12-30T13:04:08.487Z"
  },
  "helpful": null,
  "not_helpful": null
},
{
  "_id": {
    "$oid": "666b3fca00105718d9a4b75e"
  },
  "movie_id": {
    "$oid": "666b0bcbff071d36d47fa072"
  },
  "user_id": {
    "$oid": "666b38f200105718d9a4b48f"
  },
  "content": "Imperfect, though <em>'Anyone But You'</em> does deliver amusing moments and works nicely as a romcom.\r\n\r\nIt usually isn't the best sign when the end credits are a film's best bit, which is the case here (s/o Natasha Bedingfield!), though thankfully that statement is only an additional positive for this Will Gluck directed movie. It does do clichés, but does at least add some freshness to the genre.\r\n\r\nSydney Sweeney and Glen Powell portray great chemistry, I enjoyed both performances. Sweeney's stylist killed it I gotta say, heck even Powell's too. Some of their, and others', dialogue is too manufactured  at times, but that be just a minor complaint to be honest. The rest of those onscreen are satisfactory. I must say the director's father, Peter Gluck, gave me one of the film's stronger chuckles in his tiny role on the plane sat next to Sweeney - perfect line delivery!\r\n\r\nI had fun with this. As already noted, it isn't anything all that standout but it delivered what I evidently wanted. Solid. The William Shakespeare stuff was a bit forced, mind you.",
  "created_at": {
    "$date": "2024-01-26T18:23:41.707Z"
  },
  "updated_at": {
    "$date": "2024-01-26T18:23:41.822Z"
  },
  "helpful": null,
  "not_helpful": null
},
{
  "_id": {
    "$oid": "666b3fca00105718d9a4b75f"
  },
  "movie_id": {
    "$oid": "666b0bcbff071d36d47fa073"
  },
  "user_id": {
    "$oid": "666b38f200105718d9a4b48d"
  },
  "content": "MORE SPOILER-FREE MINI-REVIEWS @ https://www.msbreviews.com/movie-reviews/mini-reviews-2023-edition\r\n\r\n\"Fast X surprisingly pulls me back into a saga I had practically given up on. Jason Momoa is, by far, the MVP of the whole film, transforming an easily forgettable villain into a truly hilarious explosion of charm and *camp*. The cast still holds that enviable chemistry, even though Daniela Melchior and Portugal deserved more screen time.\r\n\r\nConsidering the previous entries, the energetic action actually turns out to be quite tolerable when it comes to the expected illogical insanity of the franchise - which will please viewers with less patience for absurdity. Despite an overuse of false backdrops and extremely agitated editing, the entertainment levels are well within the acceptable spectrum.\r\n\r\nIt's clearly the first film in a final trilogy. Interpret this last sentence as you wish.\"\r\n\r\nRating: B-",
  "created_at": {
    "$date": "2023-05-18T08:13:12.147Z"
  },
  "updated_at": {
    "$date": "2023-05-18T08:13:12.255Z"
  },
  "helpful": null,
  "not_helpful": null
},
{
  "_id": {
    "$oid": "666b3fca00105718d9a4b760"
  },
  "movie_id": {
    "$oid": "666b0bcbff071d36d47fa073"
  },
  "user_id": {
    "$oid": "666b38f200105718d9a4b52e"
  },
  "content": "A vacous and imbecile action potboiler which does what it's meant to do, \"Entertain\".\r\n\r\nFast X is a noisy actioner which pushes the limits of inventive action set pieces but this time stays grounded compared to the space shit they tried last time. As a franchise, fast and furious has always been extremely self aware of what it intends to present , over the top, adrenaline pumping , never seen before action and Fast X delivers in that front yet again. The sheer amount of scale and production value gone into this makes this an insane film. While it entertains us throughout because of its action, having an engaging and appealing premise has always been the weakest aspect of this franchise. The story is yet again dumb and feels like an Indian tv soap where no one dies and pops up again and again. \r\n\r\nThe cast rather than balancing the count keeps getting bigger with each iteration. The best thing the makers have done this time is to integrate Jason Mamoa as Dante and he is maniacal and psychotic. Probably the best villain in the franchise until now. He brings in the much needed wackyness to the film. Alan Ritchson joins the cast and he is brilliant. While rest of the cast remains same and their chemistry adds the elements of humour , Brie Larson's entry doesn't make any sense. Let's hope she springs in a surprise in the next 2 films. The film finishes on a cliffhanger and promises more madness in the next. However dumb it may be, the franchise will be remembered as the one which defies physics in the most realistic way possible.\r\n\r\nOverall, if you are a fast and furious fan there's no one stopping you, but if you are not then you are missing the out on the most badass franchise coming to a close. I recommend keep your brains at home and go have a blast.\r\n\r\nInstagram @streamgenx",
  "created_at": {
    "$date": "2023-05-19T04:04:52.963Z"
  },
  "updated_at": {
    "$date": "2023-05-19T04:04:53.053Z"
  },
  "helpful": null,
  "not_helpful": null
},
{
  "_id": {
    "$oid": "666b3fca00105718d9a4b761"
  },
  "movie_id": {
    "$oid": "666b0bcbff071d36d47fa073"
  },
  "user_id": {
    "$oid": "666b38f200105718d9a4b530"
  },
  "content": "Great movie",
  "created_at": {
    "$date": "2023-05-21T10:13:12.913Z"
  },
  "updated_at": {
    "$date": "2023-05-30T14:24:10.517Z"
  },
  "helpful": null,
  "not_helpful": null
},
{
  "_id": {
    "$oid": "666b3fca00105718d9a4b762"
  },
  "movie_id": {
    "$oid": "666b0bcbff071d36d47fa073"
  },
  "user_id": {
    "$oid": "666b38f200105718d9a4b491"
  },
  "content": "Starting off with a bit of nostalgia, this high-octane adventure sees just how \"Dom\" (Vin Diesel) et al become the targets of \"Dante\" (Jason Momoa). The most improbable of robberies from a police station followed by an even less plausible chase through the streets of Rio dragging a ten ton safe behind their cars! Now I was thinking, this is going to be rubbish. Well, it isn't actually. Though it is pretty repetitive and the story is rather episodic in delivery, it's still got just enough of a story to underpin the collection of lively set-piece car chases that trash just about every city in the world - especially Rome. The camp but deadly Momoa looks like he is having an whale of a time with his role and though the \"family\" sentiment of the whole thing starts to grate after a while, the production is high standard, the pace is relentless and the visual effects are put to good use for most of it. The rest of the cast deliver adequately enough - I could have been doing with a bit more from \"Cipher\" (Charlize Theron) and a lot less from the double act of \"Tej\" (Ludacris) and \"Roman\" (Tyrese Gibson) that got on my nerves a bit after a while. From a plot perspective, it's an introductory offer - they are setting the scene for the next one (or two) that will doubtlessly be a spectacular denouement, tinged with tragedy, that probably only leaves Nepal as a country untouched by their wrecking! It's harmless fun. It won't challenge you one little bit, the acting and writing are largely forgettable and it will slot into the library of the rest of this franchise easily enough. If you don't know what you are going to get from the series by now, then you ought not to bother.",
  "created_at": {
    "$date": "2023-05-22T09:20:59.008Z"
  },
  "updated_at": {
    "$date": "2023-05-22T09:23:10.069Z"
  },
  "helpful": null,
  "not_helpful": null
},
{
  "_id": {
    "$oid": "666b3fca00105718d9a4b763"
  },
  "movie_id": {
    "$oid": "666b0bcbff071d36d47fa073"
  },
  "user_id": {
    "$oid": "666b38f200105718d9a4b49d"
  },
  "content": "The very definition of moronic. \r\n\r\nLoud, obnoxious, cheesy characterisations, idiotic back story  and enough bling to make you wince.  \r\n\r\nThe only vaguely redeeming quality is the polish and money spent on the over the top, at times novel, action scenes but that's not really saying much, in the wider context of awfulness, this represents.\r\n\r\nI'm not sure who the demographic for this flick is? I would have thought people were more evolved, as a species but well.....\r\n\r\nIn summary, just dumb, that's really all needs be said.....",
  "created_at": {
    "$date": "2023-06-01T22:53:16.005Z"
  },
  "updated_at": {
    "$date": "2023-06-06T21:03:24.199Z"
  },
  "helpful": null,
  "not_helpful": null
},
{
  "_id": {
    "$oid": "666b3fca00105718d9a4b764"
  },
  "movie_id": {
    "$oid": "666b0bcbff071d36d47fa073"
  },
  "user_id": {
    "$oid": "666b38f200105718d9a4b48f"
  },
  "content": "I can always rely on this franchise to give me what I desire from it.\r\n\r\n<em>'Fast X'</em> is a great time. I adore the whole series and have done so since watching the opening entry of it as a teen, sure it has changed tremendously since those halcyonic days of 2001 (OK, I was like 5 then...) but my fondness and enjoyment of these films remains unchanged - quality entertainment!\r\n\r\nI love the main cast, particularly those we've had since the beginning or thereabouts - from Vin Diesel and Michelle Rodriguez to Tyrese Gibson and Ludacris (I'm gonna need a spin-off with those two if you're reading, Universal!) to Sung Kang and Jordana Brewster (want more of the latter, but I get it's tricky with the absence of Paul Walker; who is still missed). I'll never tire (tyre?) of watching them together.\r\n\r\nAway from those guys, the recurrence of the likes of Charlize Theron, John Cena and Nathalie Emmanuel is pleasant and the additions of Brie Larson and Jason Momoa are highly welcomed. I wasn't sure if Momoa was a bit too over the top in parts, but all in all he makes for a memorable antagonist - he certainly commits to the role!\r\n\r\nThe action continues to be absolutely bonkers and I continue to be absolutely onboard with everything and anything that is portrayed onscreen. The look of the film, the sound of the film... I dig it all to be honest. It's loud as heck, but that's exactly what I'd want from a <em>'Fast & Furious'</em> flick. A film worth the admission fee, as usual.\r\n\r\nBring on <em>'Fast XI'</em> or whatever they decide to call it. Apparently we're still getting another one after that, which I personally hope has its own sequel, which in turn has its sequel, followed by another seque... you get my point. I wanna be 105 and sat in the cinema watching another one of these.😂",
  "created_at": {
    "$date": "2023-06-08T18:22:02.617Z"
  },
  "updated_at": {
    "$date": "2023-06-08T18:22:02.701Z"
  },
  "helpful": null,
  "not_helpful": null
},
{
  "_id": {
    "$oid": "666b3fca00105718d9a4b765"
  },
  "movie_id": {
    "$oid": "666b0bcbff071d36d47fa073"
  },
  "user_id": {
    "$oid": "666b38f200105718d9a4b48f"
  },
  "content": "I can always rely on this franchise to give me what I desire from it.\r\n\r\n<em>'Fast X'</em> is a great time. I adore the whole series and have done so since watching the opening entry of it as a teen, sure it has changed tremendously since those halcyonic days of 2001 (OK, I was like 5 then...) but my fondness and enjoyment of these films remains unchanged - quality entertainment!\r\n\r\nI love the main cast, particularly those we've had since the beginning or thereabouts - from Vin Diesel and Michelle Rodriguez to Tyrese Gibson and Ludacris (I'm gonna need a spin-off with those two if you're reading, Universal!) to Sung Kang and Jordana Brewster (want more of the latter, but I get it's tricky with the absence of Paul Walker; who is still missed). I'll never tire (tyre?) of watching them together.\r\n\r\nAway from those guys, the recurrence of the likes of Charlize Theron, John Cena and Nathalie Emmanuel is pleasant and the additions of Brie Larson and Jason Momoa are highly welcomed. I wasn't sure if Momoa was a bit too over the top in parts, but all in all he makes for a memorable antagonist - he certainly commits to the role!\r\n\r\nThe action continues to be absolutely bonkers and I continue to be absolutely onboard with everything and anything that is portrayed onscreen. The look of the film, the sound of the film... I dig it all to be honest. It's loud as heck, but that's exactly what I'd want from a <em>'Fast & Furious'</em> flick. A film worth the admission fee, as usual.\r\n\r\nBring on <em>'Fast XI'</em> or whatever they decide to call it. Apparently we're still getting another one after that, which I personally hope has its own sequel, which in turn has its sequel, followed by another seque... you get my point. I wanna be 105 and sat in the cinema watching another one of these.😂",
  "created_at": {
    "$date": "2023-06-08T18:22:02.871Z"
  },
  "updated_at": {
    "$date": "2023-06-08T18:22:02.953Z"
  },
  "helpful": null,
  "not_helpful": null
},
{
  "_id": {
    "$oid": "666b3fca00105718d9a4b766"
  },
  "movie_id": {
    "$oid": "666b0bcbff071d36d47fa073"
  },
  "user_id": {
    "$oid": "666b38f200105718d9a4b4f7"
  },
  "content": "Even for a Fast and Furious film, this is a total price of crap. You'll hate yourself for watching it.",
  "created_at": {
    "$date": "2023-07-18T11:59:41.682Z"
  },
  "updated_at": {
    "$date": "2023-07-20T18:05:38.163Z"
  },
  "helpful": null,
  "not_helpful": null
},
{
  "_id": {
    "$oid": "666b3fca00105718d9a4b767"
  },
  "movie_id": {
    "$oid": "666b0bcbff071d36d47fa073"
  },
  "user_id": {
    "$oid": "666b38f200105718d9a4b4ee"
  },
  "content": "Writing a review for a sequel like “Fast X” feels pretty pointless. It’s the type of adrenaline-fueled blockbuster that rabid fans will eagerly shell out money to see and want to love, while snobby critics will begrudgingly watch with a chip on their shoulder combined with a predetermined disdain for whatever will unfold. I’m a big fan of the series, even when it veered away from fast cars and leaned into the street superhero action angle. Most moviegoers would expect “Fast X” to be a film that’s packed with big, loud, dumb fun. It’s big and loud (and certainly dumb), but there admittedly is a slight shortage of fun.\r\n\r\nThe plot is so stupid, but it builds on the best film of the franchise, “Fast Five.” If you don’t remember the movie, don’t worry: the first 15 minutes are a rehash of everything that happened. Even newbies will be up to speed quickly. The film focuses on Dante (Jason Momoa), a formidable foe who is fueled by revenge. He’s ready for blood, and Dominic Toretto (Vin Diesel) and his “family” are squarely in his sights. This installment takes the crew from Rome to Rio de Janeiro and beyond, with explosions, car chases, fist fights, and lots of faces from the past.\r\n\r\nThe story isn’t what most came for anyway, and the pacing slows under the weight of Diesel growling about “family” and “faith.” The jokes aren’t really funny either, and Louis Leterrier‘s direction is lacking. The threadbare writing is awful. The CGI looks shoddy. The situations our heroes are put in are so far-fetched and ridiculous that it makes Tej (Ludacris) and Roman’s (Tyrese Gibson) trip into space in “F9” seem like no big deal. In other words, there is a lot to dislike about this movie — but there’s also plenty to enjoy.\r\n\r\nThe stunt driving is absolutely spectacular, as are the majority of the action sequences. For every misstep, there’s an equally thrilling chase (like a bomb tearing through the streets of Rome). The cast mostly gives performances that are better than expected. The real MVP here is Momoa, who creates a truly terrifying character in Dante, a big screen villain for the ages. Obviously having fun with the role, Momoa completely steals and runs away with the movie. He is absolutely terrific.\r\n\r\nThe film is packed with all the fan favorite characters and a few new added for good measure (although Brie Larson as a CIA agent and Leo Abelo Perry as Dom’s son don’t bring that much to the table). Diehards will be pleased to see Letty (Michelle Rodriguez), Mia (Jordana Brewster), Ramsey (Nathalie Emmanuel), Jakob (John Cena), Han (Sung Kang), Queenie (Helen Mirren), and baddies Shaw (Jason Statham) and Cipher (Charlize Theron).\r\n\r\nAlthough I’m a fan of all things “Fast and Furious,” it’s becoming increasingly difficult to overlook the fact that each film seems to become even more dependent on over-the-top silliness. “Fast X” feels like it’s headed toward the end of the road, a dead end from which the series will never return. But if you’re searching for a bit of mindless entertainment, it’s also a great way to kick off the start of the summer movie season.",
  "created_at": {
    "$date": "2023-08-04T07:09:18.478Z"
  },
  "updated_at": {
    "$date": "2023-08-04T07:09:18.525Z"
  },
  "helpful": null,
  "not_helpful": null
},
{
  "_id": {
    "$oid": "666b3fca00105718d9a4b768"
  },
  "movie_id": {
    "$oid": "666b0bcbff071d36d47fa073"
  },
  "user_id": {
    "$oid": "666b38f200105718d9a4b4ce"
  },
  "content": "I've more or less enjoyed the Fast and the Furious franchise though with each installment, the writers attempt to go further in its goofiness from the previous movie, it's becoming harder and harder to really be entertained, not to mention care one iota about these characters. I will say Jason Momoa, in whatever he was doing, was a hoot in the cold-blooded villain. And in typical \"Fast\" fashion, there are scenes that don't make a lick of sense. I found some of the action scenes to be well directed I guess by journeyman Louis Leterrier who took over from Justin Lin who left only a week into production.\r\n\r\nGiven I wasn't that big of a fan of Fate of the Furious or F9, I think I've grown out of this franchise and would be a good thing to bring it to a close. **2.5/5**",
  "created_at": {
    "$date": "2023-08-07T02:35:29.616Z"
  },
  "updated_at": {
    "$date": "2023-08-07T02:35:29.730Z"
  },
  "helpful": null,
  "not_helpful": null
},
{
  "_id": {
    "$oid": "666b3fca00105718d9a4b769"
  },
  "movie_id": {
    "$oid": "666b0bcbff071d36d47fa073"
  },
  "user_id": {
    "$oid": "666b38f200105718d9a4b4d0"
  },
  "content": "This was, of course, a totally ludicrous movie devoid of any pretense of realism or intelligence when it comes to basic science and physics from the script writers. It was however, also a quite fun movie.\r\n\r\nIt is also a movie free from the usual Hollywood far left woke preaching which is, of course, a big plus.\r\n\r\nIt is a shame that there is always a bunch of trolls around giving movies like this single star reviews. I mean, come on, what the fuck did you expect? It is a movie exactly in the same style as the last movies in the franchise.\r\n\r\nVin Diesel is Vin Diesel which is a good thing. It is loaded with fun, totally unrealistic but fun, action. I really could have been without Roman’s and Tej’s shenanigans but for the rest I liked the characters and it was nice to see Statham in the movie.\r\n\r\nWhat really made the movie though was to finally see a real, rotten to the core, megalomaniac and charismatic bad guy. Jason Momoa is doing a great job of Dante and I suspect he had quite a bit of fun when doing the role.\r\n\r\nOf course there are a few things that drags down the movie.\r\n\r\nThings like a 20 kiloton nuclear bomb going of a few hundred meters from the Vatican with “almost” no casualties. That is a new low on unrealism even for the Hollywood hacks.\r\n\r\nAnd what bloody passenger airliner has bomb drop style cargo doors under it?\r\n\r\nEven if they did not care about sanity or realism when making the movie there are limits. That drags down the rating as far as I am concerned.\r\n\r\nAlso, they decided to make this final (?) instalment a two part movie with a huge cliffhanger at the end of this one. I just hate cliffhangers and it makes me automatically reduce the rating.\r\n\r\nThere was absolutely know need for it. They could just have Dom & Co walk into the sunset plotting their revenge or something instead of this dumbass ending.\r\n\r\nAt least the good thing is that, unless the Hollywood hacks turns out to be even more stupid than they usually are (which would be quite a feat), part two of this movie will be all about kicking Dante’s arse.",
  "created_at": {
    "$date": "2023-11-19T09:20:12.780Z"
  },
  "updated_at": {
    "$date": "2023-11-19T09:20:12.907Z"
  },
  "helpful": null,
  "not_helpful": null
},
{
  "_id": {
    "$oid": "666b3fca00105718d9a4b76a"
  },
  "movie_id": {
    "$oid": "666b0bcbff071d36d47fa073"
  },
  "user_id": {
    "$oid": "666b38f200105718d9a4b495"
  },
  "content": "I liked Fast 9 but can't say the same for Fast 10. Was it the recycled footage? Was it Aquaman? Something didn't feel right in this that felt right in 9. Joy? Fast needs to spark joy. This didn't spark joy. Thank you, Fast X.",
  "created_at": {
    "$date": "2024-01-17T14:57:45.866Z"
  },
  "updated_at": {
    "$date": "2024-01-17T14:57:45.943Z"
  },
  "helpful": null,
  "not_helpful": null
},
{
  "_id": {
    "$oid": "666b3fca00105718d9a4b76b"
  },
  "movie_id": {
    "$oid": "666b0bcbff071d36d47fa074"
  },
  "user_id": {
    "$oid": "666b38f200105718d9a4b491"
  },
  "content": "I can't say that I enjoyed this as much as the first outing for this new breed of musketeers, but it's still an enjoyable and authentic looking adaptation of these timeless and honourable Dumas characters. We know that \"Constance\" (Lyna Khoudri) has been kidnapped and that the enamoured \"D'Artagnan\" (François Civil) is determined to get her back - but how? Well the almost fatal attack on the king (Louis Garrel) has galvanised everyone - friend and foe, and the musketeers determine that they must get to the ringleader of that plot before it is eventually accomplished and the kingdom is plunged into chaotic warfare. Now everyone suspects the malevolent Cardinal Richelieu (Eric Ruf) but surely it's not in his interests to kill Louis XIII? The Queen (Vicky Krieps) and her not-so-secret English lover Buckingham (Jacob Fortune-Lloyd) might be in the mix, or maybe just a disgruntled nobleman? \"D'Artagnan\" is first with a clue after he inadvertently rescues \"Milady\" (Eva Green) from a prison (after she fell off a cliff!) armed with a secret, coded letter. What does it mean? Can it help find his love and save the kingdom? Meantime, we start to learn a little more about this enigmatic \"MIlady\" and of her relationship with \"Athos\" (Vincent Cassel) whilst his two pals \"Aramis\" (Romain Duris) and the affable \"Porthos\" (Pio Marmaï) do their bit for the story and the country too. It looks great - the settings, the costumes, the combat scenes all smack of effort having been spent on making the scenarios ring true. I'm still no great fan of Eva Green, but here she starts to exude just the tiniest hint of menace as the story builds to the conclusion of this search for love and traitors. It's a wee bit more earnest, this time around - there's less humour and I missed that. I don't mean laugh out loud stuff, but here we rarely see all the musketeers together; their camaraderie isn't so obvious. This is essentially Civil v Green and that doesn't always work so well. Still, it's a solid and quickly paced adventure story that I found passed two hours effortlessly.",
  "created_at": {
    "$date": "2023-12-22T15:21:39.680Z"
  },
  "updated_at": {
    "$date": "2023-12-22T15:23:19.398Z"
  },
  "helpful": null,
  "not_helpful": null
},
{
  "_id": {
    "$oid": "666b3fca00105718d9a4b76c"
  },
  "movie_id": {
    "$oid": "666b0bcbff071d36d47fa075"
  },
  "user_id": {
    "$oid": "666b38f200105718d9a4b48d"
  },
  "content": "FULL SPOILER-FREE REVIEW @ https://fandomwire.com/poor-things-venice-film-festival-review-emma-stone-shines-in-the-best-film-of-the-year-so-far/\r\n\r\n\"Not only is Poor Things the best movie of the festival, but it's also the best of the year so far, as well as a new personal favorite of Yorgos Lanthimos' career.\r\n\r\nA brilliantly thought-provoking, insanely hilarious story packed with substance, focused on a fascinating self-discovery journey filled with thematically rich layers. Astonishing performances from the entire cast, but Emma Stone is truly impressive as an exceptionally expressive force who should win many awards.\r\n\r\nA technical masterclass across all filmmaking areas simply puts the icing on top of a near-perfect cake.\"\r\n\r\nRating: A",
  "created_at": {
    "$date": "2023-09-02T15:20:00.629Z"
  },
  "updated_at": {
    "$date": "2023-09-02T15:20:00.713Z"
  },
  "helpful": null,
  "not_helpful": null
},
{
  "_id": {
    "$oid": "666b3fca00105718d9a4b76d"
  },
  "movie_id": {
    "$oid": "666b0bcbff071d36d47fa075"
  },
  "user_id": {
    "$oid": "666b38f200105718d9a4b4b1"
  },
  "content": "When the circumstances of our lives don’t suit us, it’s time to reinvent ourselves – something that happens both literally and metaphorically in this latest offering from director Yorgos Lanthimos. But the way that result comes about here represents a truly inspired fusion of genres, including comedy, romance, social commentary and sci-fi, making for one of the most inventive, unusual and hilarious releases of recent years. This offbeat feminist fable tells the story of how a pregnant, young, anonymous suicide victim (Emma Stone) is reanimated with the aid of a brain transplant from her unborn fetus, an achievement accomplished by a colorful, controversial but well-meaning surgeon/scientist a la Dr. Frankenstein (Willem Dafoe). He nurtures his subject back to life, health and sentience, a sometimes-challenging process that finally surfaces when she discovers sexuality, the trigger for exploring a new, independent life for herself, both physically and emotionally. Through a series of adventures over the course of a trip through Europe with a free-wheeling, lusty but lecherous, self-serving lawyer (Mark Ruffalo), she finds herself as a self-actualized woman in an age where that’s more of a rarity than a standard, particularly in a world where men treat women more like property than people. While the film’s pacing could use some shoring up in the middle, this offering nevertheless entertains with uproarious laughs throughout, even when the narrative turns more thoughtful and substantive. The superb performances by Stone, Dafoe and Ruffalo are top shelf, contributing to the picture’s whopping 13 Critics Choice Award and 7 Golden Globe Award nominations. The film is also visually stunning in its cinematography and editing, as well as in its spectacular and whimsical production design, filled with images reminiscent of the movies of Wes Anderson and Terry Gilliam while sustaining a look all its own. Admittedly, this release features a good deal of explicit sexuality, both visually and in the dialogue, so sensitive viewers should take note. However, as one of the most anticipated pictures of this year’s awards season, “Poor Things” never disappoints, serving up a solid offering that consistently tickles the funny bone while giving audiences much to think about – and there’s nothing poor in any of that.",
  "created_at": {
    "$date": "2023-12-17T23:52:53.939Z"
  },
  "updated_at": {
    "$date": "2023-12-17T23:52:54.047Z"
  },
  "helpful": null,
  "not_helpful": null
},
{
  "_id": {
    "$oid": "666b3fca00105718d9a4b76e"
  },
  "movie_id": {
    "$oid": "666b0bcbff071d36d47fa075"
  },
  "user_id": {
    "$oid": "666b38f200105718d9a4b491"
  },
  "content": "It's almost as if Yorgos Lanthimos had sat down for a transcendental conversation with James Whale! Student \"Max\" (Ramy Youssef) is a student recruited by his professor \"Godwin\" (Willem Dafoe - aka \"God\") to come and help him work on his latest project. She's called \"Bella\" (Emma Stone) and it soon transpires that she is the product of some very creative surgery on the part of \"God\" - a man who has, himself, had one or two experiences under the knife at the hands of his scientist father! You see, a pregnant woman took her own life by jumping from a bridge, but was luckily fished out of the water before her baby died. The surgeon managed to deliver the baby then replace the dead brain of the adult with the one from the nascent infant! Needless to say, \"Bella\" is on an actively steep learning curve and is quite capable of throwing the odd tantrum to get what she wants - and that is, initially, to go out and explore. Gradually more empowered, and a little more mature, she discovers the delights of the orgasm - and after that there's no stopping her. \"God\" tries to control her by suggesting a marriage to \"Max\" but he insists on such a fastidious contract that \"Duncan\" (Mark Ruffalo) concludes she must be worth investigating. He meets her and offers her her dreams, she convinces \"God\" to let her go with him and soon she is embarked on a trip around Europe enjoying the frequent delights of \"furious jumping\"! The always learning woman soon tires of her beau, and realises that she can have loads of fun and earn at the same time - before \"God\" falls ill and she must return home to not just that life, but surprisingly to the one she thought she had left behind on the bridge. This film is genuinely laugh-out-loud at times, and the performance from Emma Stone has to be her best. She plays the almost porcelain-like and childish \"Bella\" when we meet her expertly, and that skill prevails as her character evolves into a savvy, street-smart and capable woman who quickly learns to fight fire with fire. Ruffalo is also on super form as her travelling companion and Kathryn Hunter also turns in a solid performance as her Parisian paymaster \"Swiney\". The narrative takes us on a fantastic tour of European cities, but also on a wonderfully evocative tour of humanity - warts and all. \"Bella\" has a practical and analytical mind that at times seems ludicrously detached, then somehow she ends up having got it right all along. It might look a bit long at just shy of 2½ hours but it really flies by and I couldn't help but feel sorry for the poor billy goat at the end of this creatively interpreted and very well adapted story of what were originally supposed to be Glaswegian hotspots!",
  "created_at": {
    "$date": "2024-01-13T11:35:03.397Z"
  },
  "updated_at": {
    "$date": "2024-01-13T11:35:03.639Z"
  },
  "helpful": null,
  "not_helpful": null
},
{
  "_id": {
    "$oid": "666b3fca00105718d9a4b76f"
  },
  "movie_id": {
    "$oid": "666b0bcbff071d36d47fa075"
  },
  "user_id": {
    "$oid": "666b38f200105718d9a4b48f"
  },
  "content": "Superb! It's quite the ride!\r\n\r\nI don't have the film school-esque analysis to adequately describe all this, so I'll very much leave that to others. What I can note, though, is that I had a great time watching <em>'Poor Things'</em>. It's incredible. I have many a positive, though the main one is obvious: Emma Stone. All I can say is: Bravo! A truly outstanding performance!\r\n\r\nAnother major, major plus is the music. Wow! Sensational. It's so commanding throughout, blowing me away in what felt like every few minutes... and yet, it never distracts or takes you out from any scene unfolding onscreen. One of the greatest scores I've heard in a very long time. That aside, the visuals are amazing - from the colours to the sets, major props to all those behind the scenes. It all looks exquisite.\r\n\r\nStone isn't alone in impressing, as Willem Dafoe is brilliant too - loved his showing in this, the accent is particularly well fitting. Mark Ruffalo is praiseworthy too, as is everyone else to be honest - e.g. Ramy Youssef and Kathryn Hunter. They all partake in a quite bizarre plot, but one that is absolutely absorbing from beginning to conclusion.\r\n\r\nPre-watch I was somewhat expecting that this was going to be one of those (having not researched anything, as per) overly artsy flicks that I wouldn't connect with, delightfully I was totally wrong. I also felt, when Christopher Abbott's character appears, that the film should've ended earlier, though again I was incorrect because the film simply manages to continue at such a hugh quality.\r\n\r\nTo wrap it up: I loved it. Credit to all involved.",
  "created_at": {
    "$date": "2024-03-01T00:11:51.518Z"
  },
  "updated_at": {
    "$date": "2024-03-01T00:11:51.623Z"
  },
  "helpful": null,
  "not_helpful": null
},
{
  "_id": {
    "$oid": "666b3fca00105718d9a4b770"
  },
  "movie_id": {
    "$oid": "666b0bcbff071d36d47fa075"
  },
  "user_id": {
    "$oid": "666b38f200105718d9a4b518"
  },
  "content": "Fantasy drama- comedy adult film directed by Yorgos Lanthimos (The Killing of the Sacred Deer, The Lobster, The Favourite) and written by Tony McNamara (The Great, The Favorite, Cruella), being based on the 1992's novel by Alasdair Gray, that Lanthimos liked and even went to Scotland in 2009 to buy the direct of the movie.\r\n\r\nHaving a victorian semi-steampunk and exquisite atmosphere it tells the story of a newly created woman Bella Baxter, with her body reanimated by the eccentric surgeon Godwin Baxter, that discovering that after her suicide jumping a bridge she was pregnant, and uses the unborn fetus brain on her head.\r\n\r\nAfter this she went on a journey from a Frankenstein character and develops her tastes and skills gradually till the end of the filme. I must say that some sexual scenes with Emma Stone and her character sexual appetite are most daring and shows how she grow as and actress in all aspect.\r\n\r\nThe main core of roles are Emma Stone as Bella Baxter, Mark Ruffalo as Duncan Wedderburn, Willem Dafoe as Dr. Godwin Baxter and as a lesser role Ramy Youssef as Max McCandles.\r\n\r\nAccording to the cinematographer, Ryan Williams (American Honey, The Favorite) in conjunction with the director Lanthimos used an array of cameras, lens and films included Nikon, Angenieux Optimo and Zeiss Master Zooms, an ultra-wide PL-mount Optex 4mm fisheye, designed for 16mm/S16mm cinematography, that opens up to T2, plus antique 58mm and 85mm Petzvals. Ryan selected EASTMAN DOUBLE-X Black & White Negative Film 5222 for the movie's opening B&W sequences, KODAK EKTACHROME Color Reversal Film 100D 5294 for Bella's elopement and adventures with Wedderburn, and KODAK VISION3 500T Color Negative Film 5219 for the film's denouement.\r\n\r\nThe production design by Shona Heath\tand James Price and the equip of art direction and prosthetics made and incredible job plus with the unique costume design by Holly Waddington (Lady MacBeth, Clash of Titans) also are striking, from the more bizarre childish dresses used on the start of the film to the more adut  on the end. All this with a modest budget of $35 million.\r\n\r\nThe movie have 11 Academy nominations for Best Achievement in Makeup and Hairstyling, Best Achievement in Music Written for Motion Pictures (Original Score), Best Motion Picture of the Year, Best Achievement in Directing, Best Performance by an Actress in a Leading Role, Best Performance by an Actor in a Supporting Role, Best Adapted Screenplay, Best Achievement in Cinematography, Best Achievement in Film Editing, Best Achievement in Production Design, Best Achievement in Costume Design and  already have 11 BAFTA awards plus Venice Film Festival 2 awards, Golden Lion Best Film and Yorgos Lanthimos 2023 Winner UNIMED Award.\r\n\r\nI honestly hope that the movie shines and it shinned for me and obfuscated some other movies (maybe only not in best co-adjuvant actress - which we don't have here) at the academy.",
  "created_at": {
    "$date": "2024-03-01T15:47:29.596Z"
  },
  "updated_at": {
    "$date": "2024-03-01T15:47:29.673Z"
  },
  "helpful": null,
  "not_helpful": null
},
{
  "_id": {
    "$oid": "666b3fca00105718d9a4b771"
  },
  "movie_id": {
    "$oid": "666b0bcbff071d36d47fa075"
  },
  "user_id": {
    "$oid": "666b38f200105718d9a4b495"
  },
  "content": "How old when they start banging her? Very much a baby when she's a hot retard. If this isn't proof of pizzagate, I don't know what is.\r\n\r\nRecommend watching as much as possible in the theatres and retiring to your most leisurely of spots for a pirated ending. Super enjoyable performances. Violent. Sensual. Lots of titties. A little long.",
  "created_at": {
    "$date": "2024-03-09T14:56:53.789Z"
  },
  "updated_at": {
    "$date": "2024-03-09T14:56:53.824Z"
  },
  "helpful": null,
  "not_helpful": null
},
{
  "_id": {
    "$oid": "666b3fca00105718d9a4b772"
  },
  "movie_id": {
    "$oid": "666b0bcbff071d36d47fa075"
  },
  "user_id": {
    "$oid": "666b38f200105718d9a4b542"
  },
  "content": "Director Yorgos Lanthimos sweeping cinematic spectacular film that explores the life of what it means to be human, a woman, what exactly is life, and what is love. \r\n\r\nThe tale follows Bella Baxter, a woman who had been given another chance at life in the weirdest medical experiment.\r\n\r\nThe film will make you think. It will stun you with its visual prowness from the direcotr, and the cast commitment to staying in character throughout.\r\n\r\nAlthough I found the film to be the strangest tale mixed with aspects of Frankenstein and Eat, Pray, Love.\r\n\r\n Do not try to think too deeply about what you see because this is a film that wants you to sit and enjoy it's story with fascination, and delight all of your senses.\r\n\r\nI give it 4/5 stars for it's uniqueness.",
  "created_at": {
    "$date": "2024-04-02T04:21:20.103Z"
  },
  "updated_at": {
    "$date": "2024-04-08T16:23:14.384Z"
  },
  "helpful": null,
  "not_helpful": null
},
{
  "_id": {
    "$oid": "666b3fca00105718d9a4b773"
  },
  "movie_id": {
    "$oid": "666b0bcbff071d36d47fa075"
  },
  "user_id": {
    "$oid": "666b38f200105718d9a4b544"
  },
  "content": "Men bad. Interracially promiscuous socialist prostituted bisexual sociopathic women good. The end.\r\n\r\nThank you, feminism. I'm surprised there were no transpeople in this thing. Maybe in the director's cut.\r\n\r\nBoring. So, so boring. You're sooo boooooring.",
  "created_at": {
    "$date": "2024-04-05T13:03:43.006Z"
  },
  "updated_at": {
    "$date": "2024-04-05T13:11:44.392Z"
  },
  "helpful": null,
  "not_helpful": null
},
{
  "_id": {
    "$oid": "666b3fca00105718d9a4b774"
  },
  "movie_id": {
    "$oid": "666b0bcbff071d36d47fa076"
  },
  "user_id": {
    "$oid": "666b38f200105718d9a4b491"
  },
  "content": "With her grandpa hitting his hundredth birthday, the precocious young \"Asha\" hopes that the King, keeper of all of the wishes made by the islanders in their idyllic home, will agree to make his long-forgotten dream come true. Coincidentally, he is also looking for a special assistant and she is up for the job! A chance to kill two birds with one stone sees her in the royal presence and in the course of her pitch, she jumps the gun and implores the king to grant her grandfather's wish. His prevarication causes us all to begin to smell a rat - is the benevolent king really all he seems to be? She leaves disappointed and in desperation makes a wish of her own - but on a star, this time. It decides to leave the heavens and come and help her on her quest to release all the trapped wishes and free the kingdom from it's increasingly menacing monarch... It's an OK animation this, but the story is really quite thin with characters that don't much ignite the imagination - except, perhaps, the goat \"Valentino\" who has easily the best of what little comedy there is in the rather earnest script. The creatively entitled \"The Wish\" is the standard power ballad amongst the really quite unremarkable soundtrack that you just know is desperate to get to Leigh Harline's Disney theme tune \"When You Wish Upon a Star\" at the end. It's an amalgam of a few stories and will probably keep the youngsters entertained first time around. There's not a great deal for the grown ups, though, and I'm not sure it will be remembered for long into this animator's second century.",
  "created_at": {
    "$date": "2023-11-29T08:04:59.406Z"
  },
  "updated_at": {
    "$date": "2023-11-29T08:04:59.515Z"
  },
  "helpful": null,
  "not_helpful": null
},
{
  "_id": {
    "$oid": "666b3fca00105718d9a4b775"
  },
  "movie_id": {
    "$oid": "666b0bcbff071d36d47fa076"
  },
  "user_id": {
    "$oid": "666b38f200105718d9a4b48d"
  },
  "content": "FULL SPOILER-FREE REVIEW @ https://www.firstshowing.net/2023/review-disney-animations-wish-ariana-debose/\r\n\r\n\"Wish is a magical journey about the vitality of personal wishes and the importance of pursuing those same dreams. Although the narrative follows a familiar structure and doesn't delve beyond the central theme, the nostalgia it evokes is certainly appreciated.\r\n\r\nAriana DeBose's powerful voice embodies the inspiring determination of the protagonist, leading a talented cast in a film marked by the beautiful blend of 2D and 3D animation, as well as original songs that, for the most part, win over the audience.\r\n\r\nIt's another charming chapter in Disney's vast library, offering a pleasant experience for fans of all ages.\"\r\n\r\nRating: B",
  "created_at": {
    "$date": "2023-12-11T10:07:26.814Z"
  },
  "updated_at": {
    "$date": "2023-12-11T10:07:26.921Z"
  },
  "helpful": null,
  "not_helpful": null
},
{
  "_id": {
    "$oid": "666b3fca00105718d9a4b776"
  },
  "movie_id": {
    "$oid": "666b0bcbff071d36d47fa077"
  },
  "user_id": {
    "$oid": "666b38f200105718d9a4b548"
  },
  "content": "**Go watch as soon as it releases in your country!**\r\n\r\nI was privileged enough to be in Tokyo the day they released this movie with English subtitles and I have to say that if you enjoy \"monster\" movies there is no way you won't like this Godzilla.\r\n\r\nThe movie is set from the last days of WW2 to the early post-war. The nuclear bombs used in the Pacific gave Godzilla its super powers, and in the post war it decides to swim towards Tokyo, which of course results in a desperate attempt of stopping the monster. A former kamikaze pilot that had a previous traumatic encounter with Godzilla sees this as an opportunity to get revenge. Apart from a few dialogs and actions from the authors that are more suitable to the Japanese than the American audience, this movie has it all, romance, drama, loss, existencial crisis, and a gory and unstoppable monster. \r\n\r\nWhether you are an old Godzilla fan or a curious newcomer to this type of movie, Godzilla is one of the best movies released this year.",
  "created_at": {
    "$date": "2023-12-01T07:39:03.948Z"
  },
  "updated_at": {
    "$date": "2023-12-01T07:39:04.030Z"
  },
  "helpful": null,
  "not_helpful": null
},
{
  "_id": {
    "$oid": "666b3fca00105718d9a4b777"
  },
  "movie_id": {
    "$oid": "666b0bcbff071d36d47fa077"
  },
  "user_id": {
    "$oid": "666b38f200105718d9a4b48d"
  },
  "content": "FULL SPOILER-FREE REVIEW @ https://fandomwire.com/godzilla-minus-one-review/\r\n\r\n\"Godzilla Minus One strikes an outstanding balance between compelling character building, a thematically rich narrative, and two hours of gargantuan entertainment, ultimately becoming a noteworthy addition to the monster film subgenre.\r\n\r\nIt breaks the formulaic barriers of generic creature flicks by delivering a layered story that explores themes of redemption, forgiveness, and the aftermath of war. The memorable score, powerful sound design, and exquisite visuals contribute to a cinematic experience that is both thrilling and emotionally resonant.\r\n\r\nWhile the lead acting occasionally falters into melodrama, it does little to diminish the overall impact of a movie that has undoubtedly earned its place among the top-tier entries in the Godzilla franchise.\"\r\n\r\nRating: A-",
  "created_at": {
    "$date": "2023-12-05T20:42:05.121Z"
  },
  "updated_at": {
    "$date": "2023-12-05T20:42:05.228Z"
  },
  "helpful": null,
  "not_helpful": null
},
{
  "_id": {
    "$oid": "666b3fca00105718d9a4b778"
  },
  "movie_id": {
    "$oid": "666b0bcbff071d36d47fa077"
  },
  "user_id": {
    "$oid": "666b38f200105718d9a4b4a2"
  },
  "content": "_Godzilla Minus One_ is not only one of the best films out of the 30-plus in the series, but also one of the best films of the year. The acting is superb, the destruction is immense and incredible, and the gnarly Godzilla design is fantastic. It’s ridiculous, if true, that this film only has a budget of $15 million because it looks better than most Hollywood blockbusters.\r\n\r\nFull review: bit.ly/kamikaiju",
  "created_at": {
    "$date": "2023-12-13T00:10:41.636Z"
  },
  "updated_at": {
    "$date": "2023-12-13T00:10:41.740Z"
  },
  "helpful": null,
  "not_helpful": null
},
{
  "_id": {
    "$oid": "666b3fca00105718d9a4b779"
  },
  "movie_id": {
    "$oid": "666b0bcbff071d36d47fa077"
  },
  "user_id": {
    "$oid": "666b38f200105718d9a4b491"
  },
  "content": "\"Shikishima\" (Ryunosuke Kamiki) is a man with some guilt. He was a kamikaze pilot towards the end of WWII who feigned some technical problems with his plane and so landed and survived! Now, Japan is defeated and in ruins and he is feels a deep sense if shame. He manages to find a job in a wooden-hulled boat trying to collect up from the sea all the mines laid by the Allies and the Japanese alike, and it's whilst they are at sea they discover a toxic creature that has been born out of the ashes of the atom bomb. This creature is bent on destruction and nothing mankind has in it's arsenal can even dent this leviathan that possesses a deadly blue ray than can obliterate all in it's path. It heads to the land wreaking devastation and so the scientists must come up with a plan before the country is laid waste. It's really two stories. One of the man with all of his demons, his burgeoning romance with a homeless girl and her child and of his gradual realisation that maybe his life isn't quite over yet. The remainder is the standard \"Godzilla\" style special effects fest that I must admit to preferring to the more recent Hollywood versions. The style of animation here is grittier, the monster knobblier and angrier and the immediately post-war timeframe allows the photography to present us with a more attractively bleak film to look at. The ending is predictable, sure, but at least it tries to solve the problem of this marauding beastie in a little more of an innovatory fashion. Not much original here, but I still quite enjoyed it.",
  "created_at": {
    "$date": "2023-12-25T11:33:50.820Z"
  },
  "updated_at": {
    "$date": "2023-12-25T11:33:50.927Z"
  },
  "helpful": null,
  "not_helpful": null
},
{
  "_id": {
    "$oid": "666b3fca00105718d9a4b77a"
  },
  "movie_id": {
    "$oid": "666b0bcbff071d36d47fa077"
  },
  "user_id": {
    "$oid": "666b38f200105718d9a4b54d"
  },
  "content": "**So good!**\r\n\r\nI have been watching Godzilla movies as long as I can remember. Most are enjoyable and enteretaining except the 1998 American made one. It's one of the worse movies I have ever seen.\r\n\r\nThis movie has no right to be as good as it is! But it is good. Very good and a great movie to celebrate the 70th anniversay of the most well known kaiju in the world. Must be seen on the big screen.\r\n\r\nI didn't know a Godzilla movie could pack an emotional punch the way this film did. It's a testament to the writing and acting in this film. Kamiki Ryunosuke, Hamabe Minami, Yamada Yuki, Aoki Munetaka, Yoshioka Hidetaka, Ando Sakura and Sasaki Kuranosuke. I'm listing all the actotrs here b/c everyone played their roles well. I also, must shout out the little girl actress. I don't know her name but she was magnificent and I think she was only 3 or 4 years old. I can't give much away but the film explores survivors guilt, shame and forgiveness.",
  "created_at": {
    "$date": "2024-01-08T04:00:56.728Z"
  },
  "updated_at": {
    "$date": "2024-01-09T16:35:18.361Z"
  },
  "helpful": null,
  "not_helpful": null
},
{
  "_id": {
    "$oid": "666b3fca00105718d9a4b77b"
  },
  "movie_id": {
    "$oid": "666b0bcbff071d36d47fa077"
  },
  "user_id": {
    "$oid": "666b38f200105718d9a4b54f"
  },
  "content": "This is one of the very best Godzilla movies ever made. There's a really good human story and every moment that Godzilla is on-screen is great. The post-WWII setting absolutely adds to the desperation of the main characters and the dread of having to once again survive an attacking force, this time in the form of a beast that isn't protecting the Earth or any such nonsense. Godzilla is a force of nature (or science) that doesn't care about anything or anyone.\r\n\r\nThe only drawbacks of this movie are an irritatingly manipulative moment (tugboats) and a couple of unbelievably coincidental reunions.",
  "created_at": {
    "$date": "2024-01-30T19:44:16.638Z"
  },
  "updated_at": {
    "$date": "2024-02-09T23:02:42.503Z"
  },
  "helpful": null,
  "not_helpful": null
},
{
  "_id": {
    "$oid": "666b3fca00105718d9a4b77c"
  },
  "movie_id": {
    "$oid": "666b0bcbff071d36d47fa07a"
  },
  "user_id": {
    "$oid": "666b38f200105718d9a4b495"
  },
  "content": "Zack sure likes farming.\r\n\r\nWhat a pile of crap.\r\n\r\nI liked the first one well enough.",
  "created_at": {
    "$date": "2024-04-20T00:27:43.129Z"
  },
  "updated_at": {
    "$date": "2024-04-20T00:27:43.220Z"
  },
  "helpful": null,
  "not_helpful": null
},
{
  "_id": {
    "$oid": "666b3fca00105718d9a4b77d"
  },
  "movie_id": {
    "$oid": "666b0bcbff071d36d47fa07a"
  },
  "user_id": {
    "$oid": "666b38f200105718d9a4b518"
  },
  "content": "Better than the first because it have more action scenes;\r\n\r\nGreat action scenes all around;\r\n\r\nCGI is great almost all the times, less in others (like when the cannons where falling of the ship);\r\n\r\nActing is so-so;\r\n\r\nSnyder passion for it is visible;\r\n\r\nEven so, being a 3 movies story (if I am right), it seems too little - they worked too much in several characters that don't have time to show potential;\r\n\r\nThe fuss all around a archaic village is something that I don't find believable;",
  "created_at": {
    "$date": "2024-04-21T21:17:45.307Z"
  },
  "updated_at": {
    "$date": "2024-04-21T21:17:45.381Z"
  },
  "helpful": null,
  "not_helpful": null
},
{
  "_id": {
    "$oid": "666b3fca00105718d9a4b77e"
  },
  "movie_id": {
    "$oid": "666b0bcbff071d36d47fa07b"
  },
  "user_id": {
    "$oid": "666b38f200105718d9a4b553"
  },
  "content": "As pure popcorn entertainment and the culmination of the Monsterverse saga, 'Godzilla vs. Kong' delivers the goods in an unexpectedly big way. This film is essential viewing for those who might like to watch a lizard punch an ape.\r\n- Jake Watt\r\n\r\nRead Jake's full article...\r\nhttps://www.maketheswitch.com.au/article/review-godzilla-vs-kong-hugely-entertaining",
  "created_at": {
    "$date": "2021-03-24T22:20:16.047Z"
  },
  "updated_at": {
    "$date": "2021-06-23T15:58:53.616Z"
  },
  "helpful": null,
  "not_helpful": null
},
{
  "_id": {
    "$oid": "666b3fca00105718d9a4b77f"
  },
  "movie_id": {
    "$oid": "666b0bcbff071d36d47fa07b"
  },
  "user_id": {
    "$oid": "666b38f200105718d9a4b4ce"
  },
  "content": "Satisfying through and through. Also they seemed to learn from the past mistakes (with Godzilla and Godzilla: King of the Monsters) of doing too much with the human characters, here they are thankfully just window dressing for the battle between the two titans. **3.75/5**",
  "created_at": {
    "$date": "2021-03-31T19:36:54.492Z"
  },
  "updated_at": {
    "$date": "2021-06-23T15:58:53.830Z"
  },
  "helpful": null,
  "not_helpful": null
},
{
  "_id": {
    "$oid": "666b3fca00105718d9a4b780"
  },
  "movie_id": {
    "$oid": "666b0bcbff071d36d47fa07b"
  },
  "user_id": {
    "$oid": "666b38f200105718d9a4b556"
  },
  "content": "Oh Yeah!  \r\nTHE monster movie of the year is here and just how good is it!  \r\n\r\nIs the plot predictable?  Yep - I'd guessed 80% of it 2 months ago.  \r\nIs it silly?  You bet. \r\n\r\nAre the humans essential? Nah, but we didnt come here for them.\r\nWe came to see Kong and Godzilla slug it out.  And we got that!  \r\n\r\nThe scenes with the Kaiju are well thought out and choreographed (can we say that for digital fights?).  And do they ever deck it out.  \r\nThe devastation you see on the poster gives away how much of Hong Kong gets destroyed (there will be extra land available for building now). \r\n\r\nThe movie is directed and paced well - the first half sets things up for the multiple confrontation between the Kaiju; and the second half lets loose.  \r\n\r\nNone of the actors are given much to do and most seem to sleepwalk through it, but Rebecca Hall is easily the best (she is always a delight to watch), Kyle Chandler channels Coach Taylor for a couple of scenes, Julian Dennison (from Hunt for the Wilderpeople) gets some good lines and Demian Bichir is having fun as the evil rich dude (never trust rich people...in movies or real life). \r\n\r\nThe sound design and score are both on point, but everything here subsides when the Kaiju are around.  The CGI is great - and like Peter Jackson's Kong, you actually feel for the great big monkey.  \r\n\r\nThis movie is some first class popcorn, needing to be enjoyed on the biggest screen you can find.",
  "created_at": {
    "$date": "2021-04-01T11:24:13.690Z"
  },
  "updated_at": {
    "$date": "2021-06-23T15:58:53.842Z"
  },
  "helpful": null,
  "not_helpful": null
},
{
  "_id": {
    "$oid": "666b3fca00105718d9a4b781"
  },
  "movie_id": {
    "$oid": "666b0bcbff071d36d47fa07b"
  },
  "user_id": {
    "$oid": "666b38f200105718d9a4b4a2"
  },
  "content": "Godzilla vs. Kong suffers from what other versus films such as Freddy vs. Jason or the Alien vs. Predator films also suffered from. These films put too much value in humans when the audience just wants to see more of the on-screen monsters they either paid hard money or chose to stream to see. That’s why if Legendary chooses to keep this franchise going they should do All Monsters Attack or something involving Monster Island next where humans can be spectators at best and monsters wreak havoc for up to two straight hours. Stop feeding fans unbearable human excretion and trying to pass it off as Godzilla gold. \r\n\r\nFull review: https://godhatesgeeks.com/godzilla-vs-kong-review-monkey-good-humans-bad/",
  "created_at": {
    "$date": "2021-04-02T23:23:37.433Z"
  },
  "updated_at": {
    "$date": "2021-06-23T15:58:53.894Z"
  },
  "helpful": null,
  "not_helpful": null
},
{
  "_id": {
    "$oid": "666b3fca00105718d9a4b782"
  },
  "movie_id": {
    "$oid": "666b0bcbff071d36d47fa07b"
  },
  "user_id": {
    "$oid": "666b38f200105718d9a4b559"
  },
  "content": "The worst part about this? Alexander Skarsgård delivering a career-low performance, over-acting (or maybe being over-directed??) nearly every single line.",
  "created_at": {
    "$date": "2021-04-15T14:23:49.142Z"
  },
  "updated_at": {
    "$date": "2021-06-23T16:54:29.604Z"
  },
  "helpful": null,
  "not_helpful": null
},
{
  "_id": {
    "$oid": "666b3fca00105718d9a4b783"
  },
  "movie_id": {
    "$oid": "666b0bcbff071d36d47fa07b"
  },
  "user_id": {
    "$oid": "666b38f200105718d9a4b55b"
  },
  "content": "The REAL Clash of the Titans!\r\n\r\nIt was spectacular! The two iconic monsters in Hollywood go head-to-head in an updated remake. Both a sequel AND a crossover!\r\n\r\nThe best part was when Godzilla and Kong fought in the city, with all them tall buildings. Talk about classic monster fight! Am I right?!\r\nThe second best part was when Kong came to Godzilla's aid and the two fought together against MechaGodzilla, right up to the end where Kong gave the final blow!\r\nAnd yes, I am aware that I am putting a lot of exclamation marks in my review, but only because I really enjoyed this movie and they're my way of expressing of how frickin' awesome this film was for me! Especially for personal reason...\r\nIt has been 4 months since the third lockdown here in the UK, 4 months of cinemas everywhere closed. And in the week that every cinemas reopened the first film I wanted to see was Godzilla vs Kong.\r\n\r\nI admit that there were a couple of bits that would've improved; like more screen time from Kyle Chandler.\r\nAnd that other guy was supposed to be Serizawa's estranged son, but that was never acknowledged, despite the casting.\r\nBut other than that, not only was Godzilla vs Kong the first film I've seen since the cinemas reopened but also the best film I have seen, so far!",
  "created_at": {
    "$date": "2021-05-20T07:47:34.928Z"
  },
  "updated_at": {
    "$date": "2021-06-23T15:58:56.059Z"
  },
  "helpful": null,
  "not_helpful": null
},
{
  "_id": {
    "$oid": "666b3fca00105718d9a4b784"
  },
  "movie_id": {
    "$oid": "666b0bcbff071d36d47fa07b"
  },
  "user_id": {
    "$oid": "666b38f200105718d9a4b48d"
  },
  "content": "FULL SPOILER-FREE REVIEW @ https://www.msbreviews.com/movie-reviews/godzilla-vs-kong-spoiler-free-review\r\n\r\n\"Godzilla vs. Kong is the return to form from the divisive MonsterVerse. Max Borenstein and Eric Pearson manage to write an uncomplicated screenplay without absurd plot points or extremely dumb character decisions, which is all I ever asked for in this franchise, even if it carries tons of formulas and cliches. No one expects an Oscar-worthy script, but something that can serve as a companion piece to the massive battles between the Titans. Adam Wingard struggles to balance the unnecessary, irrelevant side stories that unfortunately affect the film's pacing and tone, but ultimately he's able to set up each fighting sequence nicely. Action-wise, it's the best entry of the saga, by far. From the genuinely impressive, eyegasmic CGI work to the exciting, adrenaline-pumping monster fights that will leave you at the edge of your seat, this movie is the definition of pure blockbuster entertainment. Extraordinary production value, as expected, and a perfect Junkie XL's score make this a clear recommendation.\"\r\n\r\nRating: B",
  "created_at": {
    "$date": "2021-06-15T18:37:10.394Z"
  },
  "updated_at": {
    "$date": "2021-06-23T15:58:56.920Z"
  },
  "helpful": null,
  "not_helpful": null
},
{
  "_id": {
    "$oid": "666b3fca00105718d9a4b785"
  },
  "movie_id": {
    "$oid": "666b0bcbff071d36d47fa07b"
  },
  "user_id": {
    "$oid": "666b38f200105718d9a4b55e"
  },
  "content": "So after many years of flukes and alright and great movies over a decade we officially get a face off between the 2 and it kicked ass. buildings came down people died and these 2 fought a mechanical version. it is the end to a good red vs blue kinda movie.",
  "created_at": {
    "$date": "2021-07-08T19:25:09.413Z"
  },
  "updated_at": {
    "$date": "2021-07-08T23:09:56.130Z"
  },
  "helpful": null,
  "not_helpful": null
},
{
  "_id": {
    "$oid": "666b3fca00105718d9a4b786"
  },
  "movie_id": {
    "$oid": "666b0bcbff071d36d47fa07b"
  },
  "user_id": {
    "$oid": "666b38f200105718d9a4b4d0"
  },
  "content": "I have to admit that I expected not to like this movie. When Hollywood decides to pitch two characters, whether it’s superheroes or monsters, that are essentially good against each other it usually turns into crap. Take the absolutely abysmal Batman vs Superman for instance. Then we have Kong Skull Island which, while still being watchable, had a really lousy script.\r\n\r\nBut to my surprise I quite liked this movie. I really got worried when the movie started off with some nutcase activist that Hollywood likes to glorify. Then they had to kiss up to Communist News Network as well by giving them some product placement. Don’t use a real world news network in fiction movies please. Especially not a well known fake news and far left propaganda machine.\r\n\r\nHowever, in the end it all turned out nicely. The nutcase activist was really a nutcase and really really annoying but he still turned out to be on the side of the good guys.\r\n\r\nThe story was not altogether bad and although this story of the hollow earth is really far out fantasy more than anything else, even more than the idea of Kong and Godzilla themselves, I liked it. It was quite cool actually and it allowed for some nice special effects other than just Godzilla and Kong beating each other up and wrecking a few cities in the process.\r\n\r\nSpeaking of special effects. They are really why you watch these kind of movies. Sure a half decent story and passable acting helps but the special effects are the bulk of the enjoyment. For me the movie didn’t disappoint in this area.\r\n\r\nThey were overall very good and actually quite balanced. Well balanced considering the kind of movie. You cannot have a Godzilla movie without at least a couple of city blocks getting demolished after all. Having an actual wet navy battleship showing up I do ascribe to the usual Hollywood writer stupidity of course but for the rest it was really cool. I especially liked the hollow earth scenes and the strange landscape with all the weird creatures.\r\n\r\nWarning, spoiler ahead: The thing I really liked with the movie was that the writers didn’t go down the route of killing either Godzilla or Kong. Something I really feared and which would have reduced the movie to a rubbish rating as far as I am concerned. Instead they threw in Mechagodzilla which was quite cool albeit predictable at this point in the movie and one which united Godzilla and Kong. Also this weird, completely devoid of any (even fictional) science, link to Gidorah was quite a bit of a stretch.\r\n\r\nOverall, watching this movie was two hours well spent as far as I am concerned.",
  "created_at": {
    "$date": "2021-07-19T13:49:21.496Z"
  },
  "updated_at": {
    "$date": "2021-07-19T13:49:21.496Z"
  },
  "helpful": null,
  "not_helpful": null
},
{
  "_id": {
    "$oid": "666b3fca00105718d9a4b787"
  },
  "movie_id": {
    "$oid": "666b0bcbff071d36d47fa07b"
  },
  "user_id": {
    "$oid": "666b38f200105718d9a4b561"
  },
  "content": "If you liked the movies with Kong and Godzilla, you will enjoy this, complete with CGI and monsters against humans. Get your popcorn and soda and put your feet up, this is entertainment in every sense of the word. ⭐⭐⭐⭐",
  "created_at": {
    "$date": "2021-10-17T16:32:19.890Z"
  },
  "updated_at": {
    "$date": "2021-10-17T16:32:19.890Z"
  },
  "helpful": null,
  "not_helpful": null
},
{
  "_id": {
    "$oid": "666b3fca00105718d9a4b788"
  },
  "movie_id": {
    "$oid": "666b0bcbff071d36d47fa07b"
  },
  "user_id": {
    "$oid": "666b38f200105718d9a4b563"
  },
  "content": "Godzilla vs. Kong is the biggest scam since Batman v Superman: Dawn of Justice. It promises a battle of epic proportions, but doesn't have the balls to give us a winner. The late introduction of Mechagodzilla is meant to give the titular characters a common enemy, allowing them to put their differences – whatever these may be – aside and work together. They want to have their cake and eat it too.\r\n\r\nThe film tries to sell us on the idea that Earth is too small for two “alpha titans.” It doesn't occur to anyone that it might be too small for just one; then again, given that both Kong’s and Godzilla’s presence lacks weight, mass, volume, and depth, neither of them can be said to take up physical space on the planet (not to mention that most of the ‘real world’ surrounding them has been as unconvincingly rendered as they have).\r\n\r\nIt is, however, during an expedition to the so-called Hollow Earth that the VFX department really blows its CGI wad. There is no excess they won’t indulge in, and yet it’s not enough to hide the fact that Earth isn't the only hollow thing here – so is the script, which is unable to give us a single good reason why we should care about the skirmishes between a giant lizard and a giant gorilla.\r\n\r\nYou can't have two characters fight each other just because, no matter how ‘cool’ it might seem in theory; they must have a compelling motive, lest the audience loses interest in the outcome. This is such a basic concept that even the later, lesser Rocky installments understand it. But here, Godzilla and Kong just don't seem to like each other very much; even Tom and Jerry, who at least are natural enemies, have a better excuse for their enmity.\r\n\r\nTo sum up, 1) we don't know why a primate and a reptile would want to fight to the death; 2) the explanation the movie provides doesn’t make sense (I mean, Hollow Earth? Puh-lease!); 3) Kong and Godzilla are so phony-looking there is never any concern that they will hurt one another, however much they try; and 4) it's a foregone conclusion that neither is going to take a dive, needed as they are for the inevitable sequels. All things considered, why watch this movie when you can see Peter Griffin fight a giant chicken on YouTube?",
  "created_at": {
    "$date": "2022-08-28T22:49:18.753Z"
  },
  "updated_at": {
    "$date": "2022-09-03T15:38:13.748Z"
  },
  "helpful": null,
  "not_helpful": null
},
{
  "_id": {
    "$oid": "666b3fca00105718d9a4b789"
  },
  "movie_id": {
    "$oid": "666b0bcbff071d36d47fa07b"
  },
  "user_id": {
    "$oid": "666b38f200105718d9a4b565"
  },
  "content": "Godzilla vs Kong a rematch 60 years in the making . I think this is the movie a lot of people wanted to see especially seeing that the last time is to where in a movie together was in 1962.\r\n\r\nThe fights in the movie are amazing the standout being the fight in Hong Kong between Godzilla and King Kong but the boat battle and the mechagodzilla Fight are also very well done as well.  \r\n\r\nThe characters are fine noting amazing but noting awful my favorite being the mom and the daughter their relationship was very well done  overall, this movie just gave me what I wanted, which was a rematch between the two most iconic movie monsters, Godzilla and King Kong",
  "created_at": {
    "$date": "2023-09-06T01:51:10.801Z"
  },
  "updated_at": {
    "$date": "2023-09-06T14:45:04.754Z"
  },
  "helpful": null,
  "not_helpful": null
},
{
  "_id": {
    "$oid": "666b3fca00105718d9a4b78a"
  },
  "movie_id": {
    "$oid": "666b0bcbff071d36d47fa07b"
  },
  "user_id": {
    "$oid": "666b38f200105718d9a4b48f"
  },
  "content": "Somehow not all that entertaining.\r\n\r\nA film titled <em>'Godzilla vs. Kong'</em> really should be a lot of fun. For me, unfortunately, it was quite the disappointment. I personally feel they should've literally have made this one whole wall-to-wall battle between the two monsters with minimal human screen time... it felt like we got the opposite of that.\r\n\r\nThe trio of characters portrayed by Alexander Skarsgård, Rebecca Hall and Kaylee Hottle are passable if a little boring, they are at least decent. The opposite is true for the three of Millie Bobby Brown, Brian Tyree Henry and Julian Dennison - their whole side of the story just didn't do anything for me, so forgettable. Either way, there are too many non-monster characters in this.\r\n\r\nThe stuff directly with Godzilla and Kong is alright. I could've done with less humanising of the latter though, I prefer the idea of them being these titanic behemoths that just aren't that interested in humans. The two aren't equals so it feels unnecessary to try and bridge that gap.\r\n\r\nMy rating feels a tiny bit harsh, but for a movie that has a less than 113 minute run time it did drag a fair deal - and the film's 'best' element, the two titular names, aren't shown enough or portrayed interestingly enough to fulfill what I wanted. Perhaps they'll do it better in the next installment?",
  "created_at": {
    "$date": "2024-04-11T00:24:23.941Z"
  },
  "updated_at": {
    "$date": "2024-04-11T00:24:24.280Z"
  },
  "helpful": null,
  "not_helpful": null
},
{
  "_id": {
    "$oid": "666b3fca00105718d9a4b78b"
  },
  "movie_id": {
    "$oid": "666b0bcbff071d36d47fa07d"
  },
  "user_id": {
    "$oid": "666b38f200105718d9a4b491"
  },
  "content": "\"Clay\" (Jason Statham) has worked for an off-the-books US government programme designed to provide the ultimate security to the democratic process by providing unlimited training and resources to a group of people whose job it is is to objectively protect the system. These folks are called \"beekeepers\" which is lucky because our Jason has decided to spend his well earned retirement doing precisely that. He rents some space in the barn of \"Eloise\" (Phylicia Rashad) and one evening she invites him round for supper. He arrives to find that she has committed suicide and a cursory investigation from her FBI daughter \"Verona\" (Emmy Raver-Lampman) reveals she was the victim of a callous scam that wiped out not just her savings, but $2 million from a charity she chaired. Yep, you've guessed it. \"Clay\" decides it's time to reactivate his account and get on the trail of these people regardless of just how high up the food chain the trail of complicity and corruption leads. Statham adopts a rather curious accent throughout this totally unoriginal and derivative action thriller that gets gradually more preposterous as it goes on. Josh Hutcherson and Jeremy Irons add a little box-office to the thing, but their roles are undercooked and the former is actually pretty hopeless throughout. Some fun pyrotechnics and you wouldn't ever want to mess with \"Clay\" but these one-man assassination squad movies are ten a penny now and this is certainly not one of the best.",
  "created_at": {
    "$date": "2024-01-16T09:43:59.109Z"
  },
  "updated_at": {
    "$date": "2024-01-16T09:43:59.292Z"
  },
  "helpful": null,
  "not_helpful": null
},
{
  "_id": {
    "$oid": "666b3fca00105718d9a4b78c"
  },
  "movie_id": {
    "$oid": "666b0bcbff071d36d47fa07d"
  },
  "user_id": {
    "$oid": "666b38f200105718d9a4b569"
  },
  "content": "9/10\r\n> A **violent, bloody and relentless action thriller** with a cliche but strong storyline and beautifully shot action scenes.",
  "created_at": {
    "$date": "2024-01-21T07:16:38.071Z"
  },
  "updated_at": {
    "$date": "2024-02-09T22:49:02.776Z"
  },
  "helpful": null,
  "not_helpful": null
},
{
  "_id": {
    "$oid": "666b3fca00105718d9a4b78d"
  },
  "movie_id": {
    "$oid": "666b0bcbff071d36d47fa07d"
  },
  "user_id": {
    "$oid": "666b38f200105718d9a4b495"
  },
  "content": "I watched all the The ___ movies in preparation for the most expensive, The Beekeeper. It's short, snappy and dumb. Statham kills people like usual. Just a hard-working American bloke who only ever wanted to be cared for. If you feel all Australians are goofy and should die, you'll really like the end and probably rate it higher than I did.",
  "created_at": {
    "$date": "2024-01-30T23:30:29.757Z"
  },
  "updated_at": {
    "$date": "2024-01-30T23:30:29.847Z"
  },
  "helpful": null,
  "not_helpful": null
},
{
  "_id": {
    "$oid": "666b3fca00105718d9a4b78e"
  },
  "movie_id": {
    "$oid": "666b0bcbff071d36d47fa07d"
  },
  "user_id": {
    "$oid": "666b38f200105718d9a4b49d"
  },
  "content": "Dumb as a brick. I'm sorry but the story behind this is downright moronic,  not helped by shallow or aimless characterisations, absurd action, empty dialogue and no real finale. \r\n\r\nIn summary, a low IQ action flick that's stuffed full of empty exposition and little else.",
  "created_at": {
    "$date": "2024-02-01T04:50:07.730Z"
  },
  "updated_at": {
    "$date": "2024-02-01T04:50:07.818Z"
  },
  "helpful": null,
  "not_helpful": null
},
{
  "_id": {
    "$oid": "666b3fca00105718d9a4b78f"
  },
  "movie_id": {
    "$oid": "666b0bcbff071d36d47fa07d"
  },
  "user_id": {
    "$oid": "666b38f200105718d9a4b48f"
  },
  "content": "I'm conflicted about <em>'The Beekeeper'</em>.\r\n\r\nOn the one hand, it's fantastic entertainment as Jason Statham plays a brilliantly badass character - every scene with him is top, top notch. The editing, action and score are positives, though everything around those aforementioned elements is annoyingly very hit-and-miss... and I'm not sure how much the other bits affect my enjoyment.\r\n\r\nAway from the great Statham, the cast are also up-and-down. Josh Hutcherson and Jeremy Irons are decent, I think inferior actors would've done much worse so those two do do well in fairness. Sadly, for Emmy Raver-Lampman & Co. on the FBI side of the story... not the best. I mean, they're OK but kinda boring at the same time.\r\n\r\nRaver-Lampman's character is also quite lamely written, not the actress' fault of course but still. Without spoiling anything, I feel like her character should've been way more sympathetic to Clay's cause given the obvious - like, still 'do your job' absolutely but it's as if the character forgot what happened at the start of the movie.\r\n\r\nThe scummy organizations are also portrayed a bit too cartoony, based on what I've seen in real life about those sorta people is that they're usually lousy losers who happen to know how to do what they do - rather than 'Gen Z' (please do forgive me for using that term *shudder*) smartasses who party 24/7 as this 2024 release shows.\r\n\r\nI'm happy with the rating I've settled on, Statham merited more though.",
  "created_at": {
    "$date": "2024-02-01T23:39:19.681Z"
  },
  "updated_at": {
    "$date": "2024-02-01T23:39:19.819Z"
  },
  "helpful": null,
  "not_helpful": null
},
{
  "_id": {
    "$oid": "666b3fca00105718d9a4b790"
  },
  "movie_id": {
    "$oid": "666b0bcbff071d36d47fa07d"
  },
  "user_id": {
    "$oid": "666b38f200105718d9a4b56e"
  },
  "content": "**The Beekeeper** is a serviceable action thriller that delivers what you would expect from a _Jason Statham_ vehicle: brutal fights, cheesy one-liners, and a simple revenge plot. The film is directed by David Ayer, who has a knack for creating gritty and violent urban settings, and written by Kurt Wimmer, who has a penchant for crafting absurd and convoluted sci-fi scenarios. The result is a mashup of John Wick, The Equalizer, and The Matrix, with a dash of bee-related humor and symbolism.\r\n\r\n**Statham** plays _Adam Clay_, a reclusive beekeeper who lives on a farm owned by his elderly friend _Eloise Parker_ (**Phylicia Rashad**). When Eloise falls victim to a phishing scam orchestrated by a sinister tech company, Adam decides to use his skills as a former elite operative to track down and punish the culprits. Along the way, he encounters various obstacles and enemies, such as corrupt cops, hired goons, and a mysterious hacker known as The Queen (Ruby Rose). He also forms an unlikely alliance with Eloise's daughter, FBI agent Sarah Parker (**Emmy Raver-Lampman**), who is investigating the same case.\r\n\r\nThe film does not waste much time on exposition or character development, focusing instead on the action sequences and the spectacle. Statham is in his element as the stoic and efficient killing machine, dispatching his foes with a variety of weapons and martial arts moves. He also delivers some witty and sarcastic remarks, often involving bees or honey. The supporting cast is mostly forgettable, except for Rashad, who brings some warmth and dignity to her role, and Rose, who plays the villain with a mix of charm and menace.\r\n\r\nThe film's biggest flaw is its lack of originality and coherence. The plot is a generic and predictable revenge story, with some implausible twists and turns. The film also tries to incorporate some themes and messages about technology, society, and morality, but they are either underdeveloped or contradictory. For example, the film seems to criticize the dangers of data mining and online fraud, but also glorifies the use of hacking and surveillance by the protagonist. The film also uses the bee motif as a metaphor for Adam's identity and mission, but it is often inconsistent and superficial.\r\n\r\nThe Beekeeper is not a film that will challenge or surprise you, but it is a film that will entertain you if you are in the mood for some mindless and fun action. It is a popcorn flick that knows its strengths and limitations, and delivers on its promise of Statham kicking ass and cracking jokes. If you are a fan of his previous works, or of the action genre in general, you will probably enjoy this film. Just don't expect anything more than that.",
  "created_at": {
    "$date": "2024-02-14T12:53:32.184Z"
  },
  "updated_at": {
    "$date": "2024-02-14T20:24:11.625Z"
  },
  "helpful": null,
  "not_helpful": null
},
{
  "_id": {
    "$oid": "666b3fca00105718d9a4b791"
  },
  "movie_id": {
    "$oid": "666b0bcbff071d36d47fa07d"
  },
  "user_id": {
    "$oid": "666b38f200105718d9a4b570"
  },
  "content": "Been there, seen that (a dozen times!). This movie follows the same tired trope of a rogue US government agent. Hollywood, how many more can there be?  If you're looking for something original, skip this one.",
  "created_at": {
    "$date": "2024-03-19T19:52:39.875Z"
  },
  "updated_at": {
    "$date": "2024-04-02T16:52:23.306Z"
  },
  "helpful": null,
  "not_helpful": null
},
{
  "_id": {
    "$oid": "666b3fca00105718d9a4b792"
  },
  "movie_id": {
    "$oid": "666b0bcbff071d36d47fa07e"
  },
  "user_id": {
    "$oid": "666b38f200105718d9a4b48d"
  },
  "content": "If you enjoy reading my Spoiler-Free reviews, please follow my blog :)\r\n\r\nObviously, Joker is one of my most anticipated movies of 2019. I mean, how couldn't it be?! Besides belonging to the superhero genre, DC has been on a streak of great films within its universe, so an isolated installment definitely excites me, especially about one of the evilest villains ever. It's by far one of the less comic-book-y flicks of the century. It doesn't follow the generic origin story formula, it avoids any cliches associated with the genre, and it's the type of movie that's becoming more and more rare nowadays. It's a character study like we haven't seen in a long time.\r\n\r\nI'll simply begin with the person that elevates the entire thing: Joaquin Phoenix. Now, if there's something I'm not going to do is compare his performance with Heath Ledger's. That's the number one mistake people are going to keep making forever. First of all, The Dark Knight and Joker couldn't be more distinct films, even if they belong to the same genre (despite Joker being unique, it's still about a famous comic-book villain). Then, despite Phoenix and Ledger portraying the same \"version\" of the clown (crazy, sadistic psychopath), the former is 90% Arthur Fleck while the latter is 100% Joker, throughout each of their movies. Finally, Phoenix is the sole protagonist of this feature, while Ledger had the best live-action Batman sharing the spotlight.\r\n\r\nIn conclusion, it's both unfair, and a bit unreasonable to compare both interpretations since their roles have a different impact on the narrative, as well as each film being entirely different. In the end, both are impressive. However, let's switch to Phoenix since he's the star of this show … He has 2019's best performance, by far! With a strong marketing campaign, I'm sure he'll get that Oscar. I hope so! It's so well-deserved. Todd Phillips and Scott Silver developed a brilliant screenplay, but Phoenix elevates it to a whole other level.\r\n\r\nThroughout the entire runtime, I felt weird. Perturbed. Even uncomfortable with what I was watching and consequently feeling. It's a dark, brutal, violent, emotionally powerful origin of a villain who I feel disturbingly empathetic towards. Phoenix makes the story work due to its remarkably captivating display of someone who's mentally ill. Arthur Fleck slowly becoming crazier is due to how society behaves and not due to some chemical pool that transforms his skin white and hair green (nothing wrong with this, but I know which origin story I prefer). \"The world is getting crazier out there\", and it becomes excruciatingly painful to deal with it, especially when so much is going on with Arthur’s personal life, and most of it he doesn't even realize because he tries to hide everything behind a smile.\r\n\r\nIt's a screenplay filled with narrative twists that not only pack a punch of surprise but leave you feeling extremely upset. The last act is one of the best in the last few years. If the second act is an enormous build-up, the last one is a terrific payoff. I can't remember the last movie I saw where I loved 100% every single narrative decision. I wouldn't do any of the big moments differently. There are so many excellent references hidden in plain sight that comic-book fans (and fans of the TDK trilogy as well) will love just like I did. In the ending, there's one pivotal moment in particular that serves as the absolute climax … I got chills all over my body. They couldn't have done that scene more perfect. I only have one tiny nitpick with the way some scenes feel repetitive since they neither move the plot forward or give us anything new. Some of these still help to create tension, some feel like they're just… there.\r\n\r\nA Best Picture and Best Actor nominations seem to be on its way, but these are not the only achievements that deserve to be recognized. The original score by Hildur Guðnadóttir is incredibly addictive, so much that I'm listening to it while writing this review. It definitely helps to generate tremendous build-up, and it elevates the sinister environment of Gotham City. Lawrence Sher's cinematography is utterly stunning. The underexposure of some scenes is glorious. Sher paints the screen with so many gorgeous shots, especially with his close-ups on Phoenix, where the latter is able to shine. Jeff Groth is also impeccable in the editing room. There are several long takes with Phoenix just giving his all and letting all his emotions out (or keeping them all contained), which is always something I deeply appreciate since it helps with the flow of the narrative.\r\n\r\nRegarding the film's controversy surrounding its messages and the incentive to violence, I really don't know what to say. It's ridiculous. I remember those times when going into the movie theater was a surreal experience. It was the number one place for people to forget about their lives, jobs, everything. Joker is a fictional story! It's the origin of one of the worst psychopaths in the history of comic-books and cinema. If people expected to leave the theater \"happy\" or \"joyful\", then at least one of the film's message is right: society really is getting crazier. Have people forgotten who Joker is? What could you possibly expect from his origin story?!\r\n\r\nNowadays, no one knows how to behave (social media is the primary source for spreading hate). No one respects the fellow citizen or even the world itself. More and more people only look at their own bellies. Political agendas are everywhere. New extreme movements are created every other year. Social hypersensibility is exponentially growing. The same way some people will hate this movie for not being able (or simply not wanting) to accept that they feel empathy towards a murderer, people all around the world behave like their actions don't reflect on another person's life and on their own planet. If people get ruthlessly violent because they watched Joker, how can someone complain that the film's message is bad when it's eventually true?\r\n\r\nAll in all, Joker is one of the best movies of the year, and it's definitely on my Top3 at the date of this review. Joaquin Phoenix delivers my favorite male performance of 2019, by elevating a script about the origin of one of the evilest villains ever. The way he gradually becomes more insane is worthy of study, but it's how he's able to make the audience create empathy towards a psychopath that leaves me disturbingly captivated. Todd Phillips produces a character-study filled with an astonishingly tense build-up and one of the most chill-inducing payoffs of the last few years. With every single narrative decision nailed perfectly, Hildur Guðnadóttir's score and Lawrence Sher's cinematography stand out. The lack of restraint in showing the unmerciful violence (physical and mental) that society inflicts on one another is what makes us feel unsettled. Because we know it's mostly true, and we refuse to accept it. It's not a film about the Joker. It's a very realistic portrayal of someone (anyone!) who can become someone like him. And it's disturbingly brilliant!\r\n\r\nPS: Robert DeNiro (Murray Franklin) and Zazie Beetz (Sophie Dumond) are also great. Phoenix's performance is so mesmerizing that I almost forgot there were other actors in the movie.\r\n\r\nRating: A",
  "created_at": {
    "$date": "2019-10-04T14:44:13.190Z"
  },
  "updated_at": {
    "$date": "2021-06-23T15:58:27.606Z"
  },
  "helpful": null,
  "not_helpful": null
},
{
  "_id": {
    "$oid": "666b3fca00105718d9a4b793"
  },
  "movie_id": {
    "$oid": "666b0bcbff071d36d47fa07e"
  },
  "user_id": {
    "$oid": "666b38f200105718d9a4b573"
  },
  "content": "Joker. The character that has existed since 1940, has become so heavy with so many different portrayals, different origins, that it feels impossible for any mortal man alive to impersonate the scattered personalities. It is an insurmountable task for any director to digest it all and still produce one more.\r\n\r\nTodd Phillips had a crazy challenge. He brought in one of the best actors alive to lift it with him, Joaquin Phoenix. Together, they have built a mass-market masterpiece which is just above the crop. It is appropriately crazy and completely focussed on the central character. The narrator goes close to the shores of that craziness, wets his feet but remains dry to tell this story. It is like those news reporters which go closer to the burning amazon, but it is impossible to step in the fumes. In no way, Joker is telling his story. Instead, his story is told to us and there are pillars of sanity (like the detectives, asylum clerk etc.) which remain steadfast to give a strong anchor to the audience. This dilutes the effect of the film.\r\n\r\nWith the copious amount of material on Joker already, I wished to consider this film as a standalone character study vaguely inspired by the batman universe. But this is not entirely possible. I was forced to think about it on two levels. With Batman and Without Batman. \r\n\r\nWith Batman, The Joker is on the home turf. There have been many renditions of Joker, and Heath Ledger's portrayal is still vivid in my mind. I knew that Arthur here will go on to become someone who is going to say, “‎Introduce a little anarchy. Upset the established order, and everything becomes chaos. I'm an agent of chaos...”. When I was thinking Joker in the context of Batman, I could not keep Ledger's joker too far away. I was searching for a path for Arthur to go from the mentally unstable to the calculating anarchist. I was left searching for that path when the movie ended. To remain as the crown prince of crime, and to justify the title of the greatest adversary of Batman, just mental instability isn't good enough. He needs to be much more intelligent, much more cunning. These traits are often visible early, In the case of Arthur, I could not find that complete foundation upon which the later psyche can stand. This reminded me of Cameron Monaghan's Jerome Valeska. The joker of my understanding is somewhere between the cruelty of Jerome and pitiable delusions of Arthur. Also, the iconic Batman moment was not needed in this. I kept feeling that Joker is trying to stand with the support of Batman's tale as a clutch. A safety net enforced by the producers.\r\n\r\nOn the other hand, if I consider this movie as a standalone tale, then it was a bit more satisfying. There are tearjerker movies where nothing good ever happens with the protagonist. A series of bad lucks, or difficulties keep blocking a normal life. He is most definitely poor, has a sub-optimal family background, has a medical affliction which is unique and provides a foundation of the pity I felt. This is not very far from Rani Mukharjee's Hichki if you only consider the medical condition. Rani's Naina had Tourette syndrome while Joaquin's Arthur suffers from pseudobulbar affect. The setting and genre make the two films vastly different. More often than not, I have noticed these disorders lift a lot of burden from the narrative. In the case of Joker, couple his disorder with usually being in the wrong place at the wrong time, you have a travesty of human life. Add to that, an unstable parent, amplify it with the volatile societal conditions, you have a perfect decoction of what Joker is made of. As a tale of its own, it works. The delivery is great thanks to the spectacular performance. It also helps to increase the awareness of mental health. But when you strip off all the Batman context, it remains a well-acted and averagely written tale. \r\n\r\nUnfortunately, this is a single film, and I felt it is torn between these two polarising treatments. It wants to find its ground, which it finds. But that ground is far from being sensational. It remains somewhat indecisive. It can not be well soaked in Batman lore like James Gordon's tale, Gotham is. I am considering Gotham because both Gotham and Joker do not feature Batman, but they both have Bruce. Gotham understands its lore and fully embraces it but Joker does not want to. At the same time, as a tale of the psychologically troubled protagonist, Joker tries to play safe with the aim to please audience en-mass. I kept thinking about American Psycho and The Machinist. (Coincidently, both star ex-Batman Christian Bale). Those two take you in the psyche of the protagonist. Those take you inside the burning Amazon and not stand at a safe distance. Joker does not aim to do so. \r\n\r\nI am not at all qualified to talk about the acting performances. Joaquin Phoenix is in every frame and the way he waltzes between emotions is terrifyingly amazing. The Tai Chi to calm himself down, the menacing stare when finally becomes the Joker, those are chilling. He lives the character to the best of his abilities. Regrettably, he does not have the same level of writing support which Heath Ledger had and so due to no fault of his own, Joaquin could not topple Heath Ledger's portrayal of the crown prince of crime.\r\n\r\nIf I consider Todd Philips's entire resume, this was a genre shift for him. He knew very well that the biggest trump card is Joaquin Phoenix, so he takes no risk. He keeps him in focus, almost always all the setting and cinematography works for him. The only exception being Robert De Niro. Robert is allowed to carry his scenes quite independently. I think Todd Philips relied on both these giants to carry their parts. Sadly, I had gone to a theatre which had a bad print or screen so I think I will have to watch it again sometimes to enjoy the cinematography.\r\n\r\nI realised, I kept writing a lot and this is already over a thousand words. If you are here and reading still, I must say thank you. To summarise, The Joker worked for me and I enjoyed it, but I would not consider it the best depication of the iconic villain from comic books. The best may yet come.",
  "created_at": {
    "$date": "2019-10-20T10:18:11.465Z"
  },
  "updated_at": {
    "$date": "2021-06-23T15:58:28.173Z"
  },
  "helpful": null,
  "not_helpful": null
},
{
  "_id": {
    "$oid": "666b3fca00105718d9a4b794"
  },
  "movie_id": {
    "$oid": "666b0bcbff071d36d47fa07e"
  },
  "user_id": {
    "$oid": "666b38f200105718d9a4b575"
  },
  "content": "The Joker is similar to the DC Joker character but is not a criminal genius. The movie was a great depiction of how a person who has been mistreated, lied to, and ignored, totally lacking access to human compassion, can snap. The acting is top notch, and it puts a spotlight on the importance of mental health in modern times.",
  "created_at": {
    "$date": "2019-10-27T04:42:49.176Z"
  },
  "updated_at": {
    "$date": "2021-06-23T15:58:28.328Z"
  },
  "helpful": null,
  "not_helpful": null
},
{
  "_id": {
    "$oid": "666b3fca00105718d9a4b795"
  },
  "movie_id": {
    "$oid": "666b0bcbff071d36d47fa07e"
  },
  "user_id": {
    "$oid": "666b38f200105718d9a4b577"
  },
  "content": "Okay, this film has already been so widely debated that I’m not sure what I can really add to the conversation. So, I’ll just give my thoughts.\r\n\r\n“Joker” is a fairly basic character study of Arthur Fleck, a mentally ill man who feels increasingly marginalized by an uncaring and brutal society in Gotham City. To start, the characters, except for Arthur himself, are pretty flat. They seem to have little purpose other than to further Arthur’s story. This includes Thomas Wayne, who in other media is portrayed as a man of many dimensions, wealthy but caring, and instilling these values in his son Bruce. Here, he is portrayed as much more uncaring and elitist. Which gives much less of an impact in the inevitable alley scene we see in everything remotely related to Batman. More on this in a minute. It’s important to the point.\r\n\r\nArthur suffers a condition that makes him burst into laughter at inappropriate times. He also has other unspecified mental illnesses. We’re never given the specifics. This is actually a little troubling because of the general depiction of mental illness. It almost seems like they are saying that if someone is mentally ill then they are a ticking time bomb and it’s only a matter of time before they go off. This is not a good look.\r\n\r\nAfter a series of events, Arthur begins spiraling downward, but at the same time realizes how much influence he can have over other people, an aspect of the Joker that isn’t often explored. And this is where the characters other than Arthur being rather flat comes into play.\r\n\r\nThere’s more than one indication that we are actually witnessing these events through Arthur’s eyes. And this creates a brilliant depiction of a narcissistic personality. The only character that gets fully fleshed out is Arthur himself, but he can’t or won’t connect with other people to see their depth. As such, we get to see narcissism from the inside, no connection to others and in fact seeing them as pawns in his own schemes. It’s subtle and definitely not in your face, but if you look carefully, the hints are there.\r\n\r\nThose who fear that \"Joker\" would glorify incel violence or otherwise can rest a little easier, but as I mentioned, the film isn't without its troubling portrayals. It does vilify the mentally ill, which creates a whole host of other issues. The movie swings wildly between \"excellent\" and just \"okay,\" and sometimes even \"meh.\" As such, it gets a recommendation, but only a mild one.",
  "created_at": {
    "$date": "2019-11-24T00:24:53.294Z"
  },
  "updated_at": {
    "$date": "2021-06-23T15:58:29.293Z"
  },
  "helpful": null,
  "not_helpful": null
},
{
  "_id": {
    "$oid": "666b3fca00105718d9a4b796"
  },
  "movie_id": {
    "$oid": "666b0bcbff071d36d47fa07e"
  },
  "user_id": {
    "$oid": "666b38f200105718d9a4b548"
  },
  "content": "*A Masterpiece*.\r\n\r\nThe movie shows the escalating events that made Arthur become the Joker. Initially an inoffensive poor and sick man, Arthur suffered a tide of unfortunate events that pushed him closer and closer to the edge. \r\n\r\nIgnored and despised by everyone, sick and alone in the world, and neglected by the State, Arthur becomes progressively more violent until he breaks.\r\n\r\nMuch more than one more Super-hero movie, *Joker* uses well-known characters to promote the reflection on the \"ignored\" ones. At least, ignored until they become a Joker.",
  "created_at": {
    "$date": "2019-11-30T14:12:54.562Z"
  },
  "updated_at": {
    "$date": "2021-06-23T15:58:29.470Z"
  },
  "helpful": null,
  "not_helpful": null
},
{
  "_id": {
    "$oid": "666b3fca00105718d9a4b797"
  },
  "movie_id": {
    "$oid": "666b0bcbff071d36d47fa07e"
  },
  "user_id": {
    "$oid": "666b38f200105718d9a4b57a"
  },
  "content": "***Not fun, but absorbing, artistic and tragic***\r\n\r\nA mentally troubled middle-aged clown (Joaquin Phoenix) who lives with his mother (Frances Conroy) in Gotham City goes from not good to worse when he finally realizes his true identity. Robert DeNiro plays a talk show host and Zazie Beetz the friendly girl down the hall. Brett Cullen is on hand as Thomas Wayne, Bruce’s rich father.   \r\n\r\n\"Joker\" (2019) is an arty, slow-burn character study of the popular DC Comics’ villain, but it’s more of a psychological crime drama/thriller and tragedy than a superhero flick (or, in this case, supervillain). The movie’s captivating from the get-go and practically everything works for a broodingly superb cinematic experience. \r\n\r\nThere are several amusing bits, but this ain’t a fun flick. It’s heavy and tragic. But what’s the message? Simply that this is how a quirky man who wanted to make people laugh became The Joker. He’s a little reminiscent of the clown in Steve Gerber’s “Night of the Laughing Dead” in Man-Thing #5 (1974).     \r\n\r\nThe movie runs 2 hours, 2 minutes, and was shot in New York City (Bronx, Harlem, Manhattan) and nearby New Jersey (Jersey City & Newark).  \r\n\r\nGRADE: A-/A",
  "created_at": {
    "$date": "2019-12-15T02:47:06.716Z"
  },
  "updated_at": {
    "$date": "2021-06-23T15:58:29.935Z"
  },
  "helpful": null,
  "not_helpful": null
},
{
  "_id": {
    "$oid": "666b3fca00105718d9a4b798"
  },
  "movie_id": {
    "$oid": "666b0bcbff071d36d47fa07e"
  },
  "user_id": {
    "$oid": "666b38f200105718d9a4b4ce"
  },
  "content": "_Joker_ is a tour-de-force of a movie, not quite like anything I've seen, maybe since Taxi Driver. At its core it's a movie about the breaking point of a broken man, wrapped under the banner of a comic book movie that, take out the Waynes, works on its own.\r\nJoaquin Phoenix truly gives a transformative performance (not unlike Heath Ledger) and will say is deserving of an Academy Award. The supporting cast all did well, though, and it is a small role, Zazie Beetz was great and De Niro had his moments, particularly at the end.\r\n\r\nGot to hand it to Todd Phillips, between this and the good, albeit flawed, War Dogs, has proven to be more than those Hangover movies.\r\n\r\nNo, this isn't a feel-good movie and while it does sit at the top of my 2019 list, not entirely sure when I'd revisit. **4.75/5**",
  "created_at": {
    "$date": "2020-01-03T00:19:19.624Z"
  },
  "updated_at": {
    "$date": "2021-06-23T15:58:31.509Z"
  },
  "helpful": null,
  "not_helpful": null
},
{
  "_id": {
    "$oid": "666b3fca00105718d9a4b799"
  },
  "movie_id": {
    "$oid": "666b0bcbff071d36d47fa07e"
  },
  "user_id": {
    "$oid": "666b38f200105718d9a4b57d"
  },
  "content": "the ‘Hangover 2 & 3’, the two most uncomfortable comedies he’s ever directed that felt more crime drama than anything funny. There’s also some dark humor in ‘Joker’ that involves a door chain. It’s silly, yet absolutely terrifying with the given context. A complete departure from his other work and that’s why I think it’s one of his best. I honestly think he made something so unique and meaningful. Seriously, I do.\r\n\r\nThe score by Hildur Guðnadóttir helped set the tone tremendously. A melancholy tone with a chaotic twist. A representation of Arthur slowly drowning in his own misery and pain. A little fun fact: The score for the film were written based on the script even before the actual filming of the movie started, which I think is the best way to do it, if you ask me. Someone to imagine movie by songs and incorporate their interpretation through music.\r\n\r\nThe cinematography was gorgeous and there’s a handful of shots that has imprinted into my memory. Lawrence Sher does an excellent job off showing the decaying Gotham city and the sewer waste look of the city. Bright neon lights with striking colors that manage to make the most run down of places look pretty.\r\n\r\nI like how they actually gave Thomas Wayne a character rather than “guy gets shot in alleyway”. He’s portrayed as a ruthless man with blunt ways of saving Gotham City. However he loves his wife and son, so his unforgiving attitude was all for the shake of keeping his loved ones safe. He’s also a massive movie buff where he often goes to watch the classics on the big screen. So it’s an interesting take on the character viewed in somebody’s else perspective.\r\n\r\nThere’s a scene where Arthur goes to watch a comedy standup show to take notes on a comedians act. Every time a joke is told and everyone laughs, his face is frozen in place with an unsure grin while his eyes look around the room wondering why everyone’s laughing, but when the laughter dies down he jumps to live with a delayed laugh. It’s moments like that are simple, yet says a lot about him. Basically showing how disconnected he is with humor and everyone else.\r\n\r\nNow lets talk about the controversy that's been surrounding this movie:\r\n\r\nThis is one of the most ludicrous controversy in recent memory. The movie will not cause or inspire violence, but shows why violence happens. I mean, there probably has been incidents when somebody committed a horrendous crime because their were influenced by a movie or a game. However, it’s he/she that should be brought into question, not the creators. Maybe this movie could inspire people to think twice about how they treat others. Why not think about the positives? If “Joker” is going to be responsible for violence and mass shootings, then so is every other movie with any form of violence ever. If people really care about how violence is portrayed in movies, then Rob Zombies ‘3 From Hell’ should also receive the same attention. Just imagine ‘Natural Born Killers’ times 100, but I guess it’s not mainstream enough for any of that. And sure, there’s some brutal and raw approach to violence in ‘Joker’, but we all have seen worst. ‘Deadpool’ is more graphic than this. It's not the directors duty to teach morals to the viewer. People will never learn to stop pointing fingers at things to blame and actually do something about it! People often understandment how much power their got.\r\n\r\nAnywhere, sorry about that folks, just had to get that off my chest. Go and check it out.\r\n\r\nOverall rating: “Send in the clowns” ⇠ you’ve gotta sing that like Frank Sinatra.",
  "created_at": {
    "$date": "2020-01-27T18:07:32.017Z"
  },
  "updated_at": {
    "$date": "2021-06-23T15:58:33.464Z"
  },
  "helpful": null,
  "not_helpful": null
},
{
  "_id": {
    "$oid": "666b3fca00105718d9a4b79a"
  },
  "movie_id": {
    "$oid": "666b0bcbff071d36d47fa07e"
  },
  "user_id": {
    "$oid": "666b38f200105718d9a4b57f"
  },
  "content": "It is intersting to analyze this movie in a context of global increase of violent social movements against the Establishment. Joker succeed in making me accept a violent reactions without really explicit political fundation.",
  "created_at": {
    "$date": "2020-01-29T18:18:26.733Z"
  },
  "updated_at": {
    "$date": "2021-06-23T15:58:33.586Z"
  },
  "helpful": null,
  "not_helpful": null
},
{
  "_id": {
    "$oid": "666b3fca00105718d9a4b79b"
  },
  "movie_id": {
    "$oid": "666b0bcbff071d36d47fa07e"
  },
  "user_id": {
    "$oid": "666b38f200105718d9a4b4d0"
  },
  "content": "This is going to be one of those posts where I go against the mainstream but my reaction when I watched this movie was: You got to be f… kidding me?\r\n\r\nThe only resemblance to the REAL joker in this movie is the name. As far as I am concerned this movie is an insult to the fans of Batman and the REAL Joker.\r\n\r\nThe “Joker” in this move is a unintelligent deranged nutcase. There is a sob story in the background about how he became that way which is totally uninteresting.\r\n\r\nThe REAL joker is a intelligent criminal mastermind. I was waiting for this nutcase to actually become that for the entire movie. Spoiler alert, it never happened! This guy starts as a useless sobbing nutcase and he ends the movie as the same useless sobbing nutcase.\r\n\r\nThe movie has NOTHING to do with the real Joker. It is a blatant attempt to garner support for a unrelated psychopathic thriller by using the Joker name. If it would have been advertised as such I probably would have, if not liked it, so at least appreciated it for it’s qualities. It is indeed a well done movie technically and the main character is indeed excellently performed.\r\n\r\nHowever, even if I try to distance myself from the deceitful Joker label, I find it overall boring, too long and really a movie about a psychopath probably made by someone with mental issues himself. But then that’s Hollywood today.\r\n\r\nThat the politically biased and elitist so called “critics” on sites like Rotten Tomatoes like it is not really surprising but I have to confess that I am somewhat surprised at the rave ratings by real viewers on some other sites.\r\n\r\nHonestly, I was expecting to be disappointing by this movie. Then I am always cautious about movies getting rave reviews, especially from the previously mentioned totally useless and crappy “review” site. I did not expect this level of disappointment though. Epic fail as far as I am concerned.",
  "created_at": {
    "$date": "2020-02-19T19:30:02.315Z"
  },
  "updated_at": {
    "$date": "2021-06-23T15:58:34.194Z"
  },
  "helpful": null,
  "not_helpful": null
},
{
  "_id": {
    "$oid": "666b3fca00105718d9a4b79c"
  },
  "movie_id": {
    "$oid": "666b0bcbff071d36d47fa07e"
  },
  "user_id": {
    "$oid": "666b38f200105718d9a4b582"
  },
  "content": "Joker made me laugh , cry , and made me feel scared . This movie isn't your run of the mill superhero flick this is a gritty  homage to that of films made by the great Martin Scorsese . Some scenes will have you in shock and awe without breaking away from what Arthur sees and feels as he lives in an 80's era Gotham living with <a href=\"https://paperhelp.nyc/\">paper help</a> and his mom and a mental disorder (Pseudobulbar affect if I'm not mistaken ) , the film also adds the unreliable narrator aspect ( where the camera can show you something that either isn't real or isn't happening), besides that the acting is phenomenal, Joaquin Phoenix really brings his A game, showing Arthur fleck as a loving, kind individual that just wants to make you laugh but is beaten down by an ever changing society that both beat him down and in the end breaks him. This movie also adds the idea of the \"one bad day\" theme from the killing joke comic where in the comic joker says and i quote '' all it takes is one bad day to bring the sanest man to lunacy \" and it takes that idea and brings it to the forefront. In conclusion I think joker was beyond amazing, between the acting, music score and set pieces it was a wild (and scary) ride . Symbolism also sneaks into the movie with slight things you wouldn't notice upon first watching . This movie leaves you confused on what was real and what wasn't . In the end between you and your spouse , friend , or family member will have reasons on what was real and what wasn't  and that's what made the movie even better for me , how it left me talking days after and like dark knight and iron man before this i believe that joker will change the superhero movie genre forever... send in the clowns 10/10 would see again",
  "created_at": {
    "$date": "2020-09-11T10:56:51.682Z"
  },
  "updated_at": {
    "$date": "2021-06-23T15:58:44.237Z"
  },
  "helpful": null,
  "not_helpful": null
},
{
  "_id": {
    "$oid": "666b3fca00105718d9a4b79d"
  },
  "movie_id": {
    "$oid": "666b0bcbff071d36d47fa07e"
  },
  "user_id": {
    "$oid": "666b38f200105718d9a4b48f"
  },
  "content": "Each to their own, as always, but for me: Incredible!\r\n\r\nI was fully aware of <em>'Joker'</em> ever since its release, impossible not to be given the extraordinary hype that surrounded it, but it still absolutely surpassed my expectations - a sensational film. I adored every second of this; and I'm not even a Joker/DC Comics etc. 'fan'.\r\n\r\nJoaquin Phoenix gives an astonishingly outstanding performance as the titular character, undoubtedly one of the greatest showings that I've ever seen from an actor. I'm not one that takes notice of awards, but he is fully deserving of anything of that ilk that he won due to this. Quality!\r\n\r\nEverything else about the film is fantastic. Great score, great cinematography, great pacing... it's all just utterly superb and makes for a spectacular watch. I love that they avoided just going wall-to-wall crazy with this, don't get me wrong things get mad but there's more to it than just violence et al.\r\n\r\nI had presumed that I was going to enjoy this, but it honestly smashed any predictions I had about it before seeing it. Even after just one viewing, I can already state it's one of my favourite films. Excellent!",
  "created_at": {
    "$date": "2021-04-12T01:16:15.424Z"
  },
  "updated_at": {
    "$date": "2021-06-23T15:58:54.317Z"
  },
  "helpful": null,
  "not_helpful": null
},
{
  "_id": {
    "$oid": "666b3fca00105718d9a4b79e"
  },
  "movie_id": {
    "$oid": "666b0bcbff071d36d47fa07e"
  },
  "user_id": {
    "$oid": "666b38f200105718d9a4b4d2"
  },
  "content": "Carried by a terrific Phoenix, ‘Joker’ leaves an emotional impact as we see a bullied clown slowly transform into someone who enjoys creating chaos. Too bad we don't get to enjoy Phoenix as Joker more, though, because pretty soon after the turning point, the movie ends.\r\n\r\n10/10",
  "created_at": {
    "$date": "2022-02-26T21:11:21.299Z"
  },
  "updated_at": {
    "$date": "2022-02-26T21:11:21.299Z"
  },
  "helpful": null,
  "not_helpful": null
},
{
  "_id": {
    "$oid": "666b3fca00105718d9a4b79f"
  },
  "movie_id": {
    "$oid": "666b0bcbff071d36d47fa07e"
  },
  "user_id": {
    "$oid": "666b38f200105718d9a4b586"
  },
  "content": "It was exactly what it wanted to be, and it pulled it off perfectly. The \"slow\" parts add a lot to the atmosphere and it all culminates in a dramatic and unforgettable ending.",
  "created_at": {
    "$date": "2022-05-14T01:06:07.034Z"
  },
  "updated_at": {
    "$date": "2022-06-15T19:25:02.498Z"
  },
  "helpful": null,
  "not_helpful": null
},
{
  "_id": {
    "$oid": "666b3fca00105718d9a4b7a0"
  },
  "movie_id": {
    "$oid": "666b0bcbff071d36d47fa07e"
  },
  "user_id": {
    "$oid": "666b38f200105718d9a4b588"
  },
  "content": "I knew it was gonna be super hard for me to like a Joker after Heath Ledger... Cameron in Gotham did awesome, Leto was really insane as Mr. J. But, I wanted a Joker stand alone... And this is what they gave me...\r\n\r\nBrilliant. From start to finish i just was on the edge of my seat. This movie pulled at my heart. I saw myself in this character and understand every reason why a series of bad days could make a person ... Snap. Well done.",
  "created_at": {
    "$date": "2022-07-26T08:42:51.056Z"
  },
  "updated_at": {
    "$date": "2022-07-26T14:24:11.525Z"
  },
  "helpful": null,
  "not_helpful": null
},
{
  "_id": {
    "$oid": "666b3fca00105718d9a4b7a1"
  },
  "movie_id": {
    "$oid": "666b0bcbff071d36d47fa07e"
  },
  "user_id": {
    "$oid": "666b38f200105718d9a4b58a"
  },
  "content": "It's not an incel movie, despite what people are saying. And it's no a White Supremacy film either. It's not even a pro T-word president film. In fact, it addresses some pretty heavy left wing issues. Or at least issues that were traditionally on the left before things went...weird and all topsy turvy.\r\n\r\nHowever, it is also NOT a Marvel Film, so of you are walking in expecting a Marvel style movie you will walk out hating it. So don't go in expecting an MCU film.\r\n\r\nInstead you get a dramatic, slow moving, intensely building movie that develops it's characters.\r\n\r\nAnd it really develops them, when you start watching the film the Joker was sympathetic... and by the time you walked out you really hated him.\r\n\r\nAnd that is all I feel comfortable saying without spoiling things.",
  "created_at": {
    "$date": "2023-01-12T02:13:40.091Z"
  },
  "updated_at": {
    "$date": "2023-01-12T02:13:40.252Z"
  },
  "helpful": null,
  "not_helpful": null
},
{
  "_id": {
    "$oid": "666b3fca00105718d9a4b7a2"
  },
  "movie_id": {
    "$oid": "666b0bcbff071d36d47fa07e"
  },
  "user_id": {
    "$oid": "666b38f200105718d9a4b58c"
  },
  "content": "Really crazy dramatized movie. Slowly watching him go crazy. Pretty shocking ending and I wasn't expecting it.",
  "created_at": {
    "$date": "2023-07-06T15:36:52.490Z"
  },
  "updated_at": {
    "$date": "2023-07-06T15:36:52.571Z"
  },
  "helpful": null,
  "not_helpful": null
},
{
  "_id": {
    "$oid": "666b3fca00105718d9a4b7a3"
  },
  "movie_id": {
    "$oid": "666b0bcbff071d36d47fa07e"
  },
  "user_id": {
    "$oid": "666b38f200105718d9a4b58e"
  },
  "content": "The scenario told in this film depicts a situation in which we frequently disregard the feelings and situations of others around us, people who may not have the same advantages as us. We can sense the psychological upheaval that Joker is experiencing from his point of view. All disappointment and rage build up and eventually explode. The people of Gotham rebelled as a result of their dissatisfaction and indignation at the injustice they faced.\r\n\r\nThe Joker is also seen dancing on a car in the midst of the rioting, surrounded by people shouting his name. Making them an embodiment of \"Hero\" in order for them to share their ideas.\r\n\r\nRead more for Indonesian review in\r\nhttp://www.alunauwie.com/2020/07/joker-all-i-have-are-negative-thoughts.html",
  "created_at": {
    "$date": "2023-10-25T06:06:54.631Z"
  },
  "updated_at": {
    "$date": "2023-10-25T16:00:22.483Z"
  },
  "helpful": null,
  "not_helpful": null
},
{
  "_id": {
    "$oid": "666b3fca00105718d9a4b7a4"
  },
  "movie_id": {
    "$oid": "666b0bcbff071d36d47fa07e"
  },
  "user_id": {
    "$oid": "666b38f200105718d9a4b590"
  },
  "content": "Joker, portrait of a psychopath but beloved by a nation\r\n\r\nIn the science fiction genre of Hollywood cinema, especially the superhero genre, many movies have been made that include different dimensions of humans. Courage and effort for the survival of the family are among these dimensions.\r\nIn 2019, on the silver screen of Hollywood, we see a masterpiece that indescribably takes us back to our childhood.\r\nThat's right, Joker\r\nAfter Nolan's masterpiece, which we mainly remember as the Joker with Heath Ledger's fantastic role, we haven't seen a significant work on this DC character.\r\n Considering the unique and brilliant history of Phoenix in the cinema, we can be sure that he can handle this role and he is right.\r\nIn the first scene of the movie, we see Arthur being rejected by society. He has experienced all the behavior that a citizen can imagine in his life.\r\nHe is treated by a government consultant, but the consultant never tells him the root cause of these illnesses and depressions.\r\nPerhaps the most important reason for Arthur's illness or the hundreds of unknown patients in the sunken city of Gotham is the failure to properly attend to human needs. In this city, everyone thinks about himself. Even the mayor, who is at the head of this great responsibility of meeting the needs of the citizens. Is.\r\n\r\nIn the scene where Arthur kills his mother, it is clear that Arthur is ready to destroy the dearest person in his life. We do not want to say here whether Arthur is guilty or not. Because as it is clear from the course of the film, Arthur's mother has given him a hard blow in the past.\r\nNothing matters to Arthur anymore. He leads the people of Gotham in a great uprising.\r\nIt can also be mentioned here that every single person in Gotham is an Arthur who all listen to the order of their leader Arthur and prepare for a big fight.\r\n\r\nArthur’s maniacal laughter is a sign of Phoenix’s strength in this role. The story takes the audience with it from the very beginning, and in this 2-hour journey, the audience cannot even blink. \r\n\r\nAnalysis: Mehdi Ebrahimzadeh",
  "created_at": {
    "$date": "2024-04-08T13:03:39.998Z"
  },
  "updated_at": {
    "$date": "2024-04-09T15:46:36.979Z"
  },
  "helpful": null,
  "not_helpful": null
}]